
*** Dumping AST Record Layout
         0 | struct __NSConstantString_tag
         0 |   const int * isa
         8 |   int flags
        16 |   const char * str
        24 |   long length
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkExtent2D
         0 |   uint32_t width
         4 |   uint32_t height
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct VkExtent3D
         0 |   uint32_t width
         4 |   uint32_t height
         8 |   uint32_t depth
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkOffset2D
         0 |   int32_t x
         4 |   int32_t y
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct VkOffset3D
         0 |   int32_t x
         4 |   int32_t y
         8 |   int32_t z
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkRect2D
         0 |   struct VkOffset2D offset
         0 |     int32_t x
         4 |     int32_t y
         8 |   struct VkExtent2D extent
         8 |     uint32_t width
        12 |     uint32_t height
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct VkBaseInStructure
         0 |   VkStructureType sType
         8 |   const struct VkBaseInStructure * pNext
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct VkBaseOutStructure
         0 |   VkStructureType sType
         8 |   struct VkBaseOutStructure * pNext
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct VkAllocationCallbacks
         0 |   void * pUserData
         8 |   PFN_vkAllocationFunction pfnAllocation
        16 |   PFN_vkReallocationFunction pfnReallocation
        24 |   PFN_vkFreeFunction pfnFree
        32 |   PFN_vkInternalAllocationNotification pfnInternalAllocation
        40 |   PFN_vkInternalFreeNotification pfnInternalFree
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkApplicationInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const char * pApplicationName
        24 |   uint32_t applicationVersion
        32 |   const char * pEngineName
        40 |   uint32_t engineVersion
        44 |   uint32_t apiVersion
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkFormatProperties
         0 |   VkFormatFeatureFlags linearTilingFeatures
         4 |   VkFormatFeatureFlags optimalTilingFeatures
         8 |   VkFormatFeatureFlags bufferFeatures
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkImageFormatProperties
         0 |   struct VkExtent3D maxExtent
         0 |     uint32_t width
         4 |     uint32_t height
         8 |     uint32_t depth
        12 |   uint32_t maxMipLevels
        16 |   uint32_t maxArrayLayers
        20 |   VkSampleCountFlags sampleCounts
        24 |   VkDeviceSize maxResourceSize
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkInstanceCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkInstanceCreateFlags flags
        24 |   const VkApplicationInfo * pApplicationInfo
        32 |   uint32_t enabledLayerCount
        40 |   const char *const * ppEnabledLayerNames
        48 |   uint32_t enabledExtensionCount
        56 |   const char *const * ppEnabledExtensionNames
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryHeap
         0 |   VkDeviceSize size
         8 |   VkMemoryHeapFlags flags
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryType
         0 |   VkMemoryPropertyFlags propertyFlags
         4 |   uint32_t heapIndex
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceFeatures
         0 |   VkBool32 robustBufferAccess
         4 |   VkBool32 fullDrawIndexUint32
         8 |   VkBool32 imageCubeArray
        12 |   VkBool32 independentBlend
        16 |   VkBool32 geometryShader
        20 |   VkBool32 tessellationShader
        24 |   VkBool32 sampleRateShading
        28 |   VkBool32 dualSrcBlend
        32 |   VkBool32 logicOp
        36 |   VkBool32 multiDrawIndirect
        40 |   VkBool32 drawIndirectFirstInstance
        44 |   VkBool32 depthClamp
        48 |   VkBool32 depthBiasClamp
        52 |   VkBool32 fillModeNonSolid
        56 |   VkBool32 depthBounds
        60 |   VkBool32 wideLines
        64 |   VkBool32 largePoints
        68 |   VkBool32 alphaToOne
        72 |   VkBool32 multiViewport
        76 |   VkBool32 samplerAnisotropy
        80 |   VkBool32 textureCompressionETC2
        84 |   VkBool32 textureCompressionASTC_LDR
        88 |   VkBool32 textureCompressionBC
        92 |   VkBool32 occlusionQueryPrecise
        96 |   VkBool32 pipelineStatisticsQuery
       100 |   VkBool32 vertexPipelineStoresAndAtomics
       104 |   VkBool32 fragmentStoresAndAtomics
       108 |   VkBool32 shaderTessellationAndGeometryPointSize
       112 |   VkBool32 shaderImageGatherExtended
       116 |   VkBool32 shaderStorageImageExtendedFormats
       120 |   VkBool32 shaderStorageImageMultisample
       124 |   VkBool32 shaderStorageImageReadWithoutFormat
       128 |   VkBool32 shaderStorageImageWriteWithoutFormat
       132 |   VkBool32 shaderUniformBufferArrayDynamicIndexing
       136 |   VkBool32 shaderSampledImageArrayDynamicIndexing
       140 |   VkBool32 shaderStorageBufferArrayDynamicIndexing
       144 |   VkBool32 shaderStorageImageArrayDynamicIndexing
       148 |   VkBool32 shaderClipDistance
       152 |   VkBool32 shaderCullDistance
       156 |   VkBool32 shaderFloat64
       160 |   VkBool32 shaderInt64
       164 |   VkBool32 shaderInt16
       168 |   VkBool32 shaderResourceResidency
       172 |   VkBool32 shaderResourceMinLod
       176 |   VkBool32 sparseBinding
       180 |   VkBool32 sparseResidencyBuffer
       184 |   VkBool32 sparseResidencyImage2D
       188 |   VkBool32 sparseResidencyImage3D
       192 |   VkBool32 sparseResidency2Samples
       196 |   VkBool32 sparseResidency4Samples
       200 |   VkBool32 sparseResidency8Samples
       204 |   VkBool32 sparseResidency16Samples
       208 |   VkBool32 sparseResidencyAliased
       212 |   VkBool32 variableMultisampleRate
       216 |   VkBool32 inheritedQueries
           | [sizeof=220, align=4]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceLimits
         0 |   uint32_t maxImageDimension1D
         4 |   uint32_t maxImageDimension2D
         8 |   uint32_t maxImageDimension3D
        12 |   uint32_t maxImageDimensionCube
        16 |   uint32_t maxImageArrayLayers
        20 |   uint32_t maxTexelBufferElements
        24 |   uint32_t maxUniformBufferRange
        28 |   uint32_t maxStorageBufferRange
        32 |   uint32_t maxPushConstantsSize
        36 |   uint32_t maxMemoryAllocationCount
        40 |   uint32_t maxSamplerAllocationCount
        48 |   VkDeviceSize bufferImageGranularity
        56 |   VkDeviceSize sparseAddressSpaceSize
        64 |   uint32_t maxBoundDescriptorSets
        68 |   uint32_t maxPerStageDescriptorSamplers
        72 |   uint32_t maxPerStageDescriptorUniformBuffers
        76 |   uint32_t maxPerStageDescriptorStorageBuffers
        80 |   uint32_t maxPerStageDescriptorSampledImages
        84 |   uint32_t maxPerStageDescriptorStorageImages
        88 |   uint32_t maxPerStageDescriptorInputAttachments
        92 |   uint32_t maxPerStageResources
        96 |   uint32_t maxDescriptorSetSamplers
       100 |   uint32_t maxDescriptorSetUniformBuffers
       104 |   uint32_t maxDescriptorSetUniformBuffersDynamic
       108 |   uint32_t maxDescriptorSetStorageBuffers
       112 |   uint32_t maxDescriptorSetStorageBuffersDynamic
       116 |   uint32_t maxDescriptorSetSampledImages
       120 |   uint32_t maxDescriptorSetStorageImages
       124 |   uint32_t maxDescriptorSetInputAttachments
       128 |   uint32_t maxVertexInputAttributes
       132 |   uint32_t maxVertexInputBindings
       136 |   uint32_t maxVertexInputAttributeOffset
       140 |   uint32_t maxVertexInputBindingStride
       144 |   uint32_t maxVertexOutputComponents
       148 |   uint32_t maxTessellationGenerationLevel
       152 |   uint32_t maxTessellationPatchSize
       156 |   uint32_t maxTessellationControlPerVertexInputComponents
       160 |   uint32_t maxTessellationControlPerVertexOutputComponents
       164 |   uint32_t maxTessellationControlPerPatchOutputComponents
       168 |   uint32_t maxTessellationControlTotalOutputComponents
       172 |   uint32_t maxTessellationEvaluationInputComponents
       176 |   uint32_t maxTessellationEvaluationOutputComponents
       180 |   uint32_t maxGeometryShaderInvocations
       184 |   uint32_t maxGeometryInputComponents
       188 |   uint32_t maxGeometryOutputComponents
       192 |   uint32_t maxGeometryOutputVertices
       196 |   uint32_t maxGeometryTotalOutputComponents
       200 |   uint32_t maxFragmentInputComponents
       204 |   uint32_t maxFragmentOutputAttachments
       208 |   uint32_t maxFragmentDualSrcAttachments
       212 |   uint32_t maxFragmentCombinedOutputResources
       216 |   uint32_t maxComputeSharedMemorySize
       220 |   uint32_t[3] maxComputeWorkGroupCount
       232 |   uint32_t maxComputeWorkGroupInvocations
       236 |   uint32_t[3] maxComputeWorkGroupSize
       248 |   uint32_t subPixelPrecisionBits
       252 |   uint32_t subTexelPrecisionBits
       256 |   uint32_t mipmapPrecisionBits
       260 |   uint32_t maxDrawIndexedIndexValue
       264 |   uint32_t maxDrawIndirectCount
       268 |   float maxSamplerLodBias
       272 |   float maxSamplerAnisotropy
       276 |   uint32_t maxViewports
       280 |   uint32_t[2] maxViewportDimensions
       288 |   float[2] viewportBoundsRange
       296 |   uint32_t viewportSubPixelBits
       304 |   size_t minMemoryMapAlignment
       312 |   VkDeviceSize minTexelBufferOffsetAlignment
       320 |   VkDeviceSize minUniformBufferOffsetAlignment
       328 |   VkDeviceSize minStorageBufferOffsetAlignment
       336 |   int32_t minTexelOffset
       340 |   uint32_t maxTexelOffset
       344 |   int32_t minTexelGatherOffset
       348 |   uint32_t maxTexelGatherOffset
       352 |   float minInterpolationOffset
       356 |   float maxInterpolationOffset
       360 |   uint32_t subPixelInterpolationOffsetBits
       364 |   uint32_t maxFramebufferWidth
       368 |   uint32_t maxFramebufferHeight
       372 |   uint32_t maxFramebufferLayers
       376 |   VkSampleCountFlags framebufferColorSampleCounts
       380 |   VkSampleCountFlags framebufferDepthSampleCounts
       384 |   VkSampleCountFlags framebufferStencilSampleCounts
       388 |   VkSampleCountFlags framebufferNoAttachmentsSampleCounts
       392 |   uint32_t maxColorAttachments
       396 |   VkSampleCountFlags sampledImageColorSampleCounts
       400 |   VkSampleCountFlags sampledImageIntegerSampleCounts
       404 |   VkSampleCountFlags sampledImageDepthSampleCounts
       408 |   VkSampleCountFlags sampledImageStencilSampleCounts
       412 |   VkSampleCountFlags storageImageSampleCounts
       416 |   uint32_t maxSampleMaskWords
       420 |   VkBool32 timestampComputeAndGraphics
       424 |   float timestampPeriod
       428 |   uint32_t maxClipDistances
       432 |   uint32_t maxCullDistances
       436 |   uint32_t maxCombinedClipAndCullDistances
       440 |   uint32_t discreteQueuePriorities
       444 |   float[2] pointSizeRange
       452 |   float[2] lineWidthRange
       460 |   float pointSizeGranularity
       464 |   float lineWidthGranularity
       468 |   VkBool32 strictLines
       472 |   VkBool32 standardSampleLocations
       480 |   VkDeviceSize optimalBufferCopyOffsetAlignment
       488 |   VkDeviceSize optimalBufferCopyRowPitchAlignment
       496 |   VkDeviceSize nonCoherentAtomSize
           | [sizeof=504, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceMemoryProperties
         0 |   uint32_t memoryTypeCount
         4 |   VkMemoryType[32] memoryTypes
       260 |   uint32_t memoryHeapCount
       264 |   VkMemoryHeap[16] memoryHeaps
           | [sizeof=520, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceSparseProperties
         0 |   VkBool32 residencyStandard2DBlockShape
         4 |   VkBool32 residencyStandard2DMultisampleBlockShape
         8 |   VkBool32 residencyStandard3DBlockShape
        12 |   VkBool32 residencyAlignedMipSize
        16 |   VkBool32 residencyNonResidentStrict
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceProperties
         0 |   uint32_t apiVersion
         4 |   uint32_t driverVersion
         8 |   uint32_t vendorID
        12 |   uint32_t deviceID
        16 |   VkPhysicalDeviceType deviceType
        20 |   char[256] deviceName
       276 |   uint8_t[16] pipelineCacheUUID
       296 |   struct VkPhysicalDeviceLimits limits
       296 |     uint32_t maxImageDimension1D
       300 |     uint32_t maxImageDimension2D
       304 |     uint32_t maxImageDimension3D
       308 |     uint32_t maxImageDimensionCube
       312 |     uint32_t maxImageArrayLayers
       316 |     uint32_t maxTexelBufferElements
       320 |     uint32_t maxUniformBufferRange
       324 |     uint32_t maxStorageBufferRange
       328 |     uint32_t maxPushConstantsSize
       332 |     uint32_t maxMemoryAllocationCount
       336 |     uint32_t maxSamplerAllocationCount
       344 |     VkDeviceSize bufferImageGranularity
       352 |     VkDeviceSize sparseAddressSpaceSize
       360 |     uint32_t maxBoundDescriptorSets
       364 |     uint32_t maxPerStageDescriptorSamplers
       368 |     uint32_t maxPerStageDescriptorUniformBuffers
       372 |     uint32_t maxPerStageDescriptorStorageBuffers
       376 |     uint32_t maxPerStageDescriptorSampledImages
       380 |     uint32_t maxPerStageDescriptorStorageImages
       384 |     uint32_t maxPerStageDescriptorInputAttachments
       388 |     uint32_t maxPerStageResources
       392 |     uint32_t maxDescriptorSetSamplers
       396 |     uint32_t maxDescriptorSetUniformBuffers
       400 |     uint32_t maxDescriptorSetUniformBuffersDynamic
       404 |     uint32_t maxDescriptorSetStorageBuffers
       408 |     uint32_t maxDescriptorSetStorageBuffersDynamic
       412 |     uint32_t maxDescriptorSetSampledImages
       416 |     uint32_t maxDescriptorSetStorageImages
       420 |     uint32_t maxDescriptorSetInputAttachments
       424 |     uint32_t maxVertexInputAttributes
       428 |     uint32_t maxVertexInputBindings
       432 |     uint32_t maxVertexInputAttributeOffset
       436 |     uint32_t maxVertexInputBindingStride
       440 |     uint32_t maxVertexOutputComponents
       444 |     uint32_t maxTessellationGenerationLevel
       448 |     uint32_t maxTessellationPatchSize
       452 |     uint32_t maxTessellationControlPerVertexInputComponents
       456 |     uint32_t maxTessellationControlPerVertexOutputComponents
       460 |     uint32_t maxTessellationControlPerPatchOutputComponents
       464 |     uint32_t maxTessellationControlTotalOutputComponents
       468 |     uint32_t maxTessellationEvaluationInputComponents
       472 |     uint32_t maxTessellationEvaluationOutputComponents
       476 |     uint32_t maxGeometryShaderInvocations
       480 |     uint32_t maxGeometryInputComponents
       484 |     uint32_t maxGeometryOutputComponents
       488 |     uint32_t maxGeometryOutputVertices
       492 |     uint32_t maxGeometryTotalOutputComponents
       496 |     uint32_t maxFragmentInputComponents
       500 |     uint32_t maxFragmentOutputAttachments
       504 |     uint32_t maxFragmentDualSrcAttachments
       508 |     uint32_t maxFragmentCombinedOutputResources
       512 |     uint32_t maxComputeSharedMemorySize
       516 |     uint32_t[3] maxComputeWorkGroupCount
       528 |     uint32_t maxComputeWorkGroupInvocations
       532 |     uint32_t[3] maxComputeWorkGroupSize
       544 |     uint32_t subPixelPrecisionBits
       548 |     uint32_t subTexelPrecisionBits
       552 |     uint32_t mipmapPrecisionBits
       556 |     uint32_t maxDrawIndexedIndexValue
       560 |     uint32_t maxDrawIndirectCount
       564 |     float maxSamplerLodBias
       568 |     float maxSamplerAnisotropy
       572 |     uint32_t maxViewports
       576 |     uint32_t[2] maxViewportDimensions
       584 |     float[2] viewportBoundsRange
       592 |     uint32_t viewportSubPixelBits
       600 |     size_t minMemoryMapAlignment
       608 |     VkDeviceSize minTexelBufferOffsetAlignment
       616 |     VkDeviceSize minUniformBufferOffsetAlignment
       624 |     VkDeviceSize minStorageBufferOffsetAlignment
       632 |     int32_t minTexelOffset
       636 |     uint32_t maxTexelOffset
       640 |     int32_t minTexelGatherOffset
       644 |     uint32_t maxTexelGatherOffset
       648 |     float minInterpolationOffset
       652 |     float maxInterpolationOffset
       656 |     uint32_t subPixelInterpolationOffsetBits
       660 |     uint32_t maxFramebufferWidth
       664 |     uint32_t maxFramebufferHeight
       668 |     uint32_t maxFramebufferLayers
       672 |     VkSampleCountFlags framebufferColorSampleCounts
       676 |     VkSampleCountFlags framebufferDepthSampleCounts
       680 |     VkSampleCountFlags framebufferStencilSampleCounts
       684 |     VkSampleCountFlags framebufferNoAttachmentsSampleCounts
       688 |     uint32_t maxColorAttachments
       692 |     VkSampleCountFlags sampledImageColorSampleCounts
       696 |     VkSampleCountFlags sampledImageIntegerSampleCounts
       700 |     VkSampleCountFlags sampledImageDepthSampleCounts
       704 |     VkSampleCountFlags sampledImageStencilSampleCounts
       708 |     VkSampleCountFlags storageImageSampleCounts
       712 |     uint32_t maxSampleMaskWords
       716 |     VkBool32 timestampComputeAndGraphics
       720 |     float timestampPeriod
       724 |     uint32_t maxClipDistances
       728 |     uint32_t maxCullDistances
       732 |     uint32_t maxCombinedClipAndCullDistances
       736 |     uint32_t discreteQueuePriorities
       740 |     float[2] pointSizeRange
       748 |     float[2] lineWidthRange
       756 |     float pointSizeGranularity
       760 |     float lineWidthGranularity
       764 |     VkBool32 strictLines
       768 |     VkBool32 standardSampleLocations
       776 |     VkDeviceSize optimalBufferCopyOffsetAlignment
       784 |     VkDeviceSize optimalBufferCopyRowPitchAlignment
       792 |     VkDeviceSize nonCoherentAtomSize
       800 |   struct VkPhysicalDeviceSparseProperties sparseProperties
       800 |     VkBool32 residencyStandard2DBlockShape
       804 |     VkBool32 residencyStandard2DMultisampleBlockShape
       808 |     VkBool32 residencyStandard3DBlockShape
       812 |     VkBool32 residencyAlignedMipSize
       816 |     VkBool32 residencyNonResidentStrict
           | [sizeof=824, align=8]

*** Dumping AST Record Layout
         0 | struct VkQueueFamilyProperties
         0 |   VkQueueFlags queueFlags
         4 |   uint32_t queueCount
         8 |   uint32_t timestampValidBits
        12 |   struct VkExtent3D minImageTransferGranularity
        12 |     uint32_t width
        16 |     uint32_t height
        20 |     uint32_t depth
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | struct VkDeviceQueueCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDeviceQueueCreateFlags flags
        20 |   uint32_t queueFamilyIndex
        24 |   uint32_t queueCount
        32 |   const float * pQueuePriorities
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDeviceCreateFlags flags
        20 |   uint32_t queueCreateInfoCount
        24 |   const VkDeviceQueueCreateInfo * pQueueCreateInfos
        32 |   uint32_t enabledLayerCount
        40 |   const char *const * ppEnabledLayerNames
        48 |   uint32_t enabledExtensionCount
        56 |   const char *const * ppEnabledExtensionNames
        64 |   const VkPhysicalDeviceFeatures * pEnabledFeatures
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkExtensionProperties
         0 |   char[256] extensionName
       256 |   uint32_t specVersion
           | [sizeof=260, align=4]

*** Dumping AST Record Layout
         0 | struct VkLayerProperties
         0 |   char[256] layerName
       256 |   uint32_t specVersion
       260 |   uint32_t implementationVersion
       264 |   char[256] description
           | [sizeof=520, align=4]

*** Dumping AST Record Layout
         0 | struct VkSubmitInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t waitSemaphoreCount
        24 |   const VkSemaphore * pWaitSemaphores
        32 |   const VkPipelineStageFlags * pWaitDstStageMask
        40 |   uint32_t commandBufferCount
        48 |   const VkCommandBuffer * pCommandBuffers
        56 |   uint32_t signalSemaphoreCount
        64 |   const VkSemaphore * pSignalSemaphores
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkMappedMemoryRange
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDeviceMemory memory
        24 |   VkDeviceSize offset
        32 |   VkDeviceSize size
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryAllocateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDeviceSize allocationSize
        24 |   uint32_t memoryTypeIndex
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryRequirements
         0 |   VkDeviceSize size
         8 |   VkDeviceSize alignment
        16 |   uint32_t memoryTypeBits
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageSubresource
         0 |   VkImageAspectFlags aspectMask
         4 |   uint32_t mipLevel
         8 |   uint32_t arrayLayer
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkSparseImageFormatProperties
         0 |   VkImageAspectFlags aspectMask
         4 |   struct VkExtent3D imageGranularity
         4 |     uint32_t width
         8 |     uint32_t height
        12 |     uint32_t depth
        16 |   VkSparseImageFormatFlags flags
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | struct VkSparseImageMemoryBind
         0 |   struct VkImageSubresource subresource
         0 |     VkImageAspectFlags aspectMask
         4 |     uint32_t mipLevel
         8 |     uint32_t arrayLayer
        12 |   struct VkOffset3D offset
        12 |     int32_t x
        16 |     int32_t y
        20 |     int32_t z
        24 |   struct VkExtent3D extent
        24 |     uint32_t width
        28 |     uint32_t height
        32 |     uint32_t depth
        40 |   VkDeviceMemory memory
        48 |   VkDeviceSize memoryOffset
        56 |   VkSparseMemoryBindFlags flags
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkSparseImageMemoryBindInfo
         0 |   VkImage image
         8 |   uint32_t bindCount
        16 |   const VkSparseImageMemoryBind * pBinds
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSparseImageMemoryRequirements
         0 |   struct VkSparseImageFormatProperties formatProperties
         0 |     VkImageAspectFlags aspectMask
         4 |     struct VkExtent3D imageGranularity
         4 |       uint32_t width
         8 |       uint32_t height
        12 |       uint32_t depth
        16 |     VkSparseImageFormatFlags flags
        20 |   uint32_t imageMipTailFirstLod
        24 |   VkDeviceSize imageMipTailSize
        32 |   VkDeviceSize imageMipTailOffset
        40 |   VkDeviceSize imageMipTailStride
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkSparseMemoryBind
         0 |   VkDeviceSize resourceOffset
         8 |   VkDeviceSize size
        16 |   VkDeviceMemory memory
        24 |   VkDeviceSize memoryOffset
        32 |   VkSparseMemoryBindFlags flags
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkSparseBufferMemoryBindInfo
         0 |   VkBuffer buffer
         8 |   uint32_t bindCount
        16 |   const VkSparseMemoryBind * pBinds
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSparseImageOpaqueMemoryBindInfo
         0 |   VkImage image
         8 |   uint32_t bindCount
        16 |   const VkSparseMemoryBind * pBinds
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindSparseInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t waitSemaphoreCount
        24 |   const VkSemaphore * pWaitSemaphores
        32 |   uint32_t bufferBindCount
        40 |   const VkSparseBufferMemoryBindInfo * pBufferBinds
        48 |   uint32_t imageOpaqueBindCount
        56 |   const VkSparseImageOpaqueMemoryBindInfo * pImageOpaqueBinds
        64 |   uint32_t imageBindCount
        72 |   const VkSparseImageMemoryBindInfo * pImageBinds
        80 |   uint32_t signalSemaphoreCount
        88 |   const VkSemaphore * pSignalSemaphores
           | [sizeof=96, align=8]

*** Dumping AST Record Layout
         0 | struct VkFenceCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkFenceCreateFlags flags
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSemaphoreCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSemaphoreCreateFlags flags
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkQueryPoolCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkQueryPoolCreateFlags flags
        20 |   VkQueryType queryType
        24 |   uint32_t queryCount
        28 |   VkQueryPipelineStatisticFlags pipelineStatistics
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkBufferCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBufferCreateFlags flags
        24 |   VkDeviceSize size
        32 |   VkBufferUsageFlags usage
        36 |   VkSharingMode sharingMode
        40 |   uint32_t queueFamilyIndexCount
        48 |   const uint32_t * pQueueFamilyIndices
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImageCreateFlags flags
        20 |   VkImageType imageType
        24 |   VkFormat format
        28 |   struct VkExtent3D extent
        28 |     uint32_t width
        32 |     uint32_t height
        36 |     uint32_t depth
        40 |   uint32_t mipLevels
        44 |   uint32_t arrayLayers
        48 |   VkSampleCountFlagBits samples
        52 |   VkImageTiling tiling
        56 |   VkImageUsageFlags usage
        60 |   VkSharingMode sharingMode
        64 |   uint32_t queueFamilyIndexCount
        72 |   const uint32_t * pQueueFamilyIndices
        80 |   VkImageLayout initialLayout
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | struct VkSubresourceLayout
         0 |   VkDeviceSize offset
         8 |   VkDeviceSize size
        16 |   VkDeviceSize rowPitch
        24 |   VkDeviceSize arrayPitch
        32 |   VkDeviceSize depthPitch
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkComponentMapping
         0 |   VkComponentSwizzle r
         4 |   VkComponentSwizzle g
         8 |   VkComponentSwizzle b
        12 |   VkComponentSwizzle a
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct VkImageSubresourceRange
         0 |   VkImageAspectFlags aspectMask
         4 |   uint32_t baseMipLevel
         8 |   uint32_t levelCount
        12 |   uint32_t baseArrayLayer
        16 |   uint32_t layerCount
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | struct VkImageViewCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImageViewCreateFlags flags
        24 |   VkImage image
        32 |   VkImageViewType viewType
        36 |   VkFormat format
        40 |   struct VkComponentMapping components
        40 |     VkComponentSwizzle r
        44 |     VkComponentSwizzle g
        48 |     VkComponentSwizzle b
        52 |     VkComponentSwizzle a
        56 |   struct VkImageSubresourceRange subresourceRange
        56 |     VkImageAspectFlags aspectMask
        60 |     uint32_t baseMipLevel
        64 |     uint32_t levelCount
        68 |     uint32_t baseArrayLayer
        72 |     uint32_t layerCount
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | struct VkCommandPoolCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkCommandPoolCreateFlags flags
        20 |   uint32_t queueFamilyIndex
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkCommandBufferAllocateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkCommandPool commandPool
        24 |   VkCommandBufferLevel level
        28 |   uint32_t commandBufferCount
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkCommandBufferInheritanceInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkRenderPass renderPass
        24 |   uint32_t subpass
        32 |   VkFramebuffer framebuffer
        40 |   VkBool32 occlusionQueryEnable
        44 |   VkQueryControlFlags queryFlags
        48 |   VkQueryPipelineStatisticFlags pipelineStatistics
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkCommandBufferBeginInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkCommandBufferUsageFlags flags
        24 |   const VkCommandBufferInheritanceInfo * pInheritanceInfo
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkBufferCopy
         0 |   VkDeviceSize srcOffset
         8 |   VkDeviceSize dstOffset
        16 |   VkDeviceSize size
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageSubresourceLayers
         0 |   VkImageAspectFlags aspectMask
         4 |   uint32_t mipLevel
         8 |   uint32_t baseArrayLayer
        12 |   uint32_t layerCount
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct VkBufferImageCopy
         0 |   VkDeviceSize bufferOffset
         8 |   uint32_t bufferRowLength
        12 |   uint32_t bufferImageHeight
        16 |   struct VkImageSubresourceLayers imageSubresource
        16 |     VkImageAspectFlags aspectMask
        20 |     uint32_t mipLevel
        24 |     uint32_t baseArrayLayer
        28 |     uint32_t layerCount
        32 |   struct VkOffset3D imageOffset
        32 |     int32_t x
        36 |     int32_t y
        40 |     int32_t z
        44 |   struct VkExtent3D imageExtent
        44 |     uint32_t width
        48 |     uint32_t height
        52 |     uint32_t depth
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageCopy
         0 |   struct VkImageSubresourceLayers srcSubresource
         0 |     VkImageAspectFlags aspectMask
         4 |     uint32_t mipLevel
         8 |     uint32_t baseArrayLayer
        12 |     uint32_t layerCount
        16 |   struct VkOffset3D srcOffset
        16 |     int32_t x
        20 |     int32_t y
        24 |     int32_t z
        28 |   struct VkImageSubresourceLayers dstSubresource
        28 |     VkImageAspectFlags aspectMask
        32 |     uint32_t mipLevel
        36 |     uint32_t baseArrayLayer
        40 |     uint32_t layerCount
        44 |   struct VkOffset3D dstOffset
        44 |     int32_t x
        48 |     int32_t y
        52 |     int32_t z
        56 |   struct VkExtent3D extent
        56 |     uint32_t width
        60 |     uint32_t height
        64 |     uint32_t depth
           | [sizeof=68, align=4]

*** Dumping AST Record Layout
         0 | struct VkBufferMemoryBarrier
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkAccessFlags srcAccessMask
        20 |   VkAccessFlags dstAccessMask
        24 |   uint32_t srcQueueFamilyIndex
        28 |   uint32_t dstQueueFamilyIndex
        32 |   VkBuffer buffer
        40 |   VkDeviceSize offset
        48 |   VkDeviceSize size
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageMemoryBarrier
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkAccessFlags srcAccessMask
        20 |   VkAccessFlags dstAccessMask
        24 |   VkImageLayout oldLayout
        28 |   VkImageLayout newLayout
        32 |   uint32_t srcQueueFamilyIndex
        36 |   uint32_t dstQueueFamilyIndex
        40 |   VkImage image
        48 |   struct VkImageSubresourceRange subresourceRange
        48 |     VkImageAspectFlags aspectMask
        52 |     uint32_t baseMipLevel
        56 |     uint32_t levelCount
        60 |     uint32_t baseArrayLayer
        64 |     uint32_t layerCount
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryBarrier
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkAccessFlags srcAccessMask
        20 |   VkAccessFlags dstAccessMask
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDispatchIndirectCommand
         0 |   uint32_t x
         4 |   uint32_t y
         8 |   uint32_t z
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkPipelineCacheHeaderVersionOne
         0 |   uint32_t headerSize
         4 |   VkPipelineCacheHeaderVersion headerVersion
         8 |   uint32_t vendorID
        12 |   uint32_t deviceID
        16 |   uint8_t[16] pipelineCacheUUID
           | [sizeof=32, align=4]

*** Dumping AST Record Layout
         0 | struct VkEventCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkEventCreateFlags flags
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkBufferViewCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBufferViewCreateFlags flags
        24 |   VkBuffer buffer
        32 |   VkFormat format
        40 |   VkDeviceSize offset
        48 |   VkDeviceSize range
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkShaderModuleCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkShaderModuleCreateFlags flags
        24 |   size_t codeSize
        32 |   const uint32_t * pCode
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineCacheCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineCacheCreateFlags flags
        24 |   size_t initialDataSize
        32 |   const void * pInitialData
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkSpecializationMapEntry
         0 |   uint32_t constantID
         4 |   uint32_t offset
         8 |   size_t size
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct VkSpecializationInfo
         0 |   uint32_t mapEntryCount
         8 |   const VkSpecializationMapEntry * pMapEntries
        16 |   size_t dataSize
        24 |   const void * pData
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineShaderStageCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineShaderStageCreateFlags flags
        20 |   VkShaderStageFlagBits stage
        24 |   VkShaderModule module
        32 |   const char * pName
        40 |   const VkSpecializationInfo * pSpecializationInfo
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkComputePipelineCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineCreateFlags flags
        24 |   struct VkPipelineShaderStageCreateInfo stage
        24 |     VkStructureType sType
        32 |     const void * pNext
        40 |     VkPipelineShaderStageCreateFlags flags
        44 |     VkShaderStageFlagBits stage
        48 |     VkShaderModule module
        56 |     const char * pName
        64 |     const VkSpecializationInfo * pSpecializationInfo
        72 |   VkPipelineLayout layout
        80 |   VkPipeline basePipelineHandle
        88 |   int32_t basePipelineIndex
           | [sizeof=96, align=8]

*** Dumping AST Record Layout
         0 | struct VkPushConstantRange
         0 |   VkShaderStageFlags stageFlags
         4 |   uint32_t offset
         8 |   uint32_t size
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkPipelineLayoutCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineLayoutCreateFlags flags
        20 |   uint32_t setLayoutCount
        24 |   const VkDescriptorSetLayout * pSetLayouts
        32 |   uint32_t pushConstantRangeCount
        40 |   const VkPushConstantRange * pPushConstantRanges
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkSamplerCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSamplerCreateFlags flags
        20 |   VkFilter magFilter
        24 |   VkFilter minFilter
        28 |   VkSamplerMipmapMode mipmapMode
        32 |   VkSamplerAddressMode addressModeU
        36 |   VkSamplerAddressMode addressModeV
        40 |   VkSamplerAddressMode addressModeW
        44 |   float mipLodBias
        48 |   VkBool32 anisotropyEnable
        52 |   float maxAnisotropy
        56 |   VkBool32 compareEnable
        60 |   VkCompareOp compareOp
        64 |   float minLod
        68 |   float maxLod
        72 |   VkBorderColor borderColor
        76 |   VkBool32 unnormalizedCoordinates
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | struct VkCopyDescriptorSet
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDescriptorSet srcSet
        24 |   uint32_t srcBinding
        28 |   uint32_t srcArrayElement
        32 |   VkDescriptorSet dstSet
        40 |   uint32_t dstBinding
        44 |   uint32_t dstArrayElement
        48 |   uint32_t descriptorCount
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorBufferInfo
         0 |   VkBuffer buffer
         8 |   VkDeviceSize offset
        16 |   VkDeviceSize range
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorImageInfo
         0 |   VkSampler sampler
         8 |   VkImageView imageView
        16 |   VkImageLayout imageLayout
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorPoolSize
         0 |   VkDescriptorType type
         4 |   uint32_t descriptorCount
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct VkDescriptorPoolCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDescriptorPoolCreateFlags flags
        20 |   uint32_t maxSets
        24 |   uint32_t poolSizeCount
        32 |   const VkDescriptorPoolSize * pPoolSizes
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorSetAllocateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDescriptorPool descriptorPool
        24 |   uint32_t descriptorSetCount
        32 |   const VkDescriptorSetLayout * pSetLayouts
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorSetLayoutBinding
         0 |   uint32_t binding
         4 |   VkDescriptorType descriptorType
         8 |   uint32_t descriptorCount
        12 |   VkShaderStageFlags stageFlags
        16 |   const VkSampler * pImmutableSamplers
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorSetLayoutCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDescriptorSetLayoutCreateFlags flags
        20 |   uint32_t bindingCount
        24 |   const VkDescriptorSetLayoutBinding * pBindings
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkWriteDescriptorSet
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDescriptorSet dstSet
        24 |   uint32_t dstBinding
        28 |   uint32_t dstArrayElement
        32 |   uint32_t descriptorCount
        36 |   VkDescriptorType descriptorType
        40 |   const VkDescriptorImageInfo * pImageInfo
        48 |   const VkDescriptorBufferInfo * pBufferInfo
        56 |   const VkBufferView * pTexelBufferView
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | union VkClearColorValue
         0 |   float[4] float32
         0 |   int32_t[4] int32
         0 |   uint32_t[4] uint32
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct VkDrawIndexedIndirectCommand
         0 |   uint32_t indexCount
         4 |   uint32_t instanceCount
         8 |   uint32_t firstIndex
        12 |   int32_t vertexOffset
        16 |   uint32_t firstInstance
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | struct VkDrawIndirectCommand
         0 |   uint32_t vertexCount
         4 |   uint32_t instanceCount
         8 |   uint32_t firstVertex
        12 |   uint32_t firstInstance
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct VkStencilOpState
         0 |   VkStencilOp failOp
         4 |   VkStencilOp passOp
         8 |   VkStencilOp depthFailOp
        12 |   VkCompareOp compareOp
        16 |   uint32_t compareMask
        20 |   uint32_t writeMask
        24 |   uint32_t reference
           | [sizeof=28, align=4]

*** Dumping AST Record Layout
         0 | struct VkVertexInputAttributeDescription
         0 |   uint32_t location
         4 |   uint32_t binding
         8 |   VkFormat format
        12 |   uint32_t offset
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct VkVertexInputBindingDescription
         0 |   uint32_t binding
         4 |   uint32_t stride
         8 |   VkVertexInputRate inputRate
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkViewport
         0 |   float x
         4 |   float y
         8 |   float width
        12 |   float height
        16 |   float minDepth
        20 |   float maxDepth
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | struct VkPipelineColorBlendAttachmentState
         0 |   VkBool32 blendEnable
         4 |   VkBlendFactor srcColorBlendFactor
         8 |   VkBlendFactor dstColorBlendFactor
        12 |   VkBlendOp colorBlendOp
        16 |   VkBlendFactor srcAlphaBlendFactor
        20 |   VkBlendFactor dstAlphaBlendFactor
        24 |   VkBlendOp alphaBlendOp
        28 |   VkColorComponentFlags colorWriteMask
           | [sizeof=32, align=4]

*** Dumping AST Record Layout
         0 | struct VkPipelineColorBlendStateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineColorBlendStateCreateFlags flags
        20 |   VkBool32 logicOpEnable
        24 |   VkLogicOp logicOp
        28 |   uint32_t attachmentCount
        32 |   const VkPipelineColorBlendAttachmentState * pAttachments
        40 |   float[4] blendConstants
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineDepthStencilStateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineDepthStencilStateCreateFlags flags
        20 |   VkBool32 depthTestEnable
        24 |   VkBool32 depthWriteEnable
        28 |   VkCompareOp depthCompareOp
        32 |   VkBool32 depthBoundsTestEnable
        36 |   VkBool32 stencilTestEnable
        40 |   struct VkStencilOpState front
        40 |     VkStencilOp failOp
        44 |     VkStencilOp passOp
        48 |     VkStencilOp depthFailOp
        52 |     VkCompareOp compareOp
        56 |     uint32_t compareMask
        60 |     uint32_t writeMask
        64 |     uint32_t reference
        68 |   struct VkStencilOpState back
        68 |     VkStencilOp failOp
        72 |     VkStencilOp passOp
        76 |     VkStencilOp depthFailOp
        80 |     VkCompareOp compareOp
        84 |     uint32_t compareMask
        88 |     uint32_t writeMask
        92 |     uint32_t reference
        96 |   float minDepthBounds
       100 |   float maxDepthBounds
           | [sizeof=104, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineDynamicStateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineDynamicStateCreateFlags flags
        20 |   uint32_t dynamicStateCount
        24 |   const VkDynamicState * pDynamicStates
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineInputAssemblyStateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineInputAssemblyStateCreateFlags flags
        20 |   VkPrimitiveTopology topology
        24 |   VkBool32 primitiveRestartEnable
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineMultisampleStateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineMultisampleStateCreateFlags flags
        20 |   VkSampleCountFlagBits rasterizationSamples
        24 |   VkBool32 sampleShadingEnable
        28 |   float minSampleShading
        32 |   const VkSampleMask * pSampleMask
        40 |   VkBool32 alphaToCoverageEnable
        44 |   VkBool32 alphaToOneEnable
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineRasterizationStateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineRasterizationStateCreateFlags flags
        20 |   VkBool32 depthClampEnable
        24 |   VkBool32 rasterizerDiscardEnable
        28 |   VkPolygonMode polygonMode
        32 |   VkCullModeFlags cullMode
        36 |   VkFrontFace frontFace
        40 |   VkBool32 depthBiasEnable
        44 |   float depthBiasConstantFactor
        48 |   float depthBiasClamp
        52 |   float depthBiasSlopeFactor
        56 |   float lineWidth
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineTessellationStateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineTessellationStateCreateFlags flags
        20 |   uint32_t patchControlPoints
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineVertexInputStateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineVertexInputStateCreateFlags flags
        20 |   uint32_t vertexBindingDescriptionCount
        24 |   const VkVertexInputBindingDescription * pVertexBindingDescriptions
        32 |   uint32_t vertexAttributeDescriptionCount
        40 |   const VkVertexInputAttributeDescription * pVertexAttributeDescriptions
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineViewportStateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineViewportStateCreateFlags flags
        20 |   uint32_t viewportCount
        24 |   const VkViewport * pViewports
        32 |   uint32_t scissorCount
        40 |   const VkRect2D * pScissors
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkGraphicsPipelineCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineCreateFlags flags
        20 |   uint32_t stageCount
        24 |   const VkPipelineShaderStageCreateInfo * pStages
        32 |   const VkPipelineVertexInputStateCreateInfo * pVertexInputState
        40 |   const VkPipelineInputAssemblyStateCreateInfo * pInputAssemblyState
        48 |   const VkPipelineTessellationStateCreateInfo * pTessellationState
        56 |   const VkPipelineViewportStateCreateInfo * pViewportState
        64 |   const VkPipelineRasterizationStateCreateInfo * pRasterizationState
        72 |   const VkPipelineMultisampleStateCreateInfo * pMultisampleState
        80 |   const VkPipelineDepthStencilStateCreateInfo * pDepthStencilState
        88 |   const VkPipelineColorBlendStateCreateInfo * pColorBlendState
        96 |   const VkPipelineDynamicStateCreateInfo * pDynamicState
       104 |   VkPipelineLayout layout
       112 |   VkRenderPass renderPass
       120 |   uint32_t subpass
       128 |   VkPipeline basePipelineHandle
       136 |   int32_t basePipelineIndex
           | [sizeof=144, align=8]

*** Dumping AST Record Layout
         0 | struct VkAttachmentDescription
         0 |   VkAttachmentDescriptionFlags flags
         4 |   VkFormat format
         8 |   VkSampleCountFlagBits samples
        12 |   VkAttachmentLoadOp loadOp
        16 |   VkAttachmentStoreOp storeOp
        20 |   VkAttachmentLoadOp stencilLoadOp
        24 |   VkAttachmentStoreOp stencilStoreOp
        28 |   VkImageLayout initialLayout
        32 |   VkImageLayout finalLayout
           | [sizeof=36, align=4]

*** Dumping AST Record Layout
         0 | struct VkAttachmentReference
         0 |   uint32_t attachment
         4 |   VkImageLayout layout
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct VkFramebufferCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkFramebufferCreateFlags flags
        24 |   VkRenderPass renderPass
        32 |   uint32_t attachmentCount
        40 |   const VkImageView * pAttachments
        48 |   uint32_t width
        52 |   uint32_t height
        56 |   uint32_t layers
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkSubpassDependency
         0 |   uint32_t srcSubpass
         4 |   uint32_t dstSubpass
         8 |   VkPipelineStageFlags srcStageMask
        12 |   VkPipelineStageFlags dstStageMask
        16 |   VkAccessFlags srcAccessMask
        20 |   VkAccessFlags dstAccessMask
        24 |   VkDependencyFlags dependencyFlags
           | [sizeof=28, align=4]

*** Dumping AST Record Layout
         0 | struct VkSubpassDescription
         0 |   VkSubpassDescriptionFlags flags
         4 |   VkPipelineBindPoint pipelineBindPoint
         8 |   uint32_t inputAttachmentCount
        16 |   const VkAttachmentReference * pInputAttachments
        24 |   uint32_t colorAttachmentCount
        32 |   const VkAttachmentReference * pColorAttachments
        40 |   const VkAttachmentReference * pResolveAttachments
        48 |   const VkAttachmentReference * pDepthStencilAttachment
        56 |   uint32_t preserveAttachmentCount
        64 |   const uint32_t * pPreserveAttachments
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkRenderPassCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkRenderPassCreateFlags flags
        20 |   uint32_t attachmentCount
        24 |   const VkAttachmentDescription * pAttachments
        32 |   uint32_t subpassCount
        40 |   const VkSubpassDescription * pSubpasses
        48 |   uint32_t dependencyCount
        56 |   const VkSubpassDependency * pDependencies
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkClearDepthStencilValue
         0 |   float depth
         4 |   uint32_t stencil
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct VkClearRect
         0 |   struct VkRect2D rect
         0 |     struct VkOffset2D offset
         0 |       int32_t x
         4 |       int32_t y
         8 |     struct VkExtent2D extent
         8 |       uint32_t width
        12 |       uint32_t height
        16 |   uint32_t baseArrayLayer
        20 |   uint32_t layerCount
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | union VkClearValue
         0 |   union VkClearColorValue color
         0 |     float[4] float32
         0 |     int32_t[4] int32
         0 |     uint32_t[4] uint32
         0 |   struct VkClearDepthStencilValue depthStencil
         0 |     float depth
         4 |     uint32_t stencil
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct VkClearAttachment
         0 |   VkImageAspectFlags aspectMask
         4 |   uint32_t colorAttachment
         8 |   union VkClearValue clearValue
         8 |     union VkClearColorValue color
         8 |       float[4] float32
         8 |       int32_t[4] int32
         8 |       uint32_t[4] uint32
         8 |     struct VkClearDepthStencilValue depthStencil
         8 |       float depth
        12 |       uint32_t stencil
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | struct VkImageBlit
         0 |   struct VkImageSubresourceLayers srcSubresource
         0 |     VkImageAspectFlags aspectMask
         4 |     uint32_t mipLevel
         8 |     uint32_t baseArrayLayer
        12 |     uint32_t layerCount
        16 |   VkOffset3D[2] srcOffsets
        40 |   struct VkImageSubresourceLayers dstSubresource
        40 |     VkImageAspectFlags aspectMask
        44 |     uint32_t mipLevel
        48 |     uint32_t baseArrayLayer
        52 |     uint32_t layerCount
        56 |   VkOffset3D[2] dstOffsets
           | [sizeof=80, align=4]

*** Dumping AST Record Layout
         0 | struct VkImageResolve
         0 |   struct VkImageSubresourceLayers srcSubresource
         0 |     VkImageAspectFlags aspectMask
         4 |     uint32_t mipLevel
         8 |     uint32_t baseArrayLayer
        12 |     uint32_t layerCount
        16 |   struct VkOffset3D srcOffset
        16 |     int32_t x
        20 |     int32_t y
        24 |     int32_t z
        28 |   struct VkImageSubresourceLayers dstSubresource
        28 |     VkImageAspectFlags aspectMask
        32 |     uint32_t mipLevel
        36 |     uint32_t baseArrayLayer
        40 |     uint32_t layerCount
        44 |   struct VkOffset3D dstOffset
        44 |     int32_t x
        48 |     int32_t y
        52 |     int32_t z
        56 |   struct VkExtent3D extent
        56 |     uint32_t width
        60 |     uint32_t height
        64 |     uint32_t depth
           | [sizeof=68, align=4]

*** Dumping AST Record Layout
         0 | struct VkRenderPassBeginInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkRenderPass renderPass
        24 |   VkFramebuffer framebuffer
        32 |   struct VkRect2D renderArea
        32 |     struct VkOffset2D offset
        32 |       int32_t x
        36 |       int32_t y
        40 |     struct VkExtent2D extent
        40 |       uint32_t width
        44 |       uint32_t height
        48 |   uint32_t clearValueCount
        56 |   const VkClearValue * pClearValues
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindBufferMemoryInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBuffer buffer
        24 |   VkDeviceMemory memory
        32 |   VkDeviceSize memoryOffset
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindImageMemoryInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImage image
        24 |   VkDeviceMemory memory
        32 |   VkDeviceSize memoryOffset
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryDedicatedRequirements
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 prefersDedicatedAllocation
        20 |   VkBool32 requiresDedicatedAllocation
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryDedicatedAllocateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImage image
        24 |   VkBuffer buffer
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryAllocateFlagsInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkMemoryAllocateFlags flags
        20 |   uint32_t deviceMask
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceGroupCommandBufferBeginInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t deviceMask
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceGroupSubmitInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t waitSemaphoreCount
        24 |   const uint32_t * pWaitSemaphoreDeviceIndices
        32 |   uint32_t commandBufferCount
        40 |   const uint32_t * pCommandBufferDeviceMasks
        48 |   uint32_t signalSemaphoreCount
        56 |   const uint32_t * pSignalSemaphoreDeviceIndices
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceGroupBindSparseInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t resourceDeviceIndex
        20 |   uint32_t memoryDeviceIndex
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindBufferMemoryDeviceGroupInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t deviceIndexCount
        24 |   const uint32_t * pDeviceIndices
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindImageMemoryDeviceGroupInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t deviceIndexCount
        24 |   const uint32_t * pDeviceIndices
        32 |   uint32_t splitInstanceBindRegionCount
        40 |   const VkRect2D * pSplitInstanceBindRegions
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceGroupProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t physicalDeviceCount
        24 |   VkPhysicalDevice[32] physicalDevices
       280 |   VkBool32 subsetAllocation
           | [sizeof=288, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceGroupDeviceCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t physicalDeviceCount
        24 |   const VkPhysicalDevice * pPhysicalDevices
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkBufferMemoryRequirementsInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBuffer buffer
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageMemoryRequirementsInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImage image
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageSparseMemoryRequirementsInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImage image
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryRequirements2
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkMemoryRequirements memoryRequirements
        16 |     VkDeviceSize size
        24 |     VkDeviceSize alignment
        32 |     uint32_t memoryTypeBits
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkSparseImageMemoryRequirements2
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkSparseImageMemoryRequirements memoryRequirements
        16 |     struct VkSparseImageFormatProperties formatProperties
        16 |       VkImageAspectFlags aspectMask
        20 |       struct VkExtent3D imageGranularity
        20 |         uint32_t width
        24 |         uint32_t height
        28 |         uint32_t depth
        32 |       VkSparseImageFormatFlags flags
        36 |     uint32_t imageMipTailFirstLod
        40 |     VkDeviceSize imageMipTailSize
        48 |     VkDeviceSize imageMipTailOffset
        56 |     VkDeviceSize imageMipTailStride
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceFeatures2
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkPhysicalDeviceFeatures features
        16 |     VkBool32 robustBufferAccess
        20 |     VkBool32 fullDrawIndexUint32
        24 |     VkBool32 imageCubeArray
        28 |     VkBool32 independentBlend
        32 |     VkBool32 geometryShader
        36 |     VkBool32 tessellationShader
        40 |     VkBool32 sampleRateShading
        44 |     VkBool32 dualSrcBlend
        48 |     VkBool32 logicOp
        52 |     VkBool32 multiDrawIndirect
        56 |     VkBool32 drawIndirectFirstInstance
        60 |     VkBool32 depthClamp
        64 |     VkBool32 depthBiasClamp
        68 |     VkBool32 fillModeNonSolid
        72 |     VkBool32 depthBounds
        76 |     VkBool32 wideLines
        80 |     VkBool32 largePoints
        84 |     VkBool32 alphaToOne
        88 |     VkBool32 multiViewport
        92 |     VkBool32 samplerAnisotropy
        96 |     VkBool32 textureCompressionETC2
       100 |     VkBool32 textureCompressionASTC_LDR
       104 |     VkBool32 textureCompressionBC
       108 |     VkBool32 occlusionQueryPrecise
       112 |     VkBool32 pipelineStatisticsQuery
       116 |     VkBool32 vertexPipelineStoresAndAtomics
       120 |     VkBool32 fragmentStoresAndAtomics
       124 |     VkBool32 shaderTessellationAndGeometryPointSize
       128 |     VkBool32 shaderImageGatherExtended
       132 |     VkBool32 shaderStorageImageExtendedFormats
       136 |     VkBool32 shaderStorageImageMultisample
       140 |     VkBool32 shaderStorageImageReadWithoutFormat
       144 |     VkBool32 shaderStorageImageWriteWithoutFormat
       148 |     VkBool32 shaderUniformBufferArrayDynamicIndexing
       152 |     VkBool32 shaderSampledImageArrayDynamicIndexing
       156 |     VkBool32 shaderStorageBufferArrayDynamicIndexing
       160 |     VkBool32 shaderStorageImageArrayDynamicIndexing
       164 |     VkBool32 shaderClipDistance
       168 |     VkBool32 shaderCullDistance
       172 |     VkBool32 shaderFloat64
       176 |     VkBool32 shaderInt64
       180 |     VkBool32 shaderInt16
       184 |     VkBool32 shaderResourceResidency
       188 |     VkBool32 shaderResourceMinLod
       192 |     VkBool32 sparseBinding
       196 |     VkBool32 sparseResidencyBuffer
       200 |     VkBool32 sparseResidencyImage2D
       204 |     VkBool32 sparseResidencyImage3D
       208 |     VkBool32 sparseResidency2Samples
       212 |     VkBool32 sparseResidency4Samples
       216 |     VkBool32 sparseResidency8Samples
       220 |     VkBool32 sparseResidency16Samples
       224 |     VkBool32 sparseResidencyAliased
       228 |     VkBool32 variableMultisampleRate
       232 |     VkBool32 inheritedQueries
           | [sizeof=240, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceProperties2
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkPhysicalDeviceProperties properties
        16 |     uint32_t apiVersion
        20 |     uint32_t driverVersion
        24 |     uint32_t vendorID
        28 |     uint32_t deviceID
        32 |     VkPhysicalDeviceType deviceType
        36 |     char[256] deviceName
       292 |     uint8_t[16] pipelineCacheUUID
       312 |     struct VkPhysicalDeviceLimits limits
       312 |       uint32_t maxImageDimension1D
       316 |       uint32_t maxImageDimension2D
       320 |       uint32_t maxImageDimension3D
       324 |       uint32_t maxImageDimensionCube
       328 |       uint32_t maxImageArrayLayers
       332 |       uint32_t maxTexelBufferElements
       336 |       uint32_t maxUniformBufferRange
       340 |       uint32_t maxStorageBufferRange
       344 |       uint32_t maxPushConstantsSize
       348 |       uint32_t maxMemoryAllocationCount
       352 |       uint32_t maxSamplerAllocationCount
       360 |       VkDeviceSize bufferImageGranularity
       368 |       VkDeviceSize sparseAddressSpaceSize
       376 |       uint32_t maxBoundDescriptorSets
       380 |       uint32_t maxPerStageDescriptorSamplers
       384 |       uint32_t maxPerStageDescriptorUniformBuffers
       388 |       uint32_t maxPerStageDescriptorStorageBuffers
       392 |       uint32_t maxPerStageDescriptorSampledImages
       396 |       uint32_t maxPerStageDescriptorStorageImages
       400 |       uint32_t maxPerStageDescriptorInputAttachments
       404 |       uint32_t maxPerStageResources
       408 |       uint32_t maxDescriptorSetSamplers
       412 |       uint32_t maxDescriptorSetUniformBuffers
       416 |       uint32_t maxDescriptorSetUniformBuffersDynamic
       420 |       uint32_t maxDescriptorSetStorageBuffers
       424 |       uint32_t maxDescriptorSetStorageBuffersDynamic
       428 |       uint32_t maxDescriptorSetSampledImages
       432 |       uint32_t maxDescriptorSetStorageImages
       436 |       uint32_t maxDescriptorSetInputAttachments
       440 |       uint32_t maxVertexInputAttributes
       444 |       uint32_t maxVertexInputBindings
       448 |       uint32_t maxVertexInputAttributeOffset
       452 |       uint32_t maxVertexInputBindingStride
       456 |       uint32_t maxVertexOutputComponents
       460 |       uint32_t maxTessellationGenerationLevel
       464 |       uint32_t maxTessellationPatchSize
       468 |       uint32_t maxTessellationControlPerVertexInputComponents
       472 |       uint32_t maxTessellationControlPerVertexOutputComponents
       476 |       uint32_t maxTessellationControlPerPatchOutputComponents
       480 |       uint32_t maxTessellationControlTotalOutputComponents
       484 |       uint32_t maxTessellationEvaluationInputComponents
       488 |       uint32_t maxTessellationEvaluationOutputComponents
       492 |       uint32_t maxGeometryShaderInvocations
       496 |       uint32_t maxGeometryInputComponents
       500 |       uint32_t maxGeometryOutputComponents
       504 |       uint32_t maxGeometryOutputVertices
       508 |       uint32_t maxGeometryTotalOutputComponents
       512 |       uint32_t maxFragmentInputComponents
       516 |       uint32_t maxFragmentOutputAttachments
       520 |       uint32_t maxFragmentDualSrcAttachments
       524 |       uint32_t maxFragmentCombinedOutputResources
       528 |       uint32_t maxComputeSharedMemorySize
       532 |       uint32_t[3] maxComputeWorkGroupCount
       544 |       uint32_t maxComputeWorkGroupInvocations
       548 |       uint32_t[3] maxComputeWorkGroupSize
       560 |       uint32_t subPixelPrecisionBits
       564 |       uint32_t subTexelPrecisionBits
       568 |       uint32_t mipmapPrecisionBits
       572 |       uint32_t maxDrawIndexedIndexValue
       576 |       uint32_t maxDrawIndirectCount
       580 |       float maxSamplerLodBias
       584 |       float maxSamplerAnisotropy
       588 |       uint32_t maxViewports
       592 |       uint32_t[2] maxViewportDimensions
       600 |       float[2] viewportBoundsRange
       608 |       uint32_t viewportSubPixelBits
       616 |       size_t minMemoryMapAlignment
       624 |       VkDeviceSize minTexelBufferOffsetAlignment
       632 |       VkDeviceSize minUniformBufferOffsetAlignment
       640 |       VkDeviceSize minStorageBufferOffsetAlignment
       648 |       int32_t minTexelOffset
       652 |       uint32_t maxTexelOffset
       656 |       int32_t minTexelGatherOffset
       660 |       uint32_t maxTexelGatherOffset
       664 |       float minInterpolationOffset
       668 |       float maxInterpolationOffset
       672 |       uint32_t subPixelInterpolationOffsetBits
       676 |       uint32_t maxFramebufferWidth
       680 |       uint32_t maxFramebufferHeight
       684 |       uint32_t maxFramebufferLayers
       688 |       VkSampleCountFlags framebufferColorSampleCounts
       692 |       VkSampleCountFlags framebufferDepthSampleCounts
       696 |       VkSampleCountFlags framebufferStencilSampleCounts
       700 |       VkSampleCountFlags framebufferNoAttachmentsSampleCounts
       704 |       uint32_t maxColorAttachments
       708 |       VkSampleCountFlags sampledImageColorSampleCounts
       712 |       VkSampleCountFlags sampledImageIntegerSampleCounts
       716 |       VkSampleCountFlags sampledImageDepthSampleCounts
       720 |       VkSampleCountFlags sampledImageStencilSampleCounts
       724 |       VkSampleCountFlags storageImageSampleCounts
       728 |       uint32_t maxSampleMaskWords
       732 |       VkBool32 timestampComputeAndGraphics
       736 |       float timestampPeriod
       740 |       uint32_t maxClipDistances
       744 |       uint32_t maxCullDistances
       748 |       uint32_t maxCombinedClipAndCullDistances
       752 |       uint32_t discreteQueuePriorities
       756 |       float[2] pointSizeRange
       764 |       float[2] lineWidthRange
       772 |       float pointSizeGranularity
       776 |       float lineWidthGranularity
       780 |       VkBool32 strictLines
       784 |       VkBool32 standardSampleLocations
       792 |       VkDeviceSize optimalBufferCopyOffsetAlignment
       800 |       VkDeviceSize optimalBufferCopyRowPitchAlignment
       808 |       VkDeviceSize nonCoherentAtomSize
       816 |     struct VkPhysicalDeviceSparseProperties sparseProperties
       816 |       VkBool32 residencyStandard2DBlockShape
       820 |       VkBool32 residencyStandard2DMultisampleBlockShape
       824 |       VkBool32 residencyStandard3DBlockShape
       828 |       VkBool32 residencyAlignedMipSize
       832 |       VkBool32 residencyNonResidentStrict
           | [sizeof=840, align=8]

*** Dumping AST Record Layout
         0 | struct VkFormatProperties2
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkFormatProperties formatProperties
        16 |     VkFormatFeatureFlags linearTilingFeatures
        20 |     VkFormatFeatureFlags optimalTilingFeatures
        24 |     VkFormatFeatureFlags bufferFeatures
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageFormatProperties2
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkImageFormatProperties imageFormatProperties
        16 |     struct VkExtent3D maxExtent
        16 |       uint32_t width
        20 |       uint32_t height
        24 |       uint32_t depth
        28 |     uint32_t maxMipLevels
        32 |     uint32_t maxArrayLayers
        36 |     VkSampleCountFlags sampleCounts
        40 |     VkDeviceSize maxResourceSize
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceImageFormatInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkFormat format
        20 |   VkImageType type
        24 |   VkImageTiling tiling
        28 |   VkImageUsageFlags usage
        32 |   VkImageCreateFlags flags
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkQueueFamilyProperties2
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkQueueFamilyProperties queueFamilyProperties
        16 |     VkQueueFlags queueFlags
        20 |     uint32_t queueCount
        24 |     uint32_t timestampValidBits
        28 |     struct VkExtent3D minImageTransferGranularity
        28 |       uint32_t width
        32 |       uint32_t height
        36 |       uint32_t depth
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceMemoryProperties2
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkPhysicalDeviceMemoryProperties memoryProperties
        16 |     uint32_t memoryTypeCount
        20 |     VkMemoryType[32] memoryTypes
       276 |     uint32_t memoryHeapCount
       280 |     VkMemoryHeap[16] memoryHeaps
           | [sizeof=536, align=8]

*** Dumping AST Record Layout
         0 | struct VkSparseImageFormatProperties2
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkSparseImageFormatProperties properties
        16 |     VkImageAspectFlags aspectMask
        20 |     struct VkExtent3D imageGranularity
        20 |       uint32_t width
        24 |       uint32_t height
        28 |       uint32_t depth
        32 |     VkSparseImageFormatFlags flags
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceSparseImageFormatInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkFormat format
        20 |   VkImageType type
        24 |   VkSampleCountFlagBits samples
        28 |   VkImageUsageFlags usage
        32 |   VkImageTiling tiling
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageViewUsageCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImageUsageFlags usage
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceProtectedMemoryFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 protectedMemory
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceProtectedMemoryProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 protectedNoFault
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceQueueInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDeviceQueueCreateFlags flags
        20 |   uint32_t queueFamilyIndex
        24 |   uint32_t queueIndex
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkProtectedSubmitInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBool32 protectedSubmit
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindImagePlaneMemoryInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImageAspectFlagBits planeAspect
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkImagePlaneMemoryRequirementsInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImageAspectFlagBits planeAspect
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkExternalMemoryProperties
         0 |   VkExternalMemoryFeatureFlags externalMemoryFeatures
         4 |   VkExternalMemoryHandleTypeFlags exportFromImportedHandleTypes
         8 |   VkExternalMemoryHandleTypeFlags compatibleHandleTypes
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceExternalImageFormatInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkExternalMemoryHandleTypeFlagBits handleType
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkExternalImageFormatProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkExternalMemoryProperties externalMemoryProperties
        16 |     VkExternalMemoryFeatureFlags externalMemoryFeatures
        20 |     VkExternalMemoryHandleTypeFlags exportFromImportedHandleTypes
        24 |     VkExternalMemoryHandleTypeFlags compatibleHandleTypes
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceExternalBufferInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBufferCreateFlags flags
        20 |   VkBufferUsageFlags usage
        24 |   VkExternalMemoryHandleTypeFlagBits handleType
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkExternalBufferProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkExternalMemoryProperties externalMemoryProperties
        16 |     VkExternalMemoryFeatureFlags externalMemoryFeatures
        20 |     VkExternalMemoryHandleTypeFlags exportFromImportedHandleTypes
        24 |     VkExternalMemoryHandleTypeFlags compatibleHandleTypes
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceIDProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint8_t[16] deviceUUID
        32 |   uint8_t[16] driverUUID
        48 |   uint8_t[8] deviceLUID
        56 |   uint32_t deviceNodeMask
        60 |   VkBool32 deviceLUIDValid
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkExternalMemoryImageCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkExternalMemoryHandleTypeFlags handleTypes
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkExternalMemoryBufferCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkExternalMemoryHandleTypeFlags handleTypes
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkExportMemoryAllocateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkExternalMemoryHandleTypeFlags handleTypes
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceExternalFenceInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkExternalFenceHandleTypeFlagBits handleType
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkExternalFenceProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkExternalFenceHandleTypeFlags exportFromImportedHandleTypes
        20 |   VkExternalFenceHandleTypeFlags compatibleHandleTypes
        24 |   VkExternalFenceFeatureFlags externalFenceFeatures
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkExportFenceCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkExternalFenceHandleTypeFlags handleTypes
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkExportSemaphoreCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkExternalSemaphoreHandleTypeFlags handleTypes
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceExternalSemaphoreInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkExternalSemaphoreHandleTypeFlagBits handleType
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkExternalSemaphoreProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkExternalSemaphoreHandleTypeFlags exportFromImportedHandleTypes
        20 |   VkExternalSemaphoreHandleTypeFlags compatibleHandleTypes
        24 |   VkExternalSemaphoreFeatureFlags externalSemaphoreFeatures
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceSubgroupProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t subgroupSize
        20 |   VkShaderStageFlags supportedStages
        24 |   VkSubgroupFeatureFlags supportedOperations
        28 |   VkBool32 quadOperationsInAllStages
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevice16BitStorageFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 storageBuffer16BitAccess
        20 |   VkBool32 uniformAndStorageBuffer16BitAccess
        24 |   VkBool32 storagePushConstant16
        28 |   VkBool32 storageInputOutput16
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVariablePointersFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 variablePointersStorageBuffer
        20 |   VkBool32 variablePointers
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorUpdateTemplateEntry
         0 |   uint32_t dstBinding
         4 |   uint32_t dstArrayElement
         8 |   uint32_t descriptorCount
        12 |   VkDescriptorType descriptorType
        16 |   size_t offset
        24 |   size_t stride
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorUpdateTemplateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDescriptorUpdateTemplateCreateFlags flags
        20 |   uint32_t descriptorUpdateEntryCount
        24 |   const VkDescriptorUpdateTemplateEntry * pDescriptorUpdateEntries
        32 |   VkDescriptorUpdateTemplateType templateType
        40 |   VkDescriptorSetLayout descriptorSetLayout
        48 |   VkPipelineBindPoint pipelineBindPoint
        56 |   VkPipelineLayout pipelineLayout
        64 |   uint32_t set
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceMaintenance3Properties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t maxPerSetDescriptors
        24 |   VkDeviceSize maxMemoryAllocationSize
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorSetLayoutSupport
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 supported
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSamplerYcbcrConversionCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkFormat format
        20 |   VkSamplerYcbcrModelConversion ycbcrModel
        24 |   VkSamplerYcbcrRange ycbcrRange
        28 |   struct VkComponentMapping components
        28 |     VkComponentSwizzle r
        32 |     VkComponentSwizzle g
        36 |     VkComponentSwizzle b
        40 |     VkComponentSwizzle a
        44 |   VkChromaLocation xChromaOffset
        48 |   VkChromaLocation yChromaOffset
        52 |   VkFilter chromaFilter
        56 |   VkBool32 forceExplicitReconstruction
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkSamplerYcbcrConversionInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSamplerYcbcrConversion conversion
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceSamplerYcbcrConversionFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 samplerYcbcrConversion
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSamplerYcbcrConversionImageFormatProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t combinedImageSamplerDescriptorCount
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceGroupRenderPassBeginInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t deviceMask
        20 |   uint32_t deviceRenderAreaCount
        24 |   const VkRect2D * pDeviceRenderAreas
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePointClippingProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkPointClippingBehavior pointClippingBehavior
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkInputAttachmentAspectReference
         0 |   uint32_t subpass
         4 |   uint32_t inputAttachmentIndex
         8 |   VkImageAspectFlags aspectMask
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkRenderPassInputAttachmentAspectCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t aspectReferenceCount
        24 |   const VkInputAttachmentAspectReference * pAspectReferences
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineTessellationDomainOriginStateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkTessellationDomainOrigin domainOrigin
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkRenderPassMultiviewCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t subpassCount
        24 |   const uint32_t * pViewMasks
        32 |   uint32_t dependencyCount
        40 |   const int32_t * pViewOffsets
        48 |   uint32_t correlationMaskCount
        56 |   const uint32_t * pCorrelationMasks
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceMultiviewFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 multiview
        20 |   VkBool32 multiviewGeometryShader
        24 |   VkBool32 multiviewTessellationShader
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceMultiviewProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t maxMultiviewViewCount
        20 |   uint32_t maxMultiviewInstanceIndex
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderDrawParametersFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderDrawParameters
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkConformanceVersion
         0 |   uint8_t major
         1 |   uint8_t minor
         2 |   uint8_t subminor
         3 |   uint8_t patch
           | [sizeof=4, align=1]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceDriverProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkDriverId driverID
        20 |   char[256] driverName
       276 |   char[256] driverInfo
       532 |   struct VkConformanceVersion conformanceVersion
       532 |     uint8_t major
       533 |     uint8_t minor
       534 |     uint8_t subminor
       535 |     uint8_t patch
           | [sizeof=536, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVulkan11Features
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 storageBuffer16BitAccess
        20 |   VkBool32 uniformAndStorageBuffer16BitAccess
        24 |   VkBool32 storagePushConstant16
        28 |   VkBool32 storageInputOutput16
        32 |   VkBool32 multiview
        36 |   VkBool32 multiviewGeometryShader
        40 |   VkBool32 multiviewTessellationShader
        44 |   VkBool32 variablePointersStorageBuffer
        48 |   VkBool32 variablePointers
        52 |   VkBool32 protectedMemory
        56 |   VkBool32 samplerYcbcrConversion
        60 |   VkBool32 shaderDrawParameters
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVulkan11Properties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint8_t[16] deviceUUID
        32 |   uint8_t[16] driverUUID
        48 |   uint8_t[8] deviceLUID
        56 |   uint32_t deviceNodeMask
        60 |   VkBool32 deviceLUIDValid
        64 |   uint32_t subgroupSize
        68 |   VkShaderStageFlags subgroupSupportedStages
        72 |   VkSubgroupFeatureFlags subgroupSupportedOperations
        76 |   VkBool32 subgroupQuadOperationsInAllStages
        80 |   VkPointClippingBehavior pointClippingBehavior
        84 |   uint32_t maxMultiviewViewCount
        88 |   uint32_t maxMultiviewInstanceIndex
        92 |   VkBool32 protectedNoFault
        96 |   uint32_t maxPerSetDescriptors
       104 |   VkDeviceSize maxMemoryAllocationSize
           | [sizeof=112, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVulkan12Features
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 samplerMirrorClampToEdge
        20 |   VkBool32 drawIndirectCount
        24 |   VkBool32 storageBuffer8BitAccess
        28 |   VkBool32 uniformAndStorageBuffer8BitAccess
        32 |   VkBool32 storagePushConstant8
        36 |   VkBool32 shaderBufferInt64Atomics
        40 |   VkBool32 shaderSharedInt64Atomics
        44 |   VkBool32 shaderFloat16
        48 |   VkBool32 shaderInt8
        52 |   VkBool32 descriptorIndexing
        56 |   VkBool32 shaderInputAttachmentArrayDynamicIndexing
        60 |   VkBool32 shaderUniformTexelBufferArrayDynamicIndexing
        64 |   VkBool32 shaderStorageTexelBufferArrayDynamicIndexing
        68 |   VkBool32 shaderUniformBufferArrayNonUniformIndexing
        72 |   VkBool32 shaderSampledImageArrayNonUniformIndexing
        76 |   VkBool32 shaderStorageBufferArrayNonUniformIndexing
        80 |   VkBool32 shaderStorageImageArrayNonUniformIndexing
        84 |   VkBool32 shaderInputAttachmentArrayNonUniformIndexing
        88 |   VkBool32 shaderUniformTexelBufferArrayNonUniformIndexing
        92 |   VkBool32 shaderStorageTexelBufferArrayNonUniformIndexing
        96 |   VkBool32 descriptorBindingUniformBufferUpdateAfterBind
       100 |   VkBool32 descriptorBindingSampledImageUpdateAfterBind
       104 |   VkBool32 descriptorBindingStorageImageUpdateAfterBind
       108 |   VkBool32 descriptorBindingStorageBufferUpdateAfterBind
       112 |   VkBool32 descriptorBindingUniformTexelBufferUpdateAfterBind
       116 |   VkBool32 descriptorBindingStorageTexelBufferUpdateAfterBind
       120 |   VkBool32 descriptorBindingUpdateUnusedWhilePending
       124 |   VkBool32 descriptorBindingPartiallyBound
       128 |   VkBool32 descriptorBindingVariableDescriptorCount
       132 |   VkBool32 runtimeDescriptorArray
       136 |   VkBool32 samplerFilterMinmax
       140 |   VkBool32 scalarBlockLayout
       144 |   VkBool32 imagelessFramebuffer
       148 |   VkBool32 uniformBufferStandardLayout
       152 |   VkBool32 shaderSubgroupExtendedTypes
       156 |   VkBool32 separateDepthStencilLayouts
       160 |   VkBool32 hostQueryReset
       164 |   VkBool32 timelineSemaphore
       168 |   VkBool32 bufferDeviceAddress
       172 |   VkBool32 bufferDeviceAddressCaptureReplay
       176 |   VkBool32 bufferDeviceAddressMultiDevice
       180 |   VkBool32 vulkanMemoryModel
       184 |   VkBool32 vulkanMemoryModelDeviceScope
       188 |   VkBool32 vulkanMemoryModelAvailabilityVisibilityChains
       192 |   VkBool32 shaderOutputViewportIndex
       196 |   VkBool32 shaderOutputLayer
       200 |   VkBool32 subgroupBroadcastDynamicId
           | [sizeof=208, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVulkan12Properties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkDriverId driverID
        20 |   char[256] driverName
       276 |   char[256] driverInfo
       532 |   struct VkConformanceVersion conformanceVersion
       532 |     uint8_t major
       533 |     uint8_t minor
       534 |     uint8_t subminor
       535 |     uint8_t patch
       536 |   VkShaderFloatControlsIndependence denormBehaviorIndependence
       540 |   VkShaderFloatControlsIndependence roundingModeIndependence
       544 |   VkBool32 shaderSignedZeroInfNanPreserveFloat16
       548 |   VkBool32 shaderSignedZeroInfNanPreserveFloat32
       552 |   VkBool32 shaderSignedZeroInfNanPreserveFloat64
       556 |   VkBool32 shaderDenormPreserveFloat16
       560 |   VkBool32 shaderDenormPreserveFloat32
       564 |   VkBool32 shaderDenormPreserveFloat64
       568 |   VkBool32 shaderDenormFlushToZeroFloat16
       572 |   VkBool32 shaderDenormFlushToZeroFloat32
       576 |   VkBool32 shaderDenormFlushToZeroFloat64
       580 |   VkBool32 shaderRoundingModeRTEFloat16
       584 |   VkBool32 shaderRoundingModeRTEFloat32
       588 |   VkBool32 shaderRoundingModeRTEFloat64
       592 |   VkBool32 shaderRoundingModeRTZFloat16
       596 |   VkBool32 shaderRoundingModeRTZFloat32
       600 |   VkBool32 shaderRoundingModeRTZFloat64
       604 |   uint32_t maxUpdateAfterBindDescriptorsInAllPools
       608 |   VkBool32 shaderUniformBufferArrayNonUniformIndexingNative
       612 |   VkBool32 shaderSampledImageArrayNonUniformIndexingNative
       616 |   VkBool32 shaderStorageBufferArrayNonUniformIndexingNative
       620 |   VkBool32 shaderStorageImageArrayNonUniformIndexingNative
       624 |   VkBool32 shaderInputAttachmentArrayNonUniformIndexingNative
       628 |   VkBool32 robustBufferAccessUpdateAfterBind
       632 |   VkBool32 quadDivergentImplicitLod
       636 |   uint32_t maxPerStageDescriptorUpdateAfterBindSamplers
       640 |   uint32_t maxPerStageDescriptorUpdateAfterBindUniformBuffers
       644 |   uint32_t maxPerStageDescriptorUpdateAfterBindStorageBuffers
       648 |   uint32_t maxPerStageDescriptorUpdateAfterBindSampledImages
       652 |   uint32_t maxPerStageDescriptorUpdateAfterBindStorageImages
       656 |   uint32_t maxPerStageDescriptorUpdateAfterBindInputAttachments
       660 |   uint32_t maxPerStageUpdateAfterBindResources
       664 |   uint32_t maxDescriptorSetUpdateAfterBindSamplers
       668 |   uint32_t maxDescriptorSetUpdateAfterBindUniformBuffers
       672 |   uint32_t maxDescriptorSetUpdateAfterBindUniformBuffersDynamic
       676 |   uint32_t maxDescriptorSetUpdateAfterBindStorageBuffers
       680 |   uint32_t maxDescriptorSetUpdateAfterBindStorageBuffersDynamic
       684 |   uint32_t maxDescriptorSetUpdateAfterBindSampledImages
       688 |   uint32_t maxDescriptorSetUpdateAfterBindStorageImages
       692 |   uint32_t maxDescriptorSetUpdateAfterBindInputAttachments
       696 |   VkResolveModeFlags supportedDepthResolveModes
       700 |   VkResolveModeFlags supportedStencilResolveModes
       704 |   VkBool32 independentResolveNone
       708 |   VkBool32 independentResolve
       712 |   VkBool32 filterMinmaxSingleComponentFormats
       716 |   VkBool32 filterMinmaxImageComponentMapping
       720 |   uint64_t maxTimelineSemaphoreValueDifference
       728 |   VkSampleCountFlags framebufferIntegerColorSampleCounts
           | [sizeof=736, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageFormatListCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t viewFormatCount
        24 |   const VkFormat * pViewFormats
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVulkanMemoryModelFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 vulkanMemoryModel
        20 |   VkBool32 vulkanMemoryModelDeviceScope
        24 |   VkBool32 vulkanMemoryModelAvailabilityVisibilityChains
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceHostQueryResetFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 hostQueryReset
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceTimelineSemaphoreFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 timelineSemaphore
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceTimelineSemaphoreProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint64_t maxTimelineSemaphoreValueDifference
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSemaphoreTypeCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSemaphoreType semaphoreType
        24 |   uint64_t initialValue
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkTimelineSemaphoreSubmitInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t waitSemaphoreValueCount
        24 |   const uint64_t * pWaitSemaphoreValues
        32 |   uint32_t signalSemaphoreValueCount
        40 |   const uint64_t * pSignalSemaphoreValues
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkSemaphoreWaitInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSemaphoreWaitFlags flags
        20 |   uint32_t semaphoreCount
        24 |   const VkSemaphore * pSemaphores
        32 |   const uint64_t * pValues
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkSemaphoreSignalInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSemaphore semaphore
        24 |   uint64_t value
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceBufferDeviceAddressFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 bufferDeviceAddress
        20 |   VkBool32 bufferDeviceAddressCaptureReplay
        24 |   VkBool32 bufferDeviceAddressMultiDevice
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkBufferDeviceAddressInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBuffer buffer
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkBufferOpaqueCaptureAddressCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint64_t opaqueCaptureAddress
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryOpaqueCaptureAddressAllocateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint64_t opaqueCaptureAddress
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceMemoryOpaqueCaptureAddressInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDeviceMemory memory
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevice8BitStorageFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 storageBuffer8BitAccess
        20 |   VkBool32 uniformAndStorageBuffer8BitAccess
        24 |   VkBool32 storagePushConstant8
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderAtomicInt64Features
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderBufferInt64Atomics
        20 |   VkBool32 shaderSharedInt64Atomics
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderFloat16Int8Features
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderFloat16
        20 |   VkBool32 shaderInt8
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceFloatControlsProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkShaderFloatControlsIndependence denormBehaviorIndependence
        20 |   VkShaderFloatControlsIndependence roundingModeIndependence
        24 |   VkBool32 shaderSignedZeroInfNanPreserveFloat16
        28 |   VkBool32 shaderSignedZeroInfNanPreserveFloat32
        32 |   VkBool32 shaderSignedZeroInfNanPreserveFloat64
        36 |   VkBool32 shaderDenormPreserveFloat16
        40 |   VkBool32 shaderDenormPreserveFloat32
        44 |   VkBool32 shaderDenormPreserveFloat64
        48 |   VkBool32 shaderDenormFlushToZeroFloat16
        52 |   VkBool32 shaderDenormFlushToZeroFloat32
        56 |   VkBool32 shaderDenormFlushToZeroFloat64
        60 |   VkBool32 shaderRoundingModeRTEFloat16
        64 |   VkBool32 shaderRoundingModeRTEFloat32
        68 |   VkBool32 shaderRoundingModeRTEFloat64
        72 |   VkBool32 shaderRoundingModeRTZFloat16
        76 |   VkBool32 shaderRoundingModeRTZFloat32
        80 |   VkBool32 shaderRoundingModeRTZFloat64
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorSetLayoutBindingFlagsCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t bindingCount
        24 |   const VkDescriptorBindingFlags * pBindingFlags
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceDescriptorIndexingFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderInputAttachmentArrayDynamicIndexing
        20 |   VkBool32 shaderUniformTexelBufferArrayDynamicIndexing
        24 |   VkBool32 shaderStorageTexelBufferArrayDynamicIndexing
        28 |   VkBool32 shaderUniformBufferArrayNonUniformIndexing
        32 |   VkBool32 shaderSampledImageArrayNonUniformIndexing
        36 |   VkBool32 shaderStorageBufferArrayNonUniformIndexing
        40 |   VkBool32 shaderStorageImageArrayNonUniformIndexing
        44 |   VkBool32 shaderInputAttachmentArrayNonUniformIndexing
        48 |   VkBool32 shaderUniformTexelBufferArrayNonUniformIndexing
        52 |   VkBool32 shaderStorageTexelBufferArrayNonUniformIndexing
        56 |   VkBool32 descriptorBindingUniformBufferUpdateAfterBind
        60 |   VkBool32 descriptorBindingSampledImageUpdateAfterBind
        64 |   VkBool32 descriptorBindingStorageImageUpdateAfterBind
        68 |   VkBool32 descriptorBindingStorageBufferUpdateAfterBind
        72 |   VkBool32 descriptorBindingUniformTexelBufferUpdateAfterBind
        76 |   VkBool32 descriptorBindingStorageTexelBufferUpdateAfterBind
        80 |   VkBool32 descriptorBindingUpdateUnusedWhilePending
        84 |   VkBool32 descriptorBindingPartiallyBound
        88 |   VkBool32 descriptorBindingVariableDescriptorCount
        92 |   VkBool32 runtimeDescriptorArray
           | [sizeof=96, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceDescriptorIndexingProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t maxUpdateAfterBindDescriptorsInAllPools
        20 |   VkBool32 shaderUniformBufferArrayNonUniformIndexingNative
        24 |   VkBool32 shaderSampledImageArrayNonUniformIndexingNative
        28 |   VkBool32 shaderStorageBufferArrayNonUniformIndexingNative
        32 |   VkBool32 shaderStorageImageArrayNonUniformIndexingNative
        36 |   VkBool32 shaderInputAttachmentArrayNonUniformIndexingNative
        40 |   VkBool32 robustBufferAccessUpdateAfterBind
        44 |   VkBool32 quadDivergentImplicitLod
        48 |   uint32_t maxPerStageDescriptorUpdateAfterBindSamplers
        52 |   uint32_t maxPerStageDescriptorUpdateAfterBindUniformBuffers
        56 |   uint32_t maxPerStageDescriptorUpdateAfterBindStorageBuffers
        60 |   uint32_t maxPerStageDescriptorUpdateAfterBindSampledImages
        64 |   uint32_t maxPerStageDescriptorUpdateAfterBindStorageImages
        68 |   uint32_t maxPerStageDescriptorUpdateAfterBindInputAttachments
        72 |   uint32_t maxPerStageUpdateAfterBindResources
        76 |   uint32_t maxDescriptorSetUpdateAfterBindSamplers
        80 |   uint32_t maxDescriptorSetUpdateAfterBindUniformBuffers
        84 |   uint32_t maxDescriptorSetUpdateAfterBindUniformBuffersDynamic
        88 |   uint32_t maxDescriptorSetUpdateAfterBindStorageBuffers
        92 |   uint32_t maxDescriptorSetUpdateAfterBindStorageBuffersDynamic
        96 |   uint32_t maxDescriptorSetUpdateAfterBindSampledImages
       100 |   uint32_t maxDescriptorSetUpdateAfterBindStorageImages
       104 |   uint32_t maxDescriptorSetUpdateAfterBindInputAttachments
           | [sizeof=112, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorSetVariableDescriptorCountAllocateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t descriptorSetCount
        24 |   const uint32_t * pDescriptorCounts
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorSetVariableDescriptorCountLayoutSupport
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t maxVariableDescriptorCount
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceScalarBlockLayoutFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 scalarBlockLayout
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSamplerReductionModeCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSamplerReductionMode reductionMode
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceSamplerFilterMinmaxProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 filterMinmaxSingleComponentFormats
        20 |   VkBool32 filterMinmaxImageComponentMapping
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceUniformBufferStandardLayoutFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 uniformBufferStandardLayout
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderSubgroupExtendedTypesFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderSubgroupExtendedTypes
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkAttachmentDescription2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkAttachmentDescriptionFlags flags
        20 |   VkFormat format
        24 |   VkSampleCountFlagBits samples
        28 |   VkAttachmentLoadOp loadOp
        32 |   VkAttachmentStoreOp storeOp
        36 |   VkAttachmentLoadOp stencilLoadOp
        40 |   VkAttachmentStoreOp stencilStoreOp
        44 |   VkImageLayout initialLayout
        48 |   VkImageLayout finalLayout
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkAttachmentReference2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t attachment
        20 |   VkImageLayout layout
        24 |   VkImageAspectFlags aspectMask
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkSubpassDescription2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSubpassDescriptionFlags flags
        20 |   VkPipelineBindPoint pipelineBindPoint
        24 |   uint32_t viewMask
        28 |   uint32_t inputAttachmentCount
        32 |   const VkAttachmentReference2 * pInputAttachments
        40 |   uint32_t colorAttachmentCount
        48 |   const VkAttachmentReference2 * pColorAttachments
        56 |   const VkAttachmentReference2 * pResolveAttachments
        64 |   const VkAttachmentReference2 * pDepthStencilAttachment
        72 |   uint32_t preserveAttachmentCount
        80 |   const uint32_t * pPreserveAttachments
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | struct VkSubpassDependency2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t srcSubpass
        20 |   uint32_t dstSubpass
        24 |   VkPipelineStageFlags srcStageMask
        28 |   VkPipelineStageFlags dstStageMask
        32 |   VkAccessFlags srcAccessMask
        36 |   VkAccessFlags dstAccessMask
        40 |   VkDependencyFlags dependencyFlags
        44 |   int32_t viewOffset
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkSubpassBeginInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSubpassContents contents
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSubpassEndInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct VkRenderPassCreateInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkRenderPassCreateFlags flags
        20 |   uint32_t attachmentCount
        24 |   const VkAttachmentDescription2 * pAttachments
        32 |   uint32_t subpassCount
        40 |   const VkSubpassDescription2 * pSubpasses
        48 |   uint32_t dependencyCount
        56 |   const VkSubpassDependency2 * pDependencies
        64 |   uint32_t correlatedViewMaskCount
        72 |   const uint32_t * pCorrelatedViewMasks
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | struct VkSubpassDescriptionDepthStencilResolve
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkResolveModeFlagBits depthResolveMode
        20 |   VkResolveModeFlagBits stencilResolveMode
        24 |   const VkAttachmentReference2 * pDepthStencilResolveAttachment
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceDepthStencilResolveProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkResolveModeFlags supportedDepthResolveModes
        20 |   VkResolveModeFlags supportedStencilResolveModes
        24 |   VkBool32 independentResolveNone
        28 |   VkBool32 independentResolve
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageStencilUsageCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImageUsageFlags stencilUsage
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceImagelessFramebufferFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 imagelessFramebuffer
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkFramebufferAttachmentImageInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImageCreateFlags flags
        20 |   VkImageUsageFlags usage
        24 |   uint32_t width
        28 |   uint32_t height
        32 |   uint32_t layerCount
        36 |   uint32_t viewFormatCount
        40 |   const VkFormat * pViewFormats
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkRenderPassAttachmentBeginInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t attachmentCount
        24 |   const VkImageView * pAttachments
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkFramebufferAttachmentsCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t attachmentImageInfoCount
        24 |   const VkFramebufferAttachmentImageInfo * pAttachmentImageInfos
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceSeparateDepthStencilLayoutsFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 separateDepthStencilLayouts
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkAttachmentReferenceStencilLayout
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkImageLayout stencilLayout
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkAttachmentDescriptionStencilLayout
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkImageLayout stencilInitialLayout
        20 |   VkImageLayout stencilFinalLayout
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVulkan13Features
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 robustImageAccess
        20 |   VkBool32 inlineUniformBlock
        24 |   VkBool32 descriptorBindingInlineUniformBlockUpdateAfterBind
        28 |   VkBool32 pipelineCreationCacheControl
        32 |   VkBool32 privateData
        36 |   VkBool32 shaderDemoteToHelperInvocation
        40 |   VkBool32 shaderTerminateInvocation
        44 |   VkBool32 subgroupSizeControl
        48 |   VkBool32 computeFullSubgroups
        52 |   VkBool32 synchronization2
        56 |   VkBool32 textureCompressionASTC_HDR
        60 |   VkBool32 shaderZeroInitializeWorkgroupMemory
        64 |   VkBool32 dynamicRendering
        68 |   VkBool32 shaderIntegerDotProduct
        72 |   VkBool32 maintenance4
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVulkan13Properties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t minSubgroupSize
        20 |   uint32_t maxSubgroupSize
        24 |   uint32_t maxComputeWorkgroupSubgroups
        28 |   VkShaderStageFlags requiredSubgroupSizeStages
        32 |   uint32_t maxInlineUniformBlockSize
        36 |   uint32_t maxPerStageDescriptorInlineUniformBlocks
        40 |   uint32_t maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks
        44 |   uint32_t maxDescriptorSetInlineUniformBlocks
        48 |   uint32_t maxDescriptorSetUpdateAfterBindInlineUniformBlocks
        52 |   uint32_t maxInlineUniformTotalSize
        56 |   VkBool32 integerDotProduct8BitUnsignedAccelerated
        60 |   VkBool32 integerDotProduct8BitSignedAccelerated
        64 |   VkBool32 integerDotProduct8BitMixedSignednessAccelerated
        68 |   VkBool32 integerDotProduct4x8BitPackedUnsignedAccelerated
        72 |   VkBool32 integerDotProduct4x8BitPackedSignedAccelerated
        76 |   VkBool32 integerDotProduct4x8BitPackedMixedSignednessAccelerated
        80 |   VkBool32 integerDotProduct16BitUnsignedAccelerated
        84 |   VkBool32 integerDotProduct16BitSignedAccelerated
        88 |   VkBool32 integerDotProduct16BitMixedSignednessAccelerated
        92 |   VkBool32 integerDotProduct32BitUnsignedAccelerated
        96 |   VkBool32 integerDotProduct32BitSignedAccelerated
       100 |   VkBool32 integerDotProduct32BitMixedSignednessAccelerated
       104 |   VkBool32 integerDotProduct64BitUnsignedAccelerated
       108 |   VkBool32 integerDotProduct64BitSignedAccelerated
       112 |   VkBool32 integerDotProduct64BitMixedSignednessAccelerated
       116 |   VkBool32 integerDotProductAccumulatingSaturating8BitUnsignedAccelerated
       120 |   VkBool32 integerDotProductAccumulatingSaturating8BitSignedAccelerated
       124 |   VkBool32 integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated
       128 |   VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated
       132 |   VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated
       136 |   VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated
       140 |   VkBool32 integerDotProductAccumulatingSaturating16BitUnsignedAccelerated
       144 |   VkBool32 integerDotProductAccumulatingSaturating16BitSignedAccelerated
       148 |   VkBool32 integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated
       152 |   VkBool32 integerDotProductAccumulatingSaturating32BitUnsignedAccelerated
       156 |   VkBool32 integerDotProductAccumulatingSaturating32BitSignedAccelerated
       160 |   VkBool32 integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated
       164 |   VkBool32 integerDotProductAccumulatingSaturating64BitUnsignedAccelerated
       168 |   VkBool32 integerDotProductAccumulatingSaturating64BitSignedAccelerated
       172 |   VkBool32 integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated
       176 |   VkDeviceSize storageTexelBufferOffsetAlignmentBytes
       184 |   VkBool32 storageTexelBufferOffsetSingleTexelAlignment
       192 |   VkDeviceSize uniformTexelBufferOffsetAlignmentBytes
       200 |   VkBool32 uniformTexelBufferOffsetSingleTexelAlignment
       208 |   VkDeviceSize maxBufferSize
           | [sizeof=216, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceToolProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   char[256] name
       272 |   char[256] version
       528 |   VkToolPurposeFlags purposes
       532 |   char[256] description
       788 |   char[256] layer
           | [sizeof=1048, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePrivateDataFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 privateData
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDevicePrivateDataCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t privateDataSlotRequestCount
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPrivateDataSlotCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPrivateDataSlotCreateFlags flags
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryBarrier2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineStageFlags2 srcStageMask
        24 |   VkAccessFlags2 srcAccessMask
        32 |   VkPipelineStageFlags2 dstStageMask
        40 |   VkAccessFlags2 dstAccessMask
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkBufferMemoryBarrier2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineStageFlags2 srcStageMask
        24 |   VkAccessFlags2 srcAccessMask
        32 |   VkPipelineStageFlags2 dstStageMask
        40 |   VkAccessFlags2 dstAccessMask
        48 |   uint32_t srcQueueFamilyIndex
        52 |   uint32_t dstQueueFamilyIndex
        56 |   VkBuffer buffer
        64 |   VkDeviceSize offset
        72 |   VkDeviceSize size
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageMemoryBarrier2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineStageFlags2 srcStageMask
        24 |   VkAccessFlags2 srcAccessMask
        32 |   VkPipelineStageFlags2 dstStageMask
        40 |   VkAccessFlags2 dstAccessMask
        48 |   VkImageLayout oldLayout
        52 |   VkImageLayout newLayout
        56 |   uint32_t srcQueueFamilyIndex
        60 |   uint32_t dstQueueFamilyIndex
        64 |   VkImage image
        72 |   struct VkImageSubresourceRange subresourceRange
        72 |     VkImageAspectFlags aspectMask
        76 |     uint32_t baseMipLevel
        80 |     uint32_t levelCount
        84 |     uint32_t baseArrayLayer
        88 |     uint32_t layerCount
           | [sizeof=96, align=8]

*** Dumping AST Record Layout
         0 | struct VkDependencyInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDependencyFlags dependencyFlags
        20 |   uint32_t memoryBarrierCount
        24 |   const VkMemoryBarrier2 * pMemoryBarriers
        32 |   uint32_t bufferMemoryBarrierCount
        40 |   const VkBufferMemoryBarrier2 * pBufferMemoryBarriers
        48 |   uint32_t imageMemoryBarrierCount
        56 |   const VkImageMemoryBarrier2 * pImageMemoryBarriers
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkSemaphoreSubmitInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSemaphore semaphore
        24 |   uint64_t value
        32 |   VkPipelineStageFlags2 stageMask
        40 |   uint32_t deviceIndex
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkCommandBufferSubmitInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkCommandBuffer commandBuffer
        24 |   uint32_t deviceMask
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkSubmitInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSubmitFlags flags
        20 |   uint32_t waitSemaphoreInfoCount
        24 |   const VkSemaphoreSubmitInfo * pWaitSemaphoreInfos
        32 |   uint32_t commandBufferInfoCount
        40 |   const VkCommandBufferSubmitInfo * pCommandBufferInfos
        48 |   uint32_t signalSemaphoreInfoCount
        56 |   const VkSemaphoreSubmitInfo * pSignalSemaphoreInfos
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceSynchronization2Features
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 synchronization2
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkBufferCopy2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDeviceSize srcOffset
        24 |   VkDeviceSize dstOffset
        32 |   VkDeviceSize size
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkCopyBufferInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBuffer srcBuffer
        24 |   VkBuffer dstBuffer
        32 |   uint32_t regionCount
        40 |   const VkBufferCopy2 * pRegions
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageCopy2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkImageSubresourceLayers srcSubresource
        16 |     VkImageAspectFlags aspectMask
        20 |     uint32_t mipLevel
        24 |     uint32_t baseArrayLayer
        28 |     uint32_t layerCount
        32 |   struct VkOffset3D srcOffset
        32 |     int32_t x
        36 |     int32_t y
        40 |     int32_t z
        44 |   struct VkImageSubresourceLayers dstSubresource
        44 |     VkImageAspectFlags aspectMask
        48 |     uint32_t mipLevel
        52 |     uint32_t baseArrayLayer
        56 |     uint32_t layerCount
        60 |   struct VkOffset3D dstOffset
        60 |     int32_t x
        64 |     int32_t y
        68 |     int32_t z
        72 |   struct VkExtent3D extent
        72 |     uint32_t width
        76 |     uint32_t height
        80 |     uint32_t depth
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | struct VkCopyImageInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImage srcImage
        24 |   VkImageLayout srcImageLayout
        32 |   VkImage dstImage
        40 |   VkImageLayout dstImageLayout
        44 |   uint32_t regionCount
        48 |   const VkImageCopy2 * pRegions
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkBufferImageCopy2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDeviceSize bufferOffset
        24 |   uint32_t bufferRowLength
        28 |   uint32_t bufferImageHeight
        32 |   struct VkImageSubresourceLayers imageSubresource
        32 |     VkImageAspectFlags aspectMask
        36 |     uint32_t mipLevel
        40 |     uint32_t baseArrayLayer
        44 |     uint32_t layerCount
        48 |   struct VkOffset3D imageOffset
        48 |     int32_t x
        52 |     int32_t y
        56 |     int32_t z
        60 |   struct VkExtent3D imageExtent
        60 |     uint32_t width
        64 |     uint32_t height
        68 |     uint32_t depth
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkCopyBufferToImageInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBuffer srcBuffer
        24 |   VkImage dstImage
        32 |   VkImageLayout dstImageLayout
        36 |   uint32_t regionCount
        40 |   const VkBufferImageCopy2 * pRegions
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkCopyImageToBufferInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImage srcImage
        24 |   VkImageLayout srcImageLayout
        32 |   VkBuffer dstBuffer
        40 |   uint32_t regionCount
        48 |   const VkBufferImageCopy2 * pRegions
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceTextureCompressionASTCHDRFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 textureCompressionASTC_HDR
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkFormatProperties3
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkFormatFeatureFlags2 linearTilingFeatures
        24 |   VkFormatFeatureFlags2 optimalTilingFeatures
        32 |   VkFormatFeatureFlags2 bufferFeatures
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceMaintenance4Features
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 maintenance4
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceMaintenance4Properties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkDeviceSize maxBufferSize
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceBufferMemoryRequirements
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const VkBufferCreateInfo * pCreateInfo
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceImageMemoryRequirements
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const VkImageCreateInfo * pCreateInfo
        24 |   VkImageAspectFlagBits planeAspect
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineCreationFeedback
         0 |   VkPipelineCreationFeedbackFlags flags
         8 |   uint64_t duration
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineCreationFeedbackCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineCreationFeedback * pPipelineCreationFeedback
        24 |   uint32_t pipelineStageCreationFeedbackCount
        32 |   VkPipelineCreationFeedback * pPipelineStageCreationFeedbacks
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderTerminateInvocationFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderTerminateInvocation
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderDemoteToHelperInvocationFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderDemoteToHelperInvocation
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePipelineCreationCacheControlFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 pipelineCreationCacheControl
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceZeroInitializeWorkgroupMemoryFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderZeroInitializeWorkgroupMemory
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceImageRobustnessFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 robustImageAccess
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceSubgroupSizeControlFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 subgroupSizeControl
        20 |   VkBool32 computeFullSubgroups
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceSubgroupSizeControlProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t minSubgroupSize
        20 |   uint32_t maxSubgroupSize
        24 |   uint32_t maxComputeWorkgroupSubgroups
        28 |   VkShaderStageFlags requiredSubgroupSizeStages
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineShaderStageRequiredSubgroupSizeCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t requiredSubgroupSize
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceInlineUniformBlockFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 inlineUniformBlock
        20 |   VkBool32 descriptorBindingInlineUniformBlockUpdateAfterBind
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceInlineUniformBlockProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t maxInlineUniformBlockSize
        20 |   uint32_t maxPerStageDescriptorInlineUniformBlocks
        24 |   uint32_t maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks
        28 |   uint32_t maxDescriptorSetInlineUniformBlocks
        32 |   uint32_t maxDescriptorSetUpdateAfterBindInlineUniformBlocks
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkWriteDescriptorSetInlineUniformBlock
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t dataSize
        24 |   const void * pData
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkDescriptorPoolInlineUniformBlockCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t maxInlineUniformBlockBindings
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderIntegerDotProductFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderIntegerDotProduct
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderIntegerDotProductProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 integerDotProduct8BitUnsignedAccelerated
        20 |   VkBool32 integerDotProduct8BitSignedAccelerated
        24 |   VkBool32 integerDotProduct8BitMixedSignednessAccelerated
        28 |   VkBool32 integerDotProduct4x8BitPackedUnsignedAccelerated
        32 |   VkBool32 integerDotProduct4x8BitPackedSignedAccelerated
        36 |   VkBool32 integerDotProduct4x8BitPackedMixedSignednessAccelerated
        40 |   VkBool32 integerDotProduct16BitUnsignedAccelerated
        44 |   VkBool32 integerDotProduct16BitSignedAccelerated
        48 |   VkBool32 integerDotProduct16BitMixedSignednessAccelerated
        52 |   VkBool32 integerDotProduct32BitUnsignedAccelerated
        56 |   VkBool32 integerDotProduct32BitSignedAccelerated
        60 |   VkBool32 integerDotProduct32BitMixedSignednessAccelerated
        64 |   VkBool32 integerDotProduct64BitUnsignedAccelerated
        68 |   VkBool32 integerDotProduct64BitSignedAccelerated
        72 |   VkBool32 integerDotProduct64BitMixedSignednessAccelerated
        76 |   VkBool32 integerDotProductAccumulatingSaturating8BitUnsignedAccelerated
        80 |   VkBool32 integerDotProductAccumulatingSaturating8BitSignedAccelerated
        84 |   VkBool32 integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated
        88 |   VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated
        92 |   VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated
        96 |   VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated
       100 |   VkBool32 integerDotProductAccumulatingSaturating16BitUnsignedAccelerated
       104 |   VkBool32 integerDotProductAccumulatingSaturating16BitSignedAccelerated
       108 |   VkBool32 integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated
       112 |   VkBool32 integerDotProductAccumulatingSaturating32BitUnsignedAccelerated
       116 |   VkBool32 integerDotProductAccumulatingSaturating32BitSignedAccelerated
       120 |   VkBool32 integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated
       124 |   VkBool32 integerDotProductAccumulatingSaturating64BitUnsignedAccelerated
       128 |   VkBool32 integerDotProductAccumulatingSaturating64BitSignedAccelerated
       132 |   VkBool32 integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated
           | [sizeof=136, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceTexelBufferAlignmentProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkDeviceSize storageTexelBufferOffsetAlignmentBytes
        24 |   VkBool32 storageTexelBufferOffsetSingleTexelAlignment
        32 |   VkDeviceSize uniformTexelBufferOffsetAlignmentBytes
        40 |   VkBool32 uniformTexelBufferOffsetSingleTexelAlignment
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageBlit2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkImageSubresourceLayers srcSubresource
        16 |     VkImageAspectFlags aspectMask
        20 |     uint32_t mipLevel
        24 |     uint32_t baseArrayLayer
        28 |     uint32_t layerCount
        32 |   VkOffset3D[2] srcOffsets
        56 |   struct VkImageSubresourceLayers dstSubresource
        56 |     VkImageAspectFlags aspectMask
        60 |     uint32_t mipLevel
        64 |     uint32_t baseArrayLayer
        68 |     uint32_t layerCount
        72 |   VkOffset3D[2] dstOffsets
           | [sizeof=96, align=8]

*** Dumping AST Record Layout
         0 | struct VkBlitImageInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImage srcImage
        24 |   VkImageLayout srcImageLayout
        32 |   VkImage dstImage
        40 |   VkImageLayout dstImageLayout
        44 |   uint32_t regionCount
        48 |   const VkImageBlit2 * pRegions
        56 |   VkFilter filter
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageResolve2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkImageSubresourceLayers srcSubresource
        16 |     VkImageAspectFlags aspectMask
        20 |     uint32_t mipLevel
        24 |     uint32_t baseArrayLayer
        28 |     uint32_t layerCount
        32 |   struct VkOffset3D srcOffset
        32 |     int32_t x
        36 |     int32_t y
        40 |     int32_t z
        44 |   struct VkImageSubresourceLayers dstSubresource
        44 |     VkImageAspectFlags aspectMask
        48 |     uint32_t mipLevel
        52 |     uint32_t baseArrayLayer
        56 |     uint32_t layerCount
        60 |   struct VkOffset3D dstOffset
        60 |     int32_t x
        64 |     int32_t y
        68 |     int32_t z
        72 |   struct VkExtent3D extent
        72 |     uint32_t width
        76 |     uint32_t height
        80 |     uint32_t depth
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | struct VkResolveImageInfo2
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImage srcImage
        24 |   VkImageLayout srcImageLayout
        32 |   VkImage dstImage
        40 |   VkImageLayout dstImageLayout
        44 |   uint32_t regionCount
        48 |   const VkImageResolve2 * pRegions
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkRenderingAttachmentInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImageView imageView
        24 |   VkImageLayout imageLayout
        28 |   VkResolveModeFlagBits resolveMode
        32 |   VkImageView resolveImageView
        40 |   VkImageLayout resolveImageLayout
        44 |   VkAttachmentLoadOp loadOp
        48 |   VkAttachmentStoreOp storeOp
        52 |   union VkClearValue clearValue
        52 |     union VkClearColorValue color
        52 |       float[4] float32
        52 |       int32_t[4] int32
        52 |       uint32_t[4] uint32
        52 |     struct VkClearDepthStencilValue depthStencil
        52 |       float depth
        56 |       uint32_t stencil
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkRenderingInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkRenderingFlags flags
        20 |   struct VkRect2D renderArea
        20 |     struct VkOffset2D offset
        20 |       int32_t x
        24 |       int32_t y
        28 |     struct VkExtent2D extent
        28 |       uint32_t width
        32 |       uint32_t height
        36 |   uint32_t layerCount
        40 |   uint32_t viewMask
        44 |   uint32_t colorAttachmentCount
        48 |   const VkRenderingAttachmentInfo * pColorAttachments
        56 |   const VkRenderingAttachmentInfo * pDepthAttachment
        64 |   const VkRenderingAttachmentInfo * pStencilAttachment
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineRenderingCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t viewMask
        20 |   uint32_t colorAttachmentCount
        24 |   const VkFormat * pColorAttachmentFormats
        32 |   VkFormat depthAttachmentFormat
        36 |   VkFormat stencilAttachmentFormat
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceDynamicRenderingFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 dynamicRendering
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkCommandBufferInheritanceRenderingInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkRenderingFlags flags
        20 |   uint32_t viewMask
        24 |   uint32_t colorAttachmentCount
        32 |   const VkFormat * pColorAttachmentFormats
        40 |   VkFormat depthAttachmentFormat
        44 |   VkFormat stencilAttachmentFormat
        48 |   VkSampleCountFlagBits rasterizationSamples
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVulkan14Features
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 globalPriorityQuery
        20 |   VkBool32 shaderSubgroupRotate
        24 |   VkBool32 shaderSubgroupRotateClustered
        28 |   VkBool32 shaderFloatControls2
        32 |   VkBool32 shaderExpectAssume
        36 |   VkBool32 rectangularLines
        40 |   VkBool32 bresenhamLines
        44 |   VkBool32 smoothLines
        48 |   VkBool32 stippledRectangularLines
        52 |   VkBool32 stippledBresenhamLines
        56 |   VkBool32 stippledSmoothLines
        60 |   VkBool32 vertexAttributeInstanceRateDivisor
        64 |   VkBool32 vertexAttributeInstanceRateZeroDivisor
        68 |   VkBool32 indexTypeUint8
        72 |   VkBool32 dynamicRenderingLocalRead
        76 |   VkBool32 maintenance5
        80 |   VkBool32 maintenance6
        84 |   VkBool32 pipelineProtectedAccess
        88 |   VkBool32 pipelineRobustness
        92 |   VkBool32 hostImageCopy
        96 |   VkBool32 pushDescriptor
           | [sizeof=104, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVulkan14Properties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t lineSubPixelPrecisionBits
        20 |   uint32_t maxVertexAttribDivisor
        24 |   VkBool32 supportsNonZeroFirstInstance
        28 |   uint32_t maxPushDescriptors
        32 |   VkBool32 dynamicRenderingLocalReadDepthStencilAttachments
        36 |   VkBool32 dynamicRenderingLocalReadMultisampledAttachments
        40 |   VkBool32 earlyFragmentMultisampleCoverageAfterSampleCounting
        44 |   VkBool32 earlyFragmentSampleMaskTestBeforeSampleCounting
        48 |   VkBool32 depthStencilSwizzleOneSupport
        52 |   VkBool32 polygonModePointSize
        56 |   VkBool32 nonStrictSinglePixelWideLinesUseParallelogram
        60 |   VkBool32 nonStrictWideLinesUseParallelogram
        64 |   VkBool32 blockTexelViewCompatibleMultipleLayers
        68 |   uint32_t maxCombinedImageSamplerDescriptorCount
        72 |   VkBool32 fragmentShadingRateClampCombinerInputs
        76 |   VkPipelineRobustnessBufferBehavior defaultRobustnessStorageBuffers
        80 |   VkPipelineRobustnessBufferBehavior defaultRobustnessUniformBuffers
        84 |   VkPipelineRobustnessBufferBehavior defaultRobustnessVertexInputs
        88 |   VkPipelineRobustnessImageBehavior defaultRobustnessImages
        92 |   uint32_t copySrcLayoutCount
        96 |   VkImageLayout * pCopySrcLayouts
       104 |   uint32_t copyDstLayoutCount
       112 |   VkImageLayout * pCopyDstLayouts
       120 |   uint8_t[16] optimalTilingLayoutUUID
       136 |   VkBool32 identicalMemoryTypeRequirements
           | [sizeof=144, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceQueueGlobalPriorityCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkQueueGlobalPriority globalPriority
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceGlobalPriorityQueryFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 globalPriorityQuery
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkQueueFamilyGlobalPriorityProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t priorityCount
        20 |   VkQueueGlobalPriority[16] priorities
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceIndexTypeUint8Features
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 indexTypeUint8
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryMapInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkMemoryMapFlags flags
        24 |   VkDeviceMemory memory
        32 |   VkDeviceSize offset
        40 |   VkDeviceSize size
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryUnmapInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkMemoryUnmapFlags flags
        24 |   VkDeviceMemory memory
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceMaintenance5Features
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 maintenance5
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceMaintenance5Properties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 earlyFragmentMultisampleCoverageAfterSampleCounting
        20 |   VkBool32 earlyFragmentSampleMaskTestBeforeSampleCounting
        24 |   VkBool32 depthStencilSwizzleOneSupport
        28 |   VkBool32 polygonModePointSize
        32 |   VkBool32 nonStrictSinglePixelWideLinesUseParallelogram
        36 |   VkBool32 nonStrictWideLinesUseParallelogram
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkSubresourceLayout2
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkSubresourceLayout subresourceLayout
        16 |     VkDeviceSize offset
        24 |     VkDeviceSize size
        32 |     VkDeviceSize rowPitch
        40 |     VkDeviceSize arrayPitch
        48 |     VkDeviceSize depthPitch
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageSubresource2
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkImageSubresource imageSubresource
        16 |     VkImageAspectFlags aspectMask
        20 |     uint32_t mipLevel
        24 |     uint32_t arrayLayer
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceImageSubresourceInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const VkImageCreateInfo * pCreateInfo
        24 |   const VkImageSubresource2 * pSubresource
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkBufferUsageFlags2CreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBufferUsageFlags2 usage
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceMaintenance6Features
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 maintenance6
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceMaintenance6Properties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 blockTexelViewCompatibleMultipleLayers
        20 |   uint32_t maxCombinedImageSamplerDescriptorCount
        24 |   VkBool32 fragmentShadingRateClampCombinerInputs
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindMemoryStatus
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkResult * pResult
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceHostImageCopyFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 hostImageCopy
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceHostImageCopyProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t copySrcLayoutCount
        24 |   VkImageLayout * pCopySrcLayouts
        32 |   uint32_t copyDstLayoutCount
        40 |   VkImageLayout * pCopyDstLayouts
        48 |   uint8_t[16] optimalTilingLayoutUUID
        64 |   VkBool32 identicalMemoryTypeRequirements
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryToImageCopy
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const void * pHostPointer
        24 |   uint32_t memoryRowLength
        28 |   uint32_t memoryImageHeight
        32 |   struct VkImageSubresourceLayers imageSubresource
        32 |     VkImageAspectFlags aspectMask
        36 |     uint32_t mipLevel
        40 |     uint32_t baseArrayLayer
        44 |     uint32_t layerCount
        48 |   struct VkOffset3D imageOffset
        48 |     int32_t x
        52 |     int32_t y
        56 |     int32_t z
        60 |   struct VkExtent3D imageExtent
        60 |     uint32_t width
        64 |     uint32_t height
        68 |     uint32_t depth
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageToMemoryCopy
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   void * pHostPointer
        24 |   uint32_t memoryRowLength
        28 |   uint32_t memoryImageHeight
        32 |   struct VkImageSubresourceLayers imageSubresource
        32 |     VkImageAspectFlags aspectMask
        36 |     uint32_t mipLevel
        40 |     uint32_t baseArrayLayer
        44 |     uint32_t layerCount
        48 |   struct VkOffset3D imageOffset
        48 |     int32_t x
        52 |     int32_t y
        56 |     int32_t z
        60 |   struct VkExtent3D imageExtent
        60 |     uint32_t width
        64 |     uint32_t height
        68 |     uint32_t depth
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkCopyMemoryToImageInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkHostImageCopyFlags flags
        24 |   VkImage dstImage
        32 |   VkImageLayout dstImageLayout
        36 |   uint32_t regionCount
        40 |   const VkMemoryToImageCopy * pRegions
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkCopyImageToMemoryInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkHostImageCopyFlags flags
        24 |   VkImage srcImage
        32 |   VkImageLayout srcImageLayout
        36 |   uint32_t regionCount
        40 |   const VkImageToMemoryCopy * pRegions
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkCopyImageToImageInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkHostImageCopyFlags flags
        24 |   VkImage srcImage
        32 |   VkImageLayout srcImageLayout
        40 |   VkImage dstImage
        48 |   VkImageLayout dstImageLayout
        52 |   uint32_t regionCount
        56 |   const VkImageCopy2 * pRegions
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkHostImageLayoutTransitionInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImage image
        24 |   VkImageLayout oldLayout
        28 |   VkImageLayout newLayout
        32 |   struct VkImageSubresourceRange subresourceRange
        32 |     VkImageAspectFlags aspectMask
        36 |     uint32_t baseMipLevel
        40 |     uint32_t levelCount
        44 |     uint32_t baseArrayLayer
        48 |     uint32_t layerCount
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkSubresourceHostMemcpySize
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkDeviceSize size
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkHostImageCopyDevicePerformanceQuery
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 optimalDeviceAccess
        20 |   VkBool32 identicalMemoryLayout
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderSubgroupRotateFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderSubgroupRotate
        20 |   VkBool32 shaderSubgroupRotateClustered
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderFloatControls2Features
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderFloatControls2
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderExpectAssumeFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderExpectAssume
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineCreateFlags2CreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineCreateFlags2 flags
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePushDescriptorProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t maxPushDescriptors
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindDescriptorSetsInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkShaderStageFlags stageFlags
        24 |   VkPipelineLayout layout
        32 |   uint32_t firstSet
        36 |   uint32_t descriptorSetCount
        40 |   const VkDescriptorSet * pDescriptorSets
        48 |   uint32_t dynamicOffsetCount
        56 |   const uint32_t * pDynamicOffsets
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkPushConstantsInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineLayout layout
        24 |   VkShaderStageFlags stageFlags
        28 |   uint32_t offset
        32 |   uint32_t size
        40 |   const void * pValues
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkPushDescriptorSetInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkShaderStageFlags stageFlags
        24 |   VkPipelineLayout layout
        32 |   uint32_t set
        36 |   uint32_t descriptorWriteCount
        40 |   const VkWriteDescriptorSet * pDescriptorWrites
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkPushDescriptorSetWithTemplateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDescriptorUpdateTemplate descriptorUpdateTemplate
        24 |   VkPipelineLayout layout
        32 |   uint32_t set
        40 |   const void * pData
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePipelineProtectedAccessFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 pipelineProtectedAccess
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePipelineRobustnessFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 pipelineRobustness
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePipelineRobustnessProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkPipelineRobustnessBufferBehavior defaultRobustnessStorageBuffers
        20 |   VkPipelineRobustnessBufferBehavior defaultRobustnessUniformBuffers
        24 |   VkPipelineRobustnessBufferBehavior defaultRobustnessVertexInputs
        28 |   VkPipelineRobustnessImageBehavior defaultRobustnessImages
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineRobustnessCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineRobustnessBufferBehavior storageBuffers
        20 |   VkPipelineRobustnessBufferBehavior uniformBuffers
        24 |   VkPipelineRobustnessBufferBehavior vertexInputs
        28 |   VkPipelineRobustnessImageBehavior images
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceLineRasterizationFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 rectangularLines
        20 |   VkBool32 bresenhamLines
        24 |   VkBool32 smoothLines
        28 |   VkBool32 stippledRectangularLines
        32 |   VkBool32 stippledBresenhamLines
        36 |   VkBool32 stippledSmoothLines
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceLineRasterizationProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t lineSubPixelPrecisionBits
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineRasterizationLineStateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkLineRasterizationMode lineRasterizationMode
        20 |   VkBool32 stippledLineEnable
        24 |   uint32_t lineStippleFactor
        28 |   uint16_t lineStipplePattern
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVertexAttributeDivisorProperties
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t maxVertexAttribDivisor
        20 |   VkBool32 supportsNonZeroFirstInstance
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVertexInputBindingDivisorDescription
         0 |   uint32_t binding
         4 |   uint32_t divisor
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct VkPipelineVertexInputDivisorStateCreateInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t vertexBindingDivisorCount
        24 |   const VkVertexInputBindingDivisorDescription * pVertexBindingDivisors
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVertexAttributeDivisorFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 vertexAttributeInstanceRateDivisor
        20 |   VkBool32 vertexAttributeInstanceRateZeroDivisor
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkRenderingAreaInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t viewMask
        20 |   uint32_t colorAttachmentCount
        24 |   const VkFormat * pColorAttachmentFormats
        32 |   VkFormat depthAttachmentFormat
        36 |   VkFormat stencilAttachmentFormat
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceDynamicRenderingLocalReadFeatures
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 dynamicRenderingLocalRead
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkRenderingAttachmentLocationInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t colorAttachmentCount
        24 |   const uint32_t * pColorAttachmentLocations
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkRenderingInputAttachmentIndexInfo
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t colorAttachmentCount
        24 |   const uint32_t * pColorAttachmentInputIndices
        32 |   const uint32_t * pDepthInputAttachmentIndex
        40 |   const uint32_t * pStencilInputAttachmentIndex
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkSurfaceCapabilitiesKHR
         0 |   uint32_t minImageCount
         4 |   uint32_t maxImageCount
         8 |   struct VkExtent2D currentExtent
         8 |     uint32_t width
        12 |     uint32_t height
        16 |   struct VkExtent2D minImageExtent
        16 |     uint32_t width
        20 |     uint32_t height
        24 |   struct VkExtent2D maxImageExtent
        24 |     uint32_t width
        28 |     uint32_t height
        32 |   uint32_t maxImageArrayLayers
        36 |   VkSurfaceTransformFlagsKHR supportedTransforms
        40 |   VkSurfaceTransformFlagBitsKHR currentTransform
        44 |   VkCompositeAlphaFlagsKHR supportedCompositeAlpha
        48 |   VkImageUsageFlags supportedUsageFlags
           | [sizeof=52, align=4]

*** Dumping AST Record Layout
         0 | struct VkSurfaceFormatKHR
         0 |   VkFormat format
         4 |   VkColorSpaceKHR colorSpace
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct VkSwapchainCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSwapchainCreateFlagsKHR flags
        24 |   VkSurfaceKHR surface
        32 |   uint32_t minImageCount
        36 |   VkFormat imageFormat
        40 |   VkColorSpaceKHR imageColorSpace
        44 |   struct VkExtent2D imageExtent
        44 |     uint32_t width
        48 |     uint32_t height
        52 |   uint32_t imageArrayLayers
        56 |   VkImageUsageFlags imageUsage
        60 |   VkSharingMode imageSharingMode
        64 |   uint32_t queueFamilyIndexCount
        72 |   const uint32_t * pQueueFamilyIndices
        80 |   VkSurfaceTransformFlagBitsKHR preTransform
        84 |   VkCompositeAlphaFlagBitsKHR compositeAlpha
        88 |   VkPresentModeKHR presentMode
        92 |   VkBool32 clipped
        96 |   VkSwapchainKHR oldSwapchain
           | [sizeof=104, align=8]

*** Dumping AST Record Layout
         0 | struct VkPresentInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t waitSemaphoreCount
        24 |   const VkSemaphore * pWaitSemaphores
        32 |   uint32_t swapchainCount
        40 |   const VkSwapchainKHR * pSwapchains
        48 |   const uint32_t * pImageIndices
        56 |   VkResult * pResults
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkImageSwapchainCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSwapchainKHR swapchain
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindImageMemorySwapchainInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSwapchainKHR swapchain
        24 |   uint32_t imageIndex
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkAcquireNextImageInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSwapchainKHR swapchain
        24 |   uint64_t timeout
        32 |   VkSemaphore semaphore
        40 |   VkFence fence
        48 |   uint32_t deviceMask
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceGroupPresentCapabilitiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t[32] presentMask
       144 |   VkDeviceGroupPresentModeFlagsKHR modes
           | [sizeof=152, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceGroupPresentInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t swapchainCount
        24 |   const uint32_t * pDeviceMasks
        32 |   VkDeviceGroupPresentModeFlagBitsKHR mode
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceGroupSwapchainCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDeviceGroupPresentModeFlagsKHR modes
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDisplayModeParametersKHR
         0 |   struct VkExtent2D visibleRegion
         0 |     uint32_t width
         4 |     uint32_t height
         8 |   uint32_t refreshRate
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkDisplayModeCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDisplayModeCreateFlagsKHR flags
        20 |   struct VkDisplayModeParametersKHR parameters
        20 |     struct VkExtent2D visibleRegion
        20 |       uint32_t width
        24 |       uint32_t height
        28 |     uint32_t refreshRate
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkDisplayModePropertiesKHR
         0 |   VkDisplayModeKHR displayMode
         8 |   struct VkDisplayModeParametersKHR parameters
         8 |     struct VkExtent2D visibleRegion
         8 |       uint32_t width
        12 |       uint32_t height
        16 |     uint32_t refreshRate
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDisplayPlaneCapabilitiesKHR
         0 |   VkDisplayPlaneAlphaFlagsKHR supportedAlpha
         4 |   struct VkOffset2D minSrcPosition
         4 |     int32_t x
         8 |     int32_t y
        12 |   struct VkOffset2D maxSrcPosition
        12 |     int32_t x
        16 |     int32_t y
        20 |   struct VkExtent2D minSrcExtent
        20 |     uint32_t width
        24 |     uint32_t height
        28 |   struct VkExtent2D maxSrcExtent
        28 |     uint32_t width
        32 |     uint32_t height
        36 |   struct VkOffset2D minDstPosition
        36 |     int32_t x
        40 |     int32_t y
        44 |   struct VkOffset2D maxDstPosition
        44 |     int32_t x
        48 |     int32_t y
        52 |   struct VkExtent2D minDstExtent
        52 |     uint32_t width
        56 |     uint32_t height
        60 |   struct VkExtent2D maxDstExtent
        60 |     uint32_t width
        64 |     uint32_t height
           | [sizeof=68, align=4]

*** Dumping AST Record Layout
         0 | struct VkDisplayPlanePropertiesKHR
         0 |   VkDisplayKHR currentDisplay
         8 |   uint32_t currentStackIndex
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct VkDisplayPropertiesKHR
         0 |   VkDisplayKHR display
         8 |   const char * displayName
        16 |   struct VkExtent2D physicalDimensions
        16 |     uint32_t width
        20 |     uint32_t height
        24 |   struct VkExtent2D physicalResolution
        24 |     uint32_t width
        28 |     uint32_t height
        32 |   VkSurfaceTransformFlagsKHR supportedTransforms
        36 |   VkBool32 planeReorderPossible
        40 |   VkBool32 persistentContent
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkDisplaySurfaceCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDisplaySurfaceCreateFlagsKHR flags
        24 |   VkDisplayModeKHR displayMode
        32 |   uint32_t planeIndex
        36 |   uint32_t planeStackIndex
        40 |   VkSurfaceTransformFlagBitsKHR transform
        44 |   float globalAlpha
        48 |   VkDisplayPlaneAlphaFlagBitsKHR alphaMode
        52 |   struct VkExtent2D imageExtent
        52 |     uint32_t width
        56 |     uint32_t height
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkDisplayPresentInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkRect2D srcRect
        16 |     struct VkOffset2D offset
        16 |       int32_t x
        20 |       int32_t y
        24 |     struct VkExtent2D extent
        24 |       uint32_t width
        28 |       uint32_t height
        32 |   struct VkRect2D dstRect
        32 |     struct VkOffset2D offset
        32 |       int32_t x
        36 |       int32_t y
        40 |     struct VkExtent2D extent
        40 |       uint32_t width
        44 |       uint32_t height
        48 |   VkBool32 persistent
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkQueueFamilyQueryResultStatusPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 queryResultStatusSupport
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkQueueFamilyVideoPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkVideoCodecOperationFlagsKHR videoCodecOperations
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoProfileInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoCodecOperationFlagBitsKHR videoCodecOperation
        20 |   VkVideoChromaSubsamplingFlagsKHR chromaSubsampling
        24 |   VkVideoComponentBitDepthFlagsKHR lumaBitDepth
        28 |   VkVideoComponentBitDepthFlagsKHR chromaBitDepth
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoProfileListInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t profileCount
        24 |   const VkVideoProfileInfoKHR * pProfiles
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoCapabilitiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkVideoCapabilityFlagsKHR flags
        24 |   VkDeviceSize minBitstreamBufferOffsetAlignment
        32 |   VkDeviceSize minBitstreamBufferSizeAlignment
        40 |   struct VkExtent2D pictureAccessGranularity
        40 |     uint32_t width
        44 |     uint32_t height
        48 |   struct VkExtent2D minCodedExtent
        48 |     uint32_t width
        52 |     uint32_t height
        56 |   struct VkExtent2D maxCodedExtent
        56 |     uint32_t width
        60 |     uint32_t height
        64 |   uint32_t maxDpbSlots
        68 |   uint32_t maxActiveReferencePictures
        72 |   struct VkExtensionProperties stdHeaderVersion
        72 |     char[256] extensionName
       328 |     uint32_t specVersion
           | [sizeof=336, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVideoFormatInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImageUsageFlags imageUsage
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoFormatPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkFormat format
        20 |   struct VkComponentMapping componentMapping
        20 |     VkComponentSwizzle r
        24 |     VkComponentSwizzle g
        28 |     VkComponentSwizzle b
        32 |     VkComponentSwizzle a
        36 |   VkImageCreateFlags imageCreateFlags
        40 |   VkImageType imageType
        44 |   VkImageTiling imageTiling
        48 |   VkImageUsageFlags imageUsageFlags
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoPictureResourceInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkOffset2D codedOffset
        16 |     int32_t x
        20 |     int32_t y
        24 |   struct VkExtent2D codedExtent
        24 |     uint32_t width
        28 |     uint32_t height
        32 |   uint32_t baseArrayLayer
        40 |   VkImageView imageViewBinding
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoReferenceSlotInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   int32_t slotIndex
        24 |   const VkVideoPictureResourceInfoKHR * pPictureResource
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoSessionMemoryRequirementsKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t memoryBindIndex
        24 |   struct VkMemoryRequirements memoryRequirements
        24 |     VkDeviceSize size
        32 |     VkDeviceSize alignment
        40 |     uint32_t memoryTypeBits
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindVideoSessionMemoryInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t memoryBindIndex
        24 |   VkDeviceMemory memory
        32 |   VkDeviceSize memoryOffset
        40 |   VkDeviceSize memorySize
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoSessionCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t queueFamilyIndex
        20 |   VkVideoSessionCreateFlagsKHR flags
        24 |   const VkVideoProfileInfoKHR * pVideoProfile
        32 |   VkFormat pictureFormat
        36 |   struct VkExtent2D maxCodedExtent
        36 |     uint32_t width
        40 |     uint32_t height
        44 |   VkFormat referencePictureFormat
        48 |   uint32_t maxDpbSlots
        52 |   uint32_t maxActiveReferencePictures
        56 |   const VkExtensionProperties * pStdHeaderVersion
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoSessionParametersCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoSessionParametersCreateFlagsKHR flags
        24 |   VkVideoSessionParametersKHR videoSessionParametersTemplate
        32 |   VkVideoSessionKHR videoSession
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoSessionParametersUpdateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t updateSequenceCount
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoBeginCodingInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoBeginCodingFlagsKHR flags
        24 |   VkVideoSessionKHR videoSession
        32 |   VkVideoSessionParametersKHR videoSessionParameters
        40 |   uint32_t referenceSlotCount
        48 |   const VkVideoReferenceSlotInfoKHR * pReferenceSlots
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEndCodingInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoEndCodingFlagsKHR flags
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoCodingControlInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoCodingControlFlagsKHR flags
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeCapabilitiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkVideoDecodeCapabilityFlagsKHR flags
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeUsageInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoDecodeUsageFlagsKHR videoUsageHints
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoDecodeFlagsKHR flags
        24 |   VkBuffer srcBuffer
        32 |   VkDeviceSize srcBufferOffset
        40 |   VkDeviceSize srcBufferRange
        48 |   struct VkVideoPictureResourceInfoKHR dstPictureResource
        48 |     VkStructureType sType
        56 |     const void * pNext
        64 |     struct VkOffset2D codedOffset
        64 |       int32_t x
        68 |       int32_t y
        72 |     struct VkExtent2D codedExtent
        72 |       uint32_t width
        76 |       uint32_t height
        80 |     uint32_t baseArrayLayer
        88 |     VkImageView imageViewBinding
        96 |   const VkVideoReferenceSlotInfoKHR * pSetupReferenceSlot
       104 |   uint32_t referenceSlotCount
       112 |   const VkVideoReferenceSlotInfoKHR * pReferenceSlots
           | [sizeof=120, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoH264SpsVuiFlags
     0:0-0 |   uint32_t aspect_ratio_info_present_flag
     0:1-1 |   uint32_t overscan_info_present_flag
     0:2-2 |   uint32_t overscan_appropriate_flag
     0:3-3 |   uint32_t video_signal_type_present_flag
     0:4-4 |   uint32_t video_full_range_flag
     0:5-5 |   uint32_t color_description_present_flag
     0:6-6 |   uint32_t chroma_loc_info_present_flag
     0:7-7 |   uint32_t timing_info_present_flag
     1:0-0 |   uint32_t fixed_frame_rate_flag
     1:1-1 |   uint32_t bitstream_restriction_flag
     1:2-2 |   uint32_t nal_hrd_parameters_present_flag
     1:3-3 |   uint32_t vcl_hrd_parameters_present_flag
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH264HrdParameters
         0 |   uint8_t cpb_cnt_minus1
         1 |   uint8_t bit_rate_scale
         2 |   uint8_t cpb_size_scale
         3 |   uint8_t reserved1
         4 |   uint32_t[32] bit_rate_value_minus1
       132 |   uint32_t[32] cpb_size_value_minus1
       260 |   uint8_t[32] cbr_flag
       292 |   uint32_t initial_cpb_removal_delay_length_minus1
       296 |   uint32_t cpb_removal_delay_length_minus1
       300 |   uint32_t dpb_output_delay_length_minus1
       304 |   uint32_t time_offset_length
           | [sizeof=308, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH264SequenceParameterSetVui
         0 |   struct StdVideoH264SpsVuiFlags flags
     0:0-0 |     uint32_t aspect_ratio_info_present_flag
     0:1-1 |     uint32_t overscan_info_present_flag
     0:2-2 |     uint32_t overscan_appropriate_flag
     0:3-3 |     uint32_t video_signal_type_present_flag
     0:4-4 |     uint32_t video_full_range_flag
     0:5-5 |     uint32_t color_description_present_flag
     0:6-6 |     uint32_t chroma_loc_info_present_flag
     0:7-7 |     uint32_t timing_info_present_flag
     1:0-0 |     uint32_t fixed_frame_rate_flag
     1:1-1 |     uint32_t bitstream_restriction_flag
     1:2-2 |     uint32_t nal_hrd_parameters_present_flag
     1:3-3 |     uint32_t vcl_hrd_parameters_present_flag
         4 |   StdVideoH264AspectRatioIdc aspect_ratio_idc
         8 |   uint16_t sar_width
        10 |   uint16_t sar_height
        12 |   uint8_t video_format
        13 |   uint8_t colour_primaries
        14 |   uint8_t transfer_characteristics
        15 |   uint8_t matrix_coefficients
        16 |   uint32_t num_units_in_tick
        20 |   uint32_t time_scale
        24 |   uint8_t max_num_reorder_frames
        25 |   uint8_t max_dec_frame_buffering
        26 |   uint8_t chroma_sample_loc_type_top_field
        27 |   uint8_t chroma_sample_loc_type_bottom_field
        28 |   uint32_t reserved1
        32 |   const StdVideoH264HrdParameters * pHrdParameters
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoH264SpsFlags
     0:0-0 |   uint32_t constraint_set0_flag
     0:1-1 |   uint32_t constraint_set1_flag
     0:2-2 |   uint32_t constraint_set2_flag
     0:3-3 |   uint32_t constraint_set3_flag
     0:4-4 |   uint32_t constraint_set4_flag
     0:5-5 |   uint32_t constraint_set5_flag
     0:6-6 |   uint32_t direct_8x8_inference_flag
     0:7-7 |   uint32_t mb_adaptive_frame_field_flag
     1:0-0 |   uint32_t frame_mbs_only_flag
     1:1-1 |   uint32_t delta_pic_order_always_zero_flag
     1:2-2 |   uint32_t separate_colour_plane_flag
     1:3-3 |   uint32_t gaps_in_frame_num_value_allowed_flag
     1:4-4 |   uint32_t qpprime_y_zero_transform_bypass_flag
     1:5-5 |   uint32_t frame_cropping_flag
     1:6-6 |   uint32_t seq_scaling_matrix_present_flag
     1:7-7 |   uint32_t vui_parameters_present_flag
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH264ScalingLists
         0 |   uint16_t scaling_list_present_mask
         2 |   uint16_t use_default_scaling_matrix_mask
         4 |   uint8_t[6][16] ScalingList4x4
       100 |   uint8_t[6][64] ScalingList8x8
           | [sizeof=484, align=2]

*** Dumping AST Record Layout
         0 | struct StdVideoH264SequenceParameterSet
         0 |   struct StdVideoH264SpsFlags flags
     0:0-0 |     uint32_t constraint_set0_flag
     0:1-1 |     uint32_t constraint_set1_flag
     0:2-2 |     uint32_t constraint_set2_flag
     0:3-3 |     uint32_t constraint_set3_flag
     0:4-4 |     uint32_t constraint_set4_flag
     0:5-5 |     uint32_t constraint_set5_flag
     0:6-6 |     uint32_t direct_8x8_inference_flag
     0:7-7 |     uint32_t mb_adaptive_frame_field_flag
     1:0-0 |     uint32_t frame_mbs_only_flag
     1:1-1 |     uint32_t delta_pic_order_always_zero_flag
     1:2-2 |     uint32_t separate_colour_plane_flag
     1:3-3 |     uint32_t gaps_in_frame_num_value_allowed_flag
     1:4-4 |     uint32_t qpprime_y_zero_transform_bypass_flag
     1:5-5 |     uint32_t frame_cropping_flag
     1:6-6 |     uint32_t seq_scaling_matrix_present_flag
     1:7-7 |     uint32_t vui_parameters_present_flag
         4 |   StdVideoH264ProfileIdc profile_idc
         8 |   StdVideoH264LevelIdc level_idc
        12 |   StdVideoH264ChromaFormatIdc chroma_format_idc
        16 |   uint8_t seq_parameter_set_id
        17 |   uint8_t bit_depth_luma_minus8
        18 |   uint8_t bit_depth_chroma_minus8
        19 |   uint8_t log2_max_frame_num_minus4
        20 |   StdVideoH264PocType pic_order_cnt_type
        24 |   int32_t offset_for_non_ref_pic
        28 |   int32_t offset_for_top_to_bottom_field
        32 |   uint8_t log2_max_pic_order_cnt_lsb_minus4
        33 |   uint8_t num_ref_frames_in_pic_order_cnt_cycle
        34 |   uint8_t max_num_ref_frames
        35 |   uint8_t reserved1
        36 |   uint32_t pic_width_in_mbs_minus1
        40 |   uint32_t pic_height_in_map_units_minus1
        44 |   uint32_t frame_crop_left_offset
        48 |   uint32_t frame_crop_right_offset
        52 |   uint32_t frame_crop_top_offset
        56 |   uint32_t frame_crop_bottom_offset
        60 |   uint32_t reserved2
        64 |   const int32_t * pOffsetForRefFrame
        72 |   const StdVideoH264ScalingLists * pScalingLists
        80 |   const StdVideoH264SequenceParameterSetVui * pSequenceParameterSetVui
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoH264PpsFlags
     0:0-0 |   uint32_t transform_8x8_mode_flag
     0:1-1 |   uint32_t redundant_pic_cnt_present_flag
     0:2-2 |   uint32_t constrained_intra_pred_flag
     0:3-3 |   uint32_t deblocking_filter_control_present_flag
     0:4-4 |   uint32_t weighted_pred_flag
     0:5-5 |   uint32_t bottom_field_pic_order_in_frame_present_flag
     0:6-6 |   uint32_t entropy_coding_mode_flag
     0:7-7 |   uint32_t pic_scaling_matrix_present_flag
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH264PictureParameterSet
         0 |   struct StdVideoH264PpsFlags flags
     0:0-0 |     uint32_t transform_8x8_mode_flag
     0:1-1 |     uint32_t redundant_pic_cnt_present_flag
     0:2-2 |     uint32_t constrained_intra_pred_flag
     0:3-3 |     uint32_t deblocking_filter_control_present_flag
     0:4-4 |     uint32_t weighted_pred_flag
     0:5-5 |     uint32_t bottom_field_pic_order_in_frame_present_flag
     0:6-6 |     uint32_t entropy_coding_mode_flag
     0:7-7 |     uint32_t pic_scaling_matrix_present_flag
         4 |   uint8_t seq_parameter_set_id
         5 |   uint8_t pic_parameter_set_id
         6 |   uint8_t num_ref_idx_l0_default_active_minus1
         7 |   uint8_t num_ref_idx_l1_default_active_minus1
         8 |   StdVideoH264WeightedBipredIdc weighted_bipred_idc
        12 |   int8_t pic_init_qp_minus26
        13 |   int8_t pic_init_qs_minus26
        14 |   int8_t chroma_qp_index_offset
        15 |   int8_t second_chroma_qp_index_offset
        16 |   const StdVideoH264ScalingLists * pScalingLists
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH264WeightTableFlags
         0 |   uint32_t luma_weight_l0_flag
         4 |   uint32_t chroma_weight_l0_flag
         8 |   uint32_t luma_weight_l1_flag
        12 |   uint32_t chroma_weight_l1_flag
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH264WeightTable
         0 |   struct StdVideoEncodeH264WeightTableFlags flags
         0 |     uint32_t luma_weight_l0_flag
         4 |     uint32_t chroma_weight_l0_flag
         8 |     uint32_t luma_weight_l1_flag
        12 |     uint32_t chroma_weight_l1_flag
        16 |   uint8_t luma_log2_weight_denom
        17 |   uint8_t chroma_log2_weight_denom
        18 |   int8_t[32] luma_weight_l0
        50 |   int8_t[32] luma_offset_l0
        82 |   int8_t[32][2] chroma_weight_l0
       146 |   int8_t[32][2] chroma_offset_l0
       210 |   int8_t[32] luma_weight_l1
       242 |   int8_t[32] luma_offset_l1
       274 |   int8_t[32][2] chroma_weight_l1
       338 |   int8_t[32][2] chroma_offset_l1
           | [sizeof=404, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH264SliceHeaderFlags
     0:0-0 |   uint32_t direct_spatial_mv_pred_flag
     0:1-1 |   uint32_t num_ref_idx_active_override_flag
    0:2-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH264PictureInfoFlags
     0:0-0 |   uint32_t IdrPicFlag
     0:1-1 |   uint32_t is_reference
     0:2-2 |   uint32_t no_output_of_prior_pics_flag
     0:3-3 |   uint32_t long_term_reference_flag
     0:4-4 |   uint32_t adaptive_ref_pic_marking_mode_flag
    0:5-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH264ReferenceInfoFlags
     0:0-0 |   uint32_t used_for_long_term_reference
    0:1-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH264ReferenceListsInfoFlags
     0:0-0 |   uint32_t ref_pic_list_modification_flag_l0
     0:1-1 |   uint32_t ref_pic_list_modification_flag_l1
    0:2-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH264RefListModEntry
         0 |   StdVideoH264ModificationOfPicNumsIdc modification_of_pic_nums_idc
         4 |   uint16_t abs_diff_pic_num_minus1
         6 |   uint16_t long_term_pic_num
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH264RefPicMarkingEntry
         0 |   StdVideoH264MemMgmtControlOp memory_management_control_operation
         4 |   uint16_t difference_of_pic_nums_minus1
         6 |   uint16_t long_term_pic_num
         8 |   uint16_t long_term_frame_idx
        10 |   uint16_t max_long_term_frame_idx_plus1
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH264ReferenceListsInfo
         0 |   struct StdVideoEncodeH264ReferenceListsInfoFlags flags
     0:0-0 |     uint32_t ref_pic_list_modification_flag_l0
     0:1-1 |     uint32_t ref_pic_list_modification_flag_l1
    0:2-31 |     uint32_t reserved
         4 |   uint8_t num_ref_idx_l0_active_minus1
         5 |   uint8_t num_ref_idx_l1_active_minus1
         6 |   uint8_t[32] RefPicList0
        38 |   uint8_t[32] RefPicList1
        70 |   uint8_t refList0ModOpCount
        71 |   uint8_t refList1ModOpCount
        72 |   uint8_t refPicMarkingOpCount
        73 |   uint8_t[7] reserved1
        80 |   const StdVideoEncodeH264RefListModEntry * pRefList0ModOperations
        88 |   const StdVideoEncodeH264RefListModEntry * pRefList1ModOperations
        96 |   const StdVideoEncodeH264RefPicMarkingEntry * pRefPicMarkingOperations
           | [sizeof=104, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH264PictureInfo
         0 |   struct StdVideoEncodeH264PictureInfoFlags flags
     0:0-0 |     uint32_t IdrPicFlag
     0:1-1 |     uint32_t is_reference
     0:2-2 |     uint32_t no_output_of_prior_pics_flag
     0:3-3 |     uint32_t long_term_reference_flag
     0:4-4 |     uint32_t adaptive_ref_pic_marking_mode_flag
    0:5-31 |     uint32_t reserved
         4 |   uint8_t seq_parameter_set_id
         5 |   uint8_t pic_parameter_set_id
         6 |   uint16_t idr_pic_id
         8 |   StdVideoH264PictureType primary_pic_type
        12 |   uint32_t frame_num
        16 |   int32_t PicOrderCnt
        20 |   uint8_t temporal_id
        21 |   uint8_t[3] reserved1
        24 |   const StdVideoEncodeH264ReferenceListsInfo * pRefLists
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH264ReferenceInfo
         0 |   struct StdVideoEncodeH264ReferenceInfoFlags flags
     0:0-0 |     uint32_t used_for_long_term_reference
    0:1-31 |     uint32_t reserved
         4 |   StdVideoH264PictureType primary_pic_type
         8 |   uint32_t FrameNum
        12 |   int32_t PicOrderCnt
        16 |   uint16_t long_term_pic_num
        18 |   uint16_t long_term_frame_idx
        20 |   uint8_t temporal_id
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH264SliceHeader
         0 |   struct StdVideoEncodeH264SliceHeaderFlags flags
     0:0-0 |     uint32_t direct_spatial_mv_pred_flag
     0:1-1 |     uint32_t num_ref_idx_active_override_flag
    0:2-31 |     uint32_t reserved
         4 |   uint32_t first_mb_in_slice
         8 |   StdVideoH264SliceType slice_type
        12 |   int8_t slice_alpha_c0_offset_div2
        13 |   int8_t slice_beta_offset_div2
        14 |   int8_t slice_qp_delta
        15 |   uint8_t reserved1
        16 |   StdVideoH264CabacInitIdc cabac_init_idc
        20 |   StdVideoH264DisableDeblockingFilterIdc disable_deblocking_filter_idc
        24 |   const StdVideoEncodeH264WeightTable * pWeightTable
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264CapabilitiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkVideoEncodeH264CapabilityFlagsKHR flags
        20 |   StdVideoH264LevelIdc maxLevelIdc
        24 |   uint32_t maxSliceCount
        28 |   uint32_t maxPPictureL0ReferenceCount
        32 |   uint32_t maxBPictureL0ReferenceCount
        36 |   uint32_t maxL1ReferenceCount
        40 |   uint32_t maxTemporalLayerCount
        44 |   VkBool32 expectDyadicTemporalLayerPattern
        48 |   int32_t minQp
        52 |   int32_t maxQp
        56 |   VkBool32 prefersGopRemainingFrames
        60 |   VkBool32 requiresGopRemainingFrames
        64 |   VkVideoEncodeH264StdFlagsKHR stdSyntaxFlags
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264QpKHR
         0 |   int32_t qpI
         4 |   int32_t qpP
         8 |   int32_t qpB
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264QualityLevelPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkVideoEncodeH264RateControlFlagsKHR preferredRateControlFlags
        20 |   uint32_t preferredGopFrameCount
        24 |   uint32_t preferredIdrPeriod
        28 |   uint32_t preferredConsecutiveBFrameCount
        32 |   uint32_t preferredTemporalLayerCount
        36 |   struct VkVideoEncodeH264QpKHR preferredConstantQp
        36 |     int32_t qpI
        40 |     int32_t qpP
        44 |     int32_t qpB
        48 |   uint32_t preferredMaxL0ReferenceCount
        52 |   uint32_t preferredMaxL1ReferenceCount
        56 |   VkBool32 preferredStdEntropyCodingModeFlag
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264SessionCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBool32 useMaxLevelIdc
        20 |   StdVideoH264LevelIdc maxLevelIdc
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264SessionParametersAddInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t stdSPSCount
        24 |   const StdVideoH264SequenceParameterSet * pStdSPSs
        32 |   uint32_t stdPPSCount
        40 |   const StdVideoH264PictureParameterSet * pStdPPSs
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264SessionParametersCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t maxStdSPSCount
        20 |   uint32_t maxStdPPSCount
        24 |   const VkVideoEncodeH264SessionParametersAddInfoKHR * pParametersAddInfo
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264SessionParametersGetInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBool32 writeStdSPS
        20 |   VkBool32 writeStdPPS
        24 |   uint32_t stdSPSId
        28 |   uint32_t stdPPSId
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264SessionParametersFeedbackInfoKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 hasStdSPSOverrides
        20 |   VkBool32 hasStdPPSOverrides
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264NaluSliceInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   int32_t constantQp
        24 |   const StdVideoEncodeH264SliceHeader * pStdSliceHeader
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264PictureInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t naluSliceEntryCount
        24 |   const VkVideoEncodeH264NaluSliceInfoKHR * pNaluSliceEntries
        32 |   const StdVideoEncodeH264PictureInfo * pStdPictureInfo
        40 |   VkBool32 generatePrefixNalu
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264DpbSlotInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const StdVideoEncodeH264ReferenceInfo * pStdReferenceInfo
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264ProfileInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   StdVideoH264ProfileIdc stdProfileIdc
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264RateControlInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoEncodeH264RateControlFlagsKHR flags
        20 |   uint32_t gopFrameCount
        24 |   uint32_t idrPeriod
        28 |   uint32_t consecutiveBFrameCount
        32 |   uint32_t temporalLayerCount
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264FrameSizeKHR
         0 |   uint32_t frameISize
         4 |   uint32_t framePSize
         8 |   uint32_t frameBSize
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264RateControlLayerInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBool32 useMinQp
        20 |   struct VkVideoEncodeH264QpKHR minQp
        20 |     int32_t qpI
        24 |     int32_t qpP
        28 |     int32_t qpB
        32 |   VkBool32 useMaxQp
        36 |   struct VkVideoEncodeH264QpKHR maxQp
        36 |     int32_t qpI
        40 |     int32_t qpP
        44 |     int32_t qpB
        48 |   VkBool32 useMaxFrameSize
        52 |   struct VkVideoEncodeH264FrameSizeKHR maxFrameSize
        52 |     uint32_t frameISize
        56 |     uint32_t framePSize
        60 |     uint32_t frameBSize
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH264GopRemainingFrameInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBool32 useGopRemainingFrames
        20 |   uint32_t gopRemainingI
        24 |   uint32_t gopRemainingP
        28 |   uint32_t gopRemainingB
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoH265DecPicBufMgr
         0 |   uint32_t[7] max_latency_increase_plus1
        28 |   uint8_t[7] max_dec_pic_buffering_minus1
        35 |   uint8_t[7] max_num_reorder_pics
           | [sizeof=44, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH265SubLayerHrdParameters
         0 |   uint32_t[32] bit_rate_value_minus1
       128 |   uint32_t[32] cpb_size_value_minus1
       256 |   uint32_t[32] cpb_size_du_value_minus1
       384 |   uint32_t[32] bit_rate_du_value_minus1
       512 |   uint32_t cbr_flag
           | [sizeof=516, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH265HrdFlags
     0:0-0 |   uint32_t nal_hrd_parameters_present_flag
     0:1-1 |   uint32_t vcl_hrd_parameters_present_flag
     0:2-2 |   uint32_t sub_pic_hrd_params_present_flag
     0:3-3 |   uint32_t sub_pic_cpb_params_in_pic_timing_sei_flag
    0:4-11 |   uint32_t fixed_pic_rate_general_flag
    1:4-11 |   uint32_t fixed_pic_rate_within_cvs_flag
    2:4-11 |   uint32_t low_delay_hrd_flag
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH265HrdParameters
         0 |   struct StdVideoH265HrdFlags flags
     0:0-0 |     uint32_t nal_hrd_parameters_present_flag
     0:1-1 |     uint32_t vcl_hrd_parameters_present_flag
     0:2-2 |     uint32_t sub_pic_hrd_params_present_flag
     0:3-3 |     uint32_t sub_pic_cpb_params_in_pic_timing_sei_flag
    0:4-11 |     uint32_t fixed_pic_rate_general_flag
    1:4-11 |     uint32_t fixed_pic_rate_within_cvs_flag
    2:4-11 |     uint32_t low_delay_hrd_flag
         4 |   uint8_t tick_divisor_minus2
         5 |   uint8_t du_cpb_removal_delay_increment_length_minus1
         6 |   uint8_t dpb_output_delay_du_length_minus1
         7 |   uint8_t bit_rate_scale
         8 |   uint8_t cpb_size_scale
         9 |   uint8_t cpb_size_du_scale
        10 |   uint8_t initial_cpb_removal_delay_length_minus1
        11 |   uint8_t au_cpb_removal_delay_length_minus1
        12 |   uint8_t dpb_output_delay_length_minus1
        13 |   uint8_t[7] cpb_cnt_minus1
        20 |   uint16_t[7] elemental_duration_in_tc_minus1
        34 |   uint16_t[3] reserved
        40 |   const StdVideoH265SubLayerHrdParameters * pSubLayerHrdParametersNal
        48 |   const StdVideoH265SubLayerHrdParameters * pSubLayerHrdParametersVcl
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoH265VpsFlags
     0:0-0 |   uint32_t vps_temporal_id_nesting_flag
     0:1-1 |   uint32_t vps_sub_layer_ordering_info_present_flag
     0:2-2 |   uint32_t vps_timing_info_present_flag
     0:3-3 |   uint32_t vps_poc_proportional_to_timing_flag
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH265ProfileTierLevelFlags
     0:0-0 |   uint32_t general_tier_flag
     0:1-1 |   uint32_t general_progressive_source_flag
     0:2-2 |   uint32_t general_interlaced_source_flag
     0:3-3 |   uint32_t general_non_packed_constraint_flag
     0:4-4 |   uint32_t general_frame_only_constraint_flag
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH265ProfileTierLevel
         0 |   struct StdVideoH265ProfileTierLevelFlags flags
     0:0-0 |     uint32_t general_tier_flag
     0:1-1 |     uint32_t general_progressive_source_flag
     0:2-2 |     uint32_t general_interlaced_source_flag
     0:3-3 |     uint32_t general_non_packed_constraint_flag
     0:4-4 |     uint32_t general_frame_only_constraint_flag
         4 |   StdVideoH265ProfileIdc general_profile_idc
         8 |   StdVideoH265LevelIdc general_level_idc
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH265VideoParameterSet
         0 |   struct StdVideoH265VpsFlags flags
     0:0-0 |     uint32_t vps_temporal_id_nesting_flag
     0:1-1 |     uint32_t vps_sub_layer_ordering_info_present_flag
     0:2-2 |     uint32_t vps_timing_info_present_flag
     0:3-3 |     uint32_t vps_poc_proportional_to_timing_flag
         4 |   uint8_t vps_video_parameter_set_id
         5 |   uint8_t vps_max_sub_layers_minus1
         6 |   uint8_t reserved1
         7 |   uint8_t reserved2
         8 |   uint32_t vps_num_units_in_tick
        12 |   uint32_t vps_time_scale
        16 |   uint32_t vps_num_ticks_poc_diff_one_minus1
        20 |   uint32_t reserved3
        24 |   const StdVideoH265DecPicBufMgr * pDecPicBufMgr
        32 |   const StdVideoH265HrdParameters * pHrdParameters
        40 |   const StdVideoH265ProfileTierLevel * pProfileTierLevel
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoH265ScalingLists
         0 |   uint8_t[6][16] ScalingList4x4
        96 |   uint8_t[6][64] ScalingList8x8
       480 |   uint8_t[6][64] ScalingList16x16
       864 |   uint8_t[2][64] ScalingList32x32
       992 |   uint8_t[6] ScalingListDCCoef16x16
       998 |   uint8_t[2] ScalingListDCCoef32x32
           | [sizeof=1000, align=1]

*** Dumping AST Record Layout
         0 | struct StdVideoH265SpsVuiFlags
     0:0-0 |   uint32_t aspect_ratio_info_present_flag
     0:1-1 |   uint32_t overscan_info_present_flag
     0:2-2 |   uint32_t overscan_appropriate_flag
     0:3-3 |   uint32_t video_signal_type_present_flag
     0:4-4 |   uint32_t video_full_range_flag
     0:5-5 |   uint32_t colour_description_present_flag
     0:6-6 |   uint32_t chroma_loc_info_present_flag
     0:7-7 |   uint32_t neutral_chroma_indication_flag
     1:0-0 |   uint32_t field_seq_flag
     1:1-1 |   uint32_t frame_field_info_present_flag
     1:2-2 |   uint32_t default_display_window_flag
     1:3-3 |   uint32_t vui_timing_info_present_flag
     1:4-4 |   uint32_t vui_poc_proportional_to_timing_flag
     1:5-5 |   uint32_t vui_hrd_parameters_present_flag
     1:6-6 |   uint32_t bitstream_restriction_flag
     1:7-7 |   uint32_t tiles_fixed_structure_flag
     2:0-0 |   uint32_t motion_vectors_over_pic_boundaries_flag
     2:1-1 |   uint32_t restricted_ref_pic_lists_flag
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH265SequenceParameterSetVui
         0 |   struct StdVideoH265SpsVuiFlags flags
     0:0-0 |     uint32_t aspect_ratio_info_present_flag
     0:1-1 |     uint32_t overscan_info_present_flag
     0:2-2 |     uint32_t overscan_appropriate_flag
     0:3-3 |     uint32_t video_signal_type_present_flag
     0:4-4 |     uint32_t video_full_range_flag
     0:5-5 |     uint32_t colour_description_present_flag
     0:6-6 |     uint32_t chroma_loc_info_present_flag
     0:7-7 |     uint32_t neutral_chroma_indication_flag
     1:0-0 |     uint32_t field_seq_flag
     1:1-1 |     uint32_t frame_field_info_present_flag
     1:2-2 |     uint32_t default_display_window_flag
     1:3-3 |     uint32_t vui_timing_info_present_flag
     1:4-4 |     uint32_t vui_poc_proportional_to_timing_flag
     1:5-5 |     uint32_t vui_hrd_parameters_present_flag
     1:6-6 |     uint32_t bitstream_restriction_flag
     1:7-7 |     uint32_t tiles_fixed_structure_flag
     2:0-0 |     uint32_t motion_vectors_over_pic_boundaries_flag
     2:1-1 |     uint32_t restricted_ref_pic_lists_flag
         4 |   StdVideoH265AspectRatioIdc aspect_ratio_idc
         8 |   uint16_t sar_width
        10 |   uint16_t sar_height
        12 |   uint8_t video_format
        13 |   uint8_t colour_primaries
        14 |   uint8_t transfer_characteristics
        15 |   uint8_t matrix_coeffs
        16 |   uint8_t chroma_sample_loc_type_top_field
        17 |   uint8_t chroma_sample_loc_type_bottom_field
        18 |   uint8_t reserved1
        19 |   uint8_t reserved2
        20 |   uint16_t def_disp_win_left_offset
        22 |   uint16_t def_disp_win_right_offset
        24 |   uint16_t def_disp_win_top_offset
        26 |   uint16_t def_disp_win_bottom_offset
        28 |   uint32_t vui_num_units_in_tick
        32 |   uint32_t vui_time_scale
        36 |   uint32_t vui_num_ticks_poc_diff_one_minus1
        40 |   uint16_t min_spatial_segmentation_idc
        42 |   uint16_t reserved3
        44 |   uint8_t max_bytes_per_pic_denom
        45 |   uint8_t max_bits_per_min_cu_denom
        46 |   uint8_t log2_max_mv_length_horizontal
        47 |   uint8_t log2_max_mv_length_vertical
        48 |   const StdVideoH265HrdParameters * pHrdParameters
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoH265PredictorPaletteEntries
         0 |   uint16_t[3][128] PredictorPaletteEntries
           | [sizeof=768, align=2]

*** Dumping AST Record Layout
         0 | struct StdVideoH265SpsFlags
     0:0-0 |   uint32_t sps_temporal_id_nesting_flag
     0:1-1 |   uint32_t separate_colour_plane_flag
     0:2-2 |   uint32_t conformance_window_flag
     0:3-3 |   uint32_t sps_sub_layer_ordering_info_present_flag
     0:4-4 |   uint32_t scaling_list_enabled_flag
     0:5-5 |   uint32_t sps_scaling_list_data_present_flag
     0:6-6 |   uint32_t amp_enabled_flag
     0:7-7 |   uint32_t sample_adaptive_offset_enabled_flag
     1:0-0 |   uint32_t pcm_enabled_flag
     1:1-1 |   uint32_t pcm_loop_filter_disabled_flag
     1:2-2 |   uint32_t long_term_ref_pics_present_flag
     1:3-3 |   uint32_t sps_temporal_mvp_enabled_flag
     1:4-4 |   uint32_t strong_intra_smoothing_enabled_flag
     1:5-5 |   uint32_t vui_parameters_present_flag
     1:6-6 |   uint32_t sps_extension_present_flag
     1:7-7 |   uint32_t sps_range_extension_flag
     2:0-0 |   uint32_t transform_skip_rotation_enabled_flag
     2:1-1 |   uint32_t transform_skip_context_enabled_flag
     2:2-2 |   uint32_t implicit_rdpcm_enabled_flag
     2:3-3 |   uint32_t explicit_rdpcm_enabled_flag
     2:4-4 |   uint32_t extended_precision_processing_flag
     2:5-5 |   uint32_t intra_smoothing_disabled_flag
     2:6-6 |   uint32_t high_precision_offsets_enabled_flag
     2:7-7 |   uint32_t persistent_rice_adaptation_enabled_flag
     3:0-0 |   uint32_t cabac_bypass_alignment_enabled_flag
     3:1-1 |   uint32_t sps_scc_extension_flag
     3:2-2 |   uint32_t sps_curr_pic_ref_enabled_flag
     3:3-3 |   uint32_t palette_mode_enabled_flag
     3:4-4 |   uint32_t sps_palette_predictor_initializers_present_flag
     3:5-5 |   uint32_t intra_boundary_filtering_disabled_flag
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH265ShortTermRefPicSetFlags
     0:0-0 |   uint32_t inter_ref_pic_set_prediction_flag
     0:1-1 |   uint32_t delta_rps_sign
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH265ShortTermRefPicSet
         0 |   struct StdVideoH265ShortTermRefPicSetFlags flags
     0:0-0 |     uint32_t inter_ref_pic_set_prediction_flag
     0:1-1 |     uint32_t delta_rps_sign
         4 |   uint32_t delta_idx_minus1
         8 |   uint16_t use_delta_flag
        10 |   uint16_t abs_delta_rps_minus1
        12 |   uint16_t used_by_curr_pic_flag
        14 |   uint16_t used_by_curr_pic_s0_flag
        16 |   uint16_t used_by_curr_pic_s1_flag
        18 |   uint16_t reserved1
        20 |   uint8_t reserved2
        21 |   uint8_t reserved3
        22 |   uint8_t num_negative_pics
        23 |   uint8_t num_positive_pics
        24 |   uint16_t[16] delta_poc_s0_minus1
        56 |   uint16_t[16] delta_poc_s1_minus1
           | [sizeof=88, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH265LongTermRefPicsSps
         0 |   uint32_t used_by_curr_pic_lt_sps_flag
         4 |   uint32_t[32] lt_ref_pic_poc_lsb_sps
           | [sizeof=132, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH265SequenceParameterSet
         0 |   struct StdVideoH265SpsFlags flags
     0:0-0 |     uint32_t sps_temporal_id_nesting_flag
     0:1-1 |     uint32_t separate_colour_plane_flag
     0:2-2 |     uint32_t conformance_window_flag
     0:3-3 |     uint32_t sps_sub_layer_ordering_info_present_flag
     0:4-4 |     uint32_t scaling_list_enabled_flag
     0:5-5 |     uint32_t sps_scaling_list_data_present_flag
     0:6-6 |     uint32_t amp_enabled_flag
     0:7-7 |     uint32_t sample_adaptive_offset_enabled_flag
     1:0-0 |     uint32_t pcm_enabled_flag
     1:1-1 |     uint32_t pcm_loop_filter_disabled_flag
     1:2-2 |     uint32_t long_term_ref_pics_present_flag
     1:3-3 |     uint32_t sps_temporal_mvp_enabled_flag
     1:4-4 |     uint32_t strong_intra_smoothing_enabled_flag
     1:5-5 |     uint32_t vui_parameters_present_flag
     1:6-6 |     uint32_t sps_extension_present_flag
     1:7-7 |     uint32_t sps_range_extension_flag
     2:0-0 |     uint32_t transform_skip_rotation_enabled_flag
     2:1-1 |     uint32_t transform_skip_context_enabled_flag
     2:2-2 |     uint32_t implicit_rdpcm_enabled_flag
     2:3-3 |     uint32_t explicit_rdpcm_enabled_flag
     2:4-4 |     uint32_t extended_precision_processing_flag
     2:5-5 |     uint32_t intra_smoothing_disabled_flag
     2:6-6 |     uint32_t high_precision_offsets_enabled_flag
     2:7-7 |     uint32_t persistent_rice_adaptation_enabled_flag
     3:0-0 |     uint32_t cabac_bypass_alignment_enabled_flag
     3:1-1 |     uint32_t sps_scc_extension_flag
     3:2-2 |     uint32_t sps_curr_pic_ref_enabled_flag
     3:3-3 |     uint32_t palette_mode_enabled_flag
     3:4-4 |     uint32_t sps_palette_predictor_initializers_present_flag
     3:5-5 |     uint32_t intra_boundary_filtering_disabled_flag
         4 |   StdVideoH265ChromaFormatIdc chroma_format_idc
         8 |   uint32_t pic_width_in_luma_samples
        12 |   uint32_t pic_height_in_luma_samples
        16 |   uint8_t sps_video_parameter_set_id
        17 |   uint8_t sps_max_sub_layers_minus1
        18 |   uint8_t sps_seq_parameter_set_id
        19 |   uint8_t bit_depth_luma_minus8
        20 |   uint8_t bit_depth_chroma_minus8
        21 |   uint8_t log2_max_pic_order_cnt_lsb_minus4
        22 |   uint8_t log2_min_luma_coding_block_size_minus3
        23 |   uint8_t log2_diff_max_min_luma_coding_block_size
        24 |   uint8_t log2_min_luma_transform_block_size_minus2
        25 |   uint8_t log2_diff_max_min_luma_transform_block_size
        26 |   uint8_t max_transform_hierarchy_depth_inter
        27 |   uint8_t max_transform_hierarchy_depth_intra
        28 |   uint8_t num_short_term_ref_pic_sets
        29 |   uint8_t num_long_term_ref_pics_sps
        30 |   uint8_t pcm_sample_bit_depth_luma_minus1
        31 |   uint8_t pcm_sample_bit_depth_chroma_minus1
        32 |   uint8_t log2_min_pcm_luma_coding_block_size_minus3
        33 |   uint8_t log2_diff_max_min_pcm_luma_coding_block_size
        34 |   uint8_t reserved1
        35 |   uint8_t reserved2
        36 |   uint8_t palette_max_size
        37 |   uint8_t delta_palette_max_predictor_size
        38 |   uint8_t motion_vector_resolution_control_idc
        39 |   uint8_t sps_num_palette_predictor_initializers_minus1
        40 |   uint32_t conf_win_left_offset
        44 |   uint32_t conf_win_right_offset
        48 |   uint32_t conf_win_top_offset
        52 |   uint32_t conf_win_bottom_offset
        56 |   const StdVideoH265ProfileTierLevel * pProfileTierLevel
        64 |   const StdVideoH265DecPicBufMgr * pDecPicBufMgr
        72 |   const StdVideoH265ScalingLists * pScalingLists
        80 |   const StdVideoH265ShortTermRefPicSet * pShortTermRefPicSet
        88 |   const StdVideoH265LongTermRefPicsSps * pLongTermRefPicsSps
        96 |   const StdVideoH265SequenceParameterSetVui * pSequenceParameterSetVui
       104 |   const StdVideoH265PredictorPaletteEntries * pPredictorPaletteEntries
           | [sizeof=112, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoH265PpsFlags
     0:0-0 |   uint32_t dependent_slice_segments_enabled_flag
     0:1-1 |   uint32_t output_flag_present_flag
     0:2-2 |   uint32_t sign_data_hiding_enabled_flag
     0:3-3 |   uint32_t cabac_init_present_flag
     0:4-4 |   uint32_t constrained_intra_pred_flag
     0:5-5 |   uint32_t transform_skip_enabled_flag
     0:6-6 |   uint32_t cu_qp_delta_enabled_flag
     0:7-7 |   uint32_t pps_slice_chroma_qp_offsets_present_flag
     1:0-0 |   uint32_t weighted_pred_flag
     1:1-1 |   uint32_t weighted_bipred_flag
     1:2-2 |   uint32_t transquant_bypass_enabled_flag
     1:3-3 |   uint32_t tiles_enabled_flag
     1:4-4 |   uint32_t entropy_coding_sync_enabled_flag
     1:5-5 |   uint32_t uniform_spacing_flag
     1:6-6 |   uint32_t loop_filter_across_tiles_enabled_flag
     1:7-7 |   uint32_t pps_loop_filter_across_slices_enabled_flag
     2:0-0 |   uint32_t deblocking_filter_control_present_flag
     2:1-1 |   uint32_t deblocking_filter_override_enabled_flag
     2:2-2 |   uint32_t pps_deblocking_filter_disabled_flag
     2:3-3 |   uint32_t pps_scaling_list_data_present_flag
     2:4-4 |   uint32_t lists_modification_present_flag
     2:5-5 |   uint32_t slice_segment_header_extension_present_flag
     2:6-6 |   uint32_t pps_extension_present_flag
     2:7-7 |   uint32_t cross_component_prediction_enabled_flag
     3:0-0 |   uint32_t chroma_qp_offset_list_enabled_flag
     3:1-1 |   uint32_t pps_curr_pic_ref_enabled_flag
     3:2-2 |   uint32_t residual_adaptive_colour_transform_enabled_flag
     3:3-3 |   uint32_t pps_slice_act_qp_offsets_present_flag
     3:4-4 |   uint32_t pps_palette_predictor_initializers_present_flag
     3:5-5 |   uint32_t monochrome_palette_flag
     3:6-6 |   uint32_t pps_range_extension_flag
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoH265PictureParameterSet
         0 |   struct StdVideoH265PpsFlags flags
     0:0-0 |     uint32_t dependent_slice_segments_enabled_flag
     0:1-1 |     uint32_t output_flag_present_flag
     0:2-2 |     uint32_t sign_data_hiding_enabled_flag
     0:3-3 |     uint32_t cabac_init_present_flag
     0:4-4 |     uint32_t constrained_intra_pred_flag
     0:5-5 |     uint32_t transform_skip_enabled_flag
     0:6-6 |     uint32_t cu_qp_delta_enabled_flag
     0:7-7 |     uint32_t pps_slice_chroma_qp_offsets_present_flag
     1:0-0 |     uint32_t weighted_pred_flag
     1:1-1 |     uint32_t weighted_bipred_flag
     1:2-2 |     uint32_t transquant_bypass_enabled_flag
     1:3-3 |     uint32_t tiles_enabled_flag
     1:4-4 |     uint32_t entropy_coding_sync_enabled_flag
     1:5-5 |     uint32_t uniform_spacing_flag
     1:6-6 |     uint32_t loop_filter_across_tiles_enabled_flag
     1:7-7 |     uint32_t pps_loop_filter_across_slices_enabled_flag
     2:0-0 |     uint32_t deblocking_filter_control_present_flag
     2:1-1 |     uint32_t deblocking_filter_override_enabled_flag
     2:2-2 |     uint32_t pps_deblocking_filter_disabled_flag
     2:3-3 |     uint32_t pps_scaling_list_data_present_flag
     2:4-4 |     uint32_t lists_modification_present_flag
     2:5-5 |     uint32_t slice_segment_header_extension_present_flag
     2:6-6 |     uint32_t pps_extension_present_flag
     2:7-7 |     uint32_t cross_component_prediction_enabled_flag
     3:0-0 |     uint32_t chroma_qp_offset_list_enabled_flag
     3:1-1 |     uint32_t pps_curr_pic_ref_enabled_flag
     3:2-2 |     uint32_t residual_adaptive_colour_transform_enabled_flag
     3:3-3 |     uint32_t pps_slice_act_qp_offsets_present_flag
     3:4-4 |     uint32_t pps_palette_predictor_initializers_present_flag
     3:5-5 |     uint32_t monochrome_palette_flag
     3:6-6 |     uint32_t pps_range_extension_flag
         4 |   uint8_t pps_pic_parameter_set_id
         5 |   uint8_t pps_seq_parameter_set_id
         6 |   uint8_t sps_video_parameter_set_id
         7 |   uint8_t num_extra_slice_header_bits
         8 |   uint8_t num_ref_idx_l0_default_active_minus1
         9 |   uint8_t num_ref_idx_l1_default_active_minus1
        10 |   int8_t init_qp_minus26
        11 |   uint8_t diff_cu_qp_delta_depth
        12 |   int8_t pps_cb_qp_offset
        13 |   int8_t pps_cr_qp_offset
        14 |   int8_t pps_beta_offset_div2
        15 |   int8_t pps_tc_offset_div2
        16 |   uint8_t log2_parallel_merge_level_minus2
        17 |   uint8_t log2_max_transform_skip_block_size_minus2
        18 |   uint8_t diff_cu_chroma_qp_offset_depth
        19 |   uint8_t chroma_qp_offset_list_len_minus1
        20 |   int8_t[6] cb_qp_offset_list
        26 |   int8_t[6] cr_qp_offset_list
        32 |   uint8_t log2_sao_offset_scale_luma
        33 |   uint8_t log2_sao_offset_scale_chroma
        34 |   int8_t pps_act_y_qp_offset_plus5
        35 |   int8_t pps_act_cb_qp_offset_plus5
        36 |   int8_t pps_act_cr_qp_offset_plus3
        37 |   uint8_t pps_num_palette_predictor_initializers
        38 |   uint8_t luma_bit_depth_entry_minus8
        39 |   uint8_t chroma_bit_depth_entry_minus8
        40 |   uint8_t num_tile_columns_minus1
        41 |   uint8_t num_tile_rows_minus1
        42 |   uint8_t reserved1
        43 |   uint8_t reserved2
        44 |   uint16_t[19] column_width_minus1
        82 |   uint16_t[21] row_height_minus1
       124 |   uint32_t reserved3
       128 |   const StdVideoH265ScalingLists * pScalingLists
       136 |   const StdVideoH265PredictorPaletteEntries * pPredictorPaletteEntries
           | [sizeof=144, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH265WeightTableFlags
         0 |   uint16_t luma_weight_l0_flag
         2 |   uint16_t chroma_weight_l0_flag
         4 |   uint16_t luma_weight_l1_flag
         6 |   uint16_t chroma_weight_l1_flag
           | [sizeof=8, align=2]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH265WeightTable
         0 |   struct StdVideoEncodeH265WeightTableFlags flags
         0 |     uint16_t luma_weight_l0_flag
         2 |     uint16_t chroma_weight_l0_flag
         4 |     uint16_t luma_weight_l1_flag
         6 |     uint16_t chroma_weight_l1_flag
         8 |   uint8_t luma_log2_weight_denom
         9 |   int8_t delta_chroma_log2_weight_denom
        10 |   int8_t[15] delta_luma_weight_l0
        25 |   int8_t[15] luma_offset_l0
        40 |   int8_t[15][2] delta_chroma_weight_l0
        70 |   int8_t[15][2] delta_chroma_offset_l0
       100 |   int8_t[15] delta_luma_weight_l1
       115 |   int8_t[15] luma_offset_l1
       130 |   int8_t[15][2] delta_chroma_weight_l1
       160 |   int8_t[15][2] delta_chroma_offset_l1
           | [sizeof=190, align=2]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH265SliceSegmentHeaderFlags
     0:0-0 |   uint32_t first_slice_segment_in_pic_flag
     0:1-1 |   uint32_t dependent_slice_segment_flag
     0:2-2 |   uint32_t slice_sao_luma_flag
     0:3-3 |   uint32_t slice_sao_chroma_flag
     0:4-4 |   uint32_t num_ref_idx_active_override_flag
     0:5-5 |   uint32_t mvd_l1_zero_flag
     0:6-6 |   uint32_t cabac_init_flag
     0:7-7 |   uint32_t cu_chroma_qp_offset_enabled_flag
     1:0-0 |   uint32_t deblocking_filter_override_flag
     1:1-1 |   uint32_t slice_deblocking_filter_disabled_flag
     1:2-2 |   uint32_t collocated_from_l0_flag
     1:3-3 |   uint32_t slice_loop_filter_across_slices_enabled_flag
    1:4-23 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH265SliceSegmentHeader
         0 |   struct StdVideoEncodeH265SliceSegmentHeaderFlags flags
     0:0-0 |     uint32_t first_slice_segment_in_pic_flag
     0:1-1 |     uint32_t dependent_slice_segment_flag
     0:2-2 |     uint32_t slice_sao_luma_flag
     0:3-3 |     uint32_t slice_sao_chroma_flag
     0:4-4 |     uint32_t num_ref_idx_active_override_flag
     0:5-5 |     uint32_t mvd_l1_zero_flag
     0:6-6 |     uint32_t cabac_init_flag
     0:7-7 |     uint32_t cu_chroma_qp_offset_enabled_flag
     1:0-0 |     uint32_t deblocking_filter_override_flag
     1:1-1 |     uint32_t slice_deblocking_filter_disabled_flag
     1:2-2 |     uint32_t collocated_from_l0_flag
     1:3-3 |     uint32_t slice_loop_filter_across_slices_enabled_flag
    1:4-23 |     uint32_t reserved
         4 |   StdVideoH265SliceType slice_type
         8 |   uint32_t slice_segment_address
        12 |   uint8_t collocated_ref_idx
        13 |   uint8_t MaxNumMergeCand
        14 |   int8_t slice_cb_qp_offset
        15 |   int8_t slice_cr_qp_offset
        16 |   int8_t slice_beta_offset_div2
        17 |   int8_t slice_tc_offset_div2
        18 |   int8_t slice_act_y_qp_offset
        19 |   int8_t slice_act_cb_qp_offset
        20 |   int8_t slice_act_cr_qp_offset
        21 |   int8_t slice_qp_delta
        22 |   uint16_t reserved1
        24 |   const StdVideoEncodeH265WeightTable * pWeightTable
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH265ReferenceListsInfoFlags
     0:0-0 |   uint32_t ref_pic_list_modification_flag_l0
     0:1-1 |   uint32_t ref_pic_list_modification_flag_l1
    0:2-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH265ReferenceListsInfo
         0 |   struct StdVideoEncodeH265ReferenceListsInfoFlags flags
     0:0-0 |     uint32_t ref_pic_list_modification_flag_l0
     0:1-1 |     uint32_t ref_pic_list_modification_flag_l1
    0:2-31 |     uint32_t reserved
         4 |   uint8_t num_ref_idx_l0_active_minus1
         5 |   uint8_t num_ref_idx_l1_active_minus1
         6 |   uint8_t[15] RefPicList0
        21 |   uint8_t[15] RefPicList1
        36 |   uint8_t[15] list_entry_l0
        51 |   uint8_t[15] list_entry_l1
           | [sizeof=68, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH265PictureInfoFlags
     0:0-0 |   uint32_t is_reference
     0:1-1 |   uint32_t IrapPicFlag
     0:2-2 |   uint32_t used_for_long_term_reference
     0:3-3 |   uint32_t discardable_flag
     0:4-4 |   uint32_t cross_layer_bla_flag
     0:5-5 |   uint32_t pic_output_flag
     0:6-6 |   uint32_t no_output_of_prior_pics_flag
     0:7-7 |   uint32_t short_term_ref_pic_set_sps_flag
     1:0-0 |   uint32_t slice_temporal_mvp_enabled_flag
    1:1-23 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH265LongTermRefPics
         0 |   uint8_t num_long_term_sps
         1 |   uint8_t num_long_term_pics
         2 |   uint8_t[32] lt_idx_sps
        34 |   uint8_t[16] poc_lsb_lt
        50 |   uint16_t used_by_curr_pic_lt_flag
        52 |   uint8_t[48] delta_poc_msb_present_flag
       100 |   uint8_t[48] delta_poc_msb_cycle_lt
           | [sizeof=148, align=2]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH265PictureInfo
         0 |   struct StdVideoEncodeH265PictureInfoFlags flags
     0:0-0 |     uint32_t is_reference
     0:1-1 |     uint32_t IrapPicFlag
     0:2-2 |     uint32_t used_for_long_term_reference
     0:3-3 |     uint32_t discardable_flag
     0:4-4 |     uint32_t cross_layer_bla_flag
     0:5-5 |     uint32_t pic_output_flag
     0:6-6 |     uint32_t no_output_of_prior_pics_flag
     0:7-7 |     uint32_t short_term_ref_pic_set_sps_flag
     1:0-0 |     uint32_t slice_temporal_mvp_enabled_flag
    1:1-23 |     uint32_t reserved
         4 |   StdVideoH265PictureType pic_type
         8 |   uint8_t sps_video_parameter_set_id
         9 |   uint8_t pps_seq_parameter_set_id
        10 |   uint8_t pps_pic_parameter_set_id
        11 |   uint8_t short_term_ref_pic_set_idx
        12 |   int32_t PicOrderCntVal
        16 |   uint8_t TemporalId
        17 |   uint8_t[7] reserved1
        24 |   const StdVideoEncodeH265ReferenceListsInfo * pRefLists
        32 |   const StdVideoH265ShortTermRefPicSet * pShortTermRefPicSet
        40 |   const StdVideoEncodeH265LongTermRefPics * pLongTermRefPics
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH265ReferenceInfoFlags
     0:0-0 |   uint32_t used_for_long_term_reference
     0:1-1 |   uint32_t unused_for_reference
    0:2-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeH265ReferenceInfo
         0 |   struct StdVideoEncodeH265ReferenceInfoFlags flags
     0:0-0 |     uint32_t used_for_long_term_reference
     0:1-1 |     uint32_t unused_for_reference
    0:2-31 |     uint32_t reserved
         4 |   StdVideoH265PictureType pic_type
         8 |   int32_t PicOrderCntVal
        12 |   uint8_t TemporalId
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265CapabilitiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkVideoEncodeH265CapabilityFlagsKHR flags
        20 |   StdVideoH265LevelIdc maxLevelIdc
        24 |   uint32_t maxSliceSegmentCount
        28 |   struct VkExtent2D maxTiles
        28 |     uint32_t width
        32 |     uint32_t height
        36 |   VkVideoEncodeH265CtbSizeFlagsKHR ctbSizes
        40 |   VkVideoEncodeH265TransformBlockSizeFlagsKHR transformBlockSizes
        44 |   uint32_t maxPPictureL0ReferenceCount
        48 |   uint32_t maxBPictureL0ReferenceCount
        52 |   uint32_t maxL1ReferenceCount
        56 |   uint32_t maxSubLayerCount
        60 |   VkBool32 expectDyadicTemporalSubLayerPattern
        64 |   int32_t minQp
        68 |   int32_t maxQp
        72 |   VkBool32 prefersGopRemainingFrames
        76 |   VkBool32 requiresGopRemainingFrames
        80 |   VkVideoEncodeH265StdFlagsKHR stdSyntaxFlags
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265SessionCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBool32 useMaxLevelIdc
        20 |   StdVideoH265LevelIdc maxLevelIdc
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265QpKHR
         0 |   int32_t qpI
         4 |   int32_t qpP
         8 |   int32_t qpB
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265QualityLevelPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkVideoEncodeH265RateControlFlagsKHR preferredRateControlFlags
        20 |   uint32_t preferredGopFrameCount
        24 |   uint32_t preferredIdrPeriod
        28 |   uint32_t preferredConsecutiveBFrameCount
        32 |   uint32_t preferredSubLayerCount
        36 |   struct VkVideoEncodeH265QpKHR preferredConstantQp
        36 |     int32_t qpI
        40 |     int32_t qpP
        44 |     int32_t qpB
        48 |   uint32_t preferredMaxL0ReferenceCount
        52 |   uint32_t preferredMaxL1ReferenceCount
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265SessionParametersAddInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t stdVPSCount
        24 |   const StdVideoH265VideoParameterSet * pStdVPSs
        32 |   uint32_t stdSPSCount
        40 |   const StdVideoH265SequenceParameterSet * pStdSPSs
        48 |   uint32_t stdPPSCount
        56 |   const StdVideoH265PictureParameterSet * pStdPPSs
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265SessionParametersCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t maxStdVPSCount
        20 |   uint32_t maxStdSPSCount
        24 |   uint32_t maxStdPPSCount
        32 |   const VkVideoEncodeH265SessionParametersAddInfoKHR * pParametersAddInfo
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265SessionParametersGetInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBool32 writeStdVPS
        20 |   VkBool32 writeStdSPS
        24 |   VkBool32 writeStdPPS
        28 |   uint32_t stdVPSId
        32 |   uint32_t stdSPSId
        36 |   uint32_t stdPPSId
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265SessionParametersFeedbackInfoKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 hasStdVPSOverrides
        20 |   VkBool32 hasStdSPSOverrides
        24 |   VkBool32 hasStdPPSOverrides
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265NaluSliceSegmentInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   int32_t constantQp
        24 |   const StdVideoEncodeH265SliceSegmentHeader * pStdSliceSegmentHeader
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265PictureInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t naluSliceSegmentEntryCount
        24 |   const VkVideoEncodeH265NaluSliceSegmentInfoKHR * pNaluSliceSegmentEntries
        32 |   const StdVideoEncodeH265PictureInfo * pStdPictureInfo
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265DpbSlotInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const StdVideoEncodeH265ReferenceInfo * pStdReferenceInfo
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265ProfileInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   StdVideoH265ProfileIdc stdProfileIdc
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265RateControlInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoEncodeH265RateControlFlagsKHR flags
        20 |   uint32_t gopFrameCount
        24 |   uint32_t idrPeriod
        28 |   uint32_t consecutiveBFrameCount
        32 |   uint32_t subLayerCount
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265FrameSizeKHR
         0 |   uint32_t frameISize
         4 |   uint32_t framePSize
         8 |   uint32_t frameBSize
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265RateControlLayerInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBool32 useMinQp
        20 |   struct VkVideoEncodeH265QpKHR minQp
        20 |     int32_t qpI
        24 |     int32_t qpP
        28 |     int32_t qpB
        32 |   VkBool32 useMaxQp
        36 |   struct VkVideoEncodeH265QpKHR maxQp
        36 |     int32_t qpI
        40 |     int32_t qpP
        44 |     int32_t qpB
        48 |   VkBool32 useMaxFrameSize
        52 |   struct VkVideoEncodeH265FrameSizeKHR maxFrameSize
        52 |     uint32_t frameISize
        56 |     uint32_t framePSize
        60 |     uint32_t frameBSize
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeH265GopRemainingFrameInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBool32 useGopRemainingFrames
        20 |   uint32_t gopRemainingI
        24 |   uint32_t gopRemainingP
        28 |   uint32_t gopRemainingB
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoDecodeH264PictureInfoFlags
     0:0-0 |   uint32_t field_pic_flag
     0:1-1 |   uint32_t is_intra
     0:2-2 |   uint32_t IdrPicFlag
     0:3-3 |   uint32_t bottom_field_flag
     0:4-4 |   uint32_t is_reference
     0:5-5 |   uint32_t complementary_field_pair
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoDecodeH264PictureInfo
         0 |   struct StdVideoDecodeH264PictureInfoFlags flags
     0:0-0 |     uint32_t field_pic_flag
     0:1-1 |     uint32_t is_intra
     0:2-2 |     uint32_t IdrPicFlag
     0:3-3 |     uint32_t bottom_field_flag
     0:4-4 |     uint32_t is_reference
     0:5-5 |     uint32_t complementary_field_pair
         4 |   uint8_t seq_parameter_set_id
         5 |   uint8_t pic_parameter_set_id
         6 |   uint8_t reserved1
         7 |   uint8_t reserved2
         8 |   uint16_t frame_num
        10 |   uint16_t idr_pic_id
        12 |   int32_t[2] PicOrderCnt
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoDecodeH264ReferenceInfoFlags
     0:0-0 |   uint32_t top_field_flag
     0:1-1 |   uint32_t bottom_field_flag
     0:2-2 |   uint32_t used_for_long_term_reference
     0:3-3 |   uint32_t is_non_existing
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoDecodeH264ReferenceInfo
         0 |   struct StdVideoDecodeH264ReferenceInfoFlags flags
     0:0-0 |     uint32_t top_field_flag
     0:1-1 |     uint32_t bottom_field_flag
     0:2-2 |     uint32_t used_for_long_term_reference
     0:3-3 |     uint32_t is_non_existing
         4 |   uint16_t FrameNum
         6 |   uint16_t reserved
         8 |   int32_t[2] PicOrderCnt
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeH264ProfileInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   StdVideoH264ProfileIdc stdProfileIdc
        20 |   VkVideoDecodeH264PictureLayoutFlagBitsKHR pictureLayout
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeH264CapabilitiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   StdVideoH264LevelIdc maxLevelIdc
        20 |   struct VkOffset2D fieldOffsetGranularity
        20 |     int32_t x
        24 |     int32_t y
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeH264SessionParametersAddInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t stdSPSCount
        24 |   const StdVideoH264SequenceParameterSet * pStdSPSs
        32 |   uint32_t stdPPSCount
        40 |   const StdVideoH264PictureParameterSet * pStdPPSs
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeH264SessionParametersCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t maxStdSPSCount
        20 |   uint32_t maxStdPPSCount
        24 |   const VkVideoDecodeH264SessionParametersAddInfoKHR * pParametersAddInfo
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeH264PictureInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const StdVideoDecodeH264PictureInfo * pStdPictureInfo
        24 |   uint32_t sliceCount
        32 |   const uint32_t * pSliceOffsets
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeH264DpbSlotInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const StdVideoDecodeH264ReferenceInfo * pStdReferenceInfo
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkImportMemoryFdInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkExternalMemoryHandleTypeFlagBits handleType
        20 |   int fd
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryFdPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t memoryTypeBits
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryGetFdInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDeviceMemory memory
        24 |   VkExternalMemoryHandleTypeFlagBits handleType
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkImportSemaphoreFdInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSemaphore semaphore
        24 |   VkSemaphoreImportFlags flags
        28 |   VkExternalSemaphoreHandleTypeFlagBits handleType
        32 |   int fd
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkSemaphoreGetFdInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSemaphore semaphore
        24 |   VkExternalSemaphoreHandleTypeFlagBits handleType
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkRectLayerKHR
         0 |   struct VkOffset2D offset
         0 |     int32_t x
         4 |     int32_t y
         8 |   struct VkExtent2D extent
         8 |     uint32_t width
        12 |     uint32_t height
        16 |   uint32_t layer
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | struct VkPresentRegionKHR
         0 |   uint32_t rectangleCount
         8 |   const VkRectLayerKHR * pRectangles
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct VkPresentRegionsKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t swapchainCount
        24 |   const VkPresentRegionKHR * pRegions
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkSharedPresentSurfaceCapabilitiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkImageUsageFlags sharedPresentSupportedUsageFlags
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkImportFenceFdInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkFence fence
        24 |   VkFenceImportFlags flags
        28 |   VkExternalFenceHandleTypeFlagBits handleType
        32 |   int fd
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkFenceGetFdInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkFence fence
        24 |   VkExternalFenceHandleTypeFlagBits handleType
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePerformanceQueryFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 performanceCounterQueryPools
        20 |   VkBool32 performanceCounterMultipleQueryPools
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePerformanceQueryPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 allowCommandBufferQueryCopies
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPerformanceCounterKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkPerformanceCounterUnitKHR unit
        20 |   VkPerformanceCounterScopeKHR scope
        24 |   VkPerformanceCounterStorageKHR storage
        28 |   uint8_t[16] uuid
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkPerformanceCounterDescriptionKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkPerformanceCounterDescriptionFlagsKHR flags
        20 |   char[256] name
       276 |   char[256] category
       532 |   char[256] description
           | [sizeof=792, align=8]

*** Dumping AST Record Layout
         0 | struct VkQueryPoolPerformanceCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t queueFamilyIndex
        20 |   uint32_t counterIndexCount
        24 |   const uint32_t * pCounterIndices
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | union VkPerformanceCounterResultKHR
         0 |   int32_t int32
         0 |   int64_t int64
         0 |   uint32_t uint32
         0 |   uint64_t uint64
         0 |   float float32
         0 |   double float64
           | [sizeof=8, align=8]

*** Dumping AST Record Layout
         0 | struct VkAcquireProfilingLockInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkAcquireProfilingLockFlagsKHR flags
        24 |   uint64_t timeout
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPerformanceQuerySubmitInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t counterPassIndex
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceSurfaceInfo2KHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSurfaceKHR surface
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSurfaceCapabilities2KHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkSurfaceCapabilitiesKHR surfaceCapabilities
        16 |     uint32_t minImageCount
        20 |     uint32_t maxImageCount
        24 |     struct VkExtent2D currentExtent
        24 |       uint32_t width
        28 |       uint32_t height
        32 |     struct VkExtent2D minImageExtent
        32 |       uint32_t width
        36 |       uint32_t height
        40 |     struct VkExtent2D maxImageExtent
        40 |       uint32_t width
        44 |       uint32_t height
        48 |     uint32_t maxImageArrayLayers
        52 |     VkSurfaceTransformFlagsKHR supportedTransforms
        56 |     VkSurfaceTransformFlagBitsKHR currentTransform
        60 |     VkCompositeAlphaFlagsKHR supportedCompositeAlpha
        64 |     VkImageUsageFlags supportedUsageFlags
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkSurfaceFormat2KHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkSurfaceFormatKHR surfaceFormat
        16 |     VkFormat format
        20 |     VkColorSpaceKHR colorSpace
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDisplayProperties2KHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkDisplayPropertiesKHR displayProperties
        16 |     VkDisplayKHR display
        24 |     const char * displayName
        32 |     struct VkExtent2D physicalDimensions
        32 |       uint32_t width
        36 |       uint32_t height
        40 |     struct VkExtent2D physicalResolution
        40 |       uint32_t width
        44 |       uint32_t height
        48 |     VkSurfaceTransformFlagsKHR supportedTransforms
        52 |     VkBool32 planeReorderPossible
        56 |     VkBool32 persistentContent
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkDisplayPlaneProperties2KHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkDisplayPlanePropertiesKHR displayPlaneProperties
        16 |     VkDisplayKHR currentDisplay
        24 |     uint32_t currentStackIndex
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkDisplayModeProperties2KHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkDisplayModePropertiesKHR displayModeProperties
        16 |     VkDisplayModeKHR displayMode
        24 |     struct VkDisplayModeParametersKHR parameters
        24 |       struct VkExtent2D visibleRegion
        24 |         uint32_t width
        28 |         uint32_t height
        32 |       uint32_t refreshRate
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkDisplayPlaneInfo2KHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkDisplayModeKHR mode
        24 |   uint32_t planeIndex
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkDisplayPlaneCapabilities2KHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkDisplayPlaneCapabilitiesKHR capabilities
        16 |     VkDisplayPlaneAlphaFlagsKHR supportedAlpha
        20 |     struct VkOffset2D minSrcPosition
        20 |       int32_t x
        24 |       int32_t y
        28 |     struct VkOffset2D maxSrcPosition
        28 |       int32_t x
        32 |       int32_t y
        36 |     struct VkExtent2D minSrcExtent
        36 |       uint32_t width
        40 |       uint32_t height
        44 |     struct VkExtent2D maxSrcExtent
        44 |       uint32_t width
        48 |       uint32_t height
        52 |     struct VkOffset2D minDstPosition
        52 |       int32_t x
        56 |       int32_t y
        60 |     struct VkOffset2D maxDstPosition
        60 |       int32_t x
        64 |       int32_t y
        68 |     struct VkExtent2D minDstExtent
        68 |       uint32_t width
        72 |       uint32_t height
        76 |     struct VkExtent2D maxDstExtent
        76 |       uint32_t width
        80 |       uint32_t height
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderBfloat16FeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderBFloat16Type
        20 |   VkBool32 shaderBFloat16DotProduct
        24 |   VkBool32 shaderBFloat16CooperativeMatrix
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderClockFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderSubgroupClock
        20 |   VkBool32 shaderDeviceClock
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoDecodeH265PictureInfoFlags
     0:0-0 |   uint32_t IrapPicFlag
     0:1-1 |   uint32_t IdrPicFlag
     0:2-2 |   uint32_t IsReference
     0:3-3 |   uint32_t short_term_ref_pic_set_sps_flag
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoDecodeH265PictureInfo
         0 |   struct StdVideoDecodeH265PictureInfoFlags flags
     0:0-0 |     uint32_t IrapPicFlag
     0:1-1 |     uint32_t IdrPicFlag
     0:2-2 |     uint32_t IsReference
     0:3-3 |     uint32_t short_term_ref_pic_set_sps_flag
         4 |   uint8_t sps_video_parameter_set_id
         5 |   uint8_t pps_seq_parameter_set_id
         6 |   uint8_t pps_pic_parameter_set_id
         7 |   uint8_t NumDeltaPocsOfRefRpsIdx
         8 |   int32_t PicOrderCntVal
        12 |   uint16_t NumBitsForSTRefPicSetInSlice
        14 |   uint16_t reserved
        16 |   uint8_t[8] RefPicSetStCurrBefore
        24 |   uint8_t[8] RefPicSetStCurrAfter
        32 |   uint8_t[8] RefPicSetLtCurr
           | [sizeof=40, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoDecodeH265ReferenceInfoFlags
     0:0-0 |   uint32_t used_for_long_term_reference
     0:1-1 |   uint32_t unused_for_reference
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoDecodeH265ReferenceInfo
         0 |   struct StdVideoDecodeH265ReferenceInfoFlags flags
     0:0-0 |     uint32_t used_for_long_term_reference
     0:1-1 |     uint32_t unused_for_reference
         4 |   int32_t PicOrderCntVal
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeH265ProfileInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   StdVideoH265ProfileIdc stdProfileIdc
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeH265CapabilitiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   StdVideoH265LevelIdc maxLevelIdc
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeH265SessionParametersAddInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t stdVPSCount
        24 |   const StdVideoH265VideoParameterSet * pStdVPSs
        32 |   uint32_t stdSPSCount
        40 |   const StdVideoH265SequenceParameterSet * pStdSPSs
        48 |   uint32_t stdPPSCount
        56 |   const StdVideoH265PictureParameterSet * pStdPPSs
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeH265SessionParametersCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t maxStdVPSCount
        20 |   uint32_t maxStdSPSCount
        24 |   uint32_t maxStdPPSCount
        32 |   const VkVideoDecodeH265SessionParametersAddInfoKHR * pParametersAddInfo
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeH265PictureInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const StdVideoDecodeH265PictureInfo * pStdPictureInfo
        24 |   uint32_t sliceSegmentCount
        32 |   const uint32_t * pSliceSegmentOffsets
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeH265DpbSlotInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const StdVideoDecodeH265ReferenceInfo * pStdReferenceInfo
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkFragmentShadingRateAttachmentInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const VkAttachmentReference2 * pFragmentShadingRateAttachment
        24 |   struct VkExtent2D shadingRateAttachmentTexelSize
        24 |     uint32_t width
        28 |     uint32_t height
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineFragmentShadingRateStateCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkExtent2D fragmentSize
        16 |     uint32_t width
        20 |     uint32_t height
        24 |   VkFragmentShadingRateCombinerOpKHR[2] combinerOps
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceFragmentShadingRateFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 pipelineFragmentShadingRate
        20 |   VkBool32 primitiveFragmentShadingRate
        24 |   VkBool32 attachmentFragmentShadingRate
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceFragmentShadingRatePropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   struct VkExtent2D minFragmentShadingRateAttachmentTexelSize
        16 |     uint32_t width
        20 |     uint32_t height
        24 |   struct VkExtent2D maxFragmentShadingRateAttachmentTexelSize
        24 |     uint32_t width
        28 |     uint32_t height
        32 |   uint32_t maxFragmentShadingRateAttachmentTexelSizeAspectRatio
        36 |   VkBool32 primitiveFragmentShadingRateWithMultipleViewports
        40 |   VkBool32 layeredShadingRateAttachments
        44 |   VkBool32 fragmentShadingRateNonTrivialCombinerOps
        48 |   struct VkExtent2D maxFragmentSize
        48 |     uint32_t width
        52 |     uint32_t height
        56 |   uint32_t maxFragmentSizeAspectRatio
        60 |   uint32_t maxFragmentShadingRateCoverageSamples
        64 |   VkSampleCountFlagBits maxFragmentShadingRateRasterizationSamples
        68 |   VkBool32 fragmentShadingRateWithShaderDepthStencilWrites
        72 |   VkBool32 fragmentShadingRateWithSampleMask
        76 |   VkBool32 fragmentShadingRateWithShaderSampleMask
        80 |   VkBool32 fragmentShadingRateWithConservativeRasterization
        84 |   VkBool32 fragmentShadingRateWithFragmentShaderInterlock
        88 |   VkBool32 fragmentShadingRateWithCustomSampleLocations
        92 |   VkBool32 fragmentShadingRateStrictMultiplyCombiner
           | [sizeof=96, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceFragmentShadingRateKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkSampleCountFlags sampleCounts
        20 |   struct VkExtent2D fragmentSize
        20 |     uint32_t width
        24 |     uint32_t height
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkRenderingFragmentShadingRateAttachmentInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImageView imageView
        24 |   VkImageLayout imageLayout
        28 |   struct VkExtent2D shadingRateAttachmentTexelSize
        28 |     uint32_t width
        32 |     uint32_t height
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderConstantDataFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderConstantData
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderAbortFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderAbort
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceFaultShaderAbortMessageInfoKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint64_t messageDataSize
        24 |   void * pMessageData
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderAbortPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint64_t maxShaderAbortMessageSize
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderQuadControlFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderQuadControl
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSurfaceProtectedCapabilitiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 supportsProtected
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePresentWaitFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 presentWait
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePipelineExecutablePropertiesFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 pipelineExecutableInfo
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipeline pipeline
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineExecutablePropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkShaderStageFlags stages
        20 |   char[256] name
       276 |   char[256] description
       532 |   uint32_t subgroupSize
           | [sizeof=536, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineExecutableInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipeline pipeline
        24 |   uint32_t executableIndex
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | union VkPipelineExecutableStatisticValueKHR
         0 |   VkBool32 b32
         0 |   int64_t i64
         0 |   uint64_t u64
         0 |   double f64
           | [sizeof=8, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineExecutableStatisticKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   char[256] name
       272 |   char[256] description
       528 |   VkPipelineExecutableStatisticFormatKHR format
       536 |   union VkPipelineExecutableStatisticValueKHR value
       536 |     VkBool32 b32
       536 |     int64_t i64
       536 |     uint64_t u64
       536 |     double f64
           | [sizeof=544, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineExecutableInternalRepresentationKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   char[256] name
       272 |   char[256] description
       528 |   VkBool32 isText
       536 |   size_t dataSize
       544 |   void * pData
           | [sizeof=552, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineLibraryCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t libraryCount
        24 |   const VkPipeline * pLibraries
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPresentIdKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t swapchainCount
        24 |   const uint64_t * pPresentIds
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePresentIdFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 presentId
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoEncodeFlagsKHR flags
        24 |   VkBuffer dstBuffer
        32 |   VkDeviceSize dstBufferOffset
        40 |   VkDeviceSize dstBufferRange
        48 |   struct VkVideoPictureResourceInfoKHR srcPictureResource
        48 |     VkStructureType sType
        56 |     const void * pNext
        64 |     struct VkOffset2D codedOffset
        64 |       int32_t x
        68 |       int32_t y
        72 |     struct VkExtent2D codedExtent
        72 |       uint32_t width
        76 |       uint32_t height
        80 |     uint32_t baseArrayLayer
        88 |     VkImageView imageViewBinding
        96 |   const VkVideoReferenceSlotInfoKHR * pSetupReferenceSlot
       104 |   uint32_t referenceSlotCount
       112 |   const VkVideoReferenceSlotInfoKHR * pReferenceSlots
       120 |   uint32_t precedingExternallyEncodedBytes
           | [sizeof=128, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeCapabilitiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkVideoEncodeCapabilityFlagsKHR flags
        20 |   VkVideoEncodeRateControlModeFlagsKHR rateControlModes
        24 |   uint32_t maxRateControlLayers
        32 |   uint64_t maxBitrate
        40 |   uint32_t maxQualityLevels
        44 |   struct VkExtent2D encodeInputPictureGranularity
        44 |     uint32_t width
        48 |     uint32_t height
        52 |   VkVideoEncodeFeedbackFlagsKHR supportedEncodeFeedbackFlags
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkQueryPoolVideoEncodeFeedbackCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoEncodeFeedbackFlagsKHR encodeFeedbackFlags
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeUsageInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoEncodeUsageFlagsKHR videoUsageHints
        20 |   VkVideoEncodeContentFlagsKHR videoContentHints
        24 |   VkVideoEncodeTuningModeKHR tuningMode
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeRateControlLayerInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint64_t averageBitrate
        24 |   uint64_t maxBitrate
        32 |   uint32_t frameRateNumerator
        36 |   uint32_t frameRateDenominator
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeRateControlInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoEncodeRateControlFlagsKHR flags
        20 |   VkVideoEncodeRateControlModeFlagBitsKHR rateControlMode
        24 |   uint32_t layerCount
        32 |   const VkVideoEncodeRateControlLayerInfoKHR * pLayers
        40 |   uint32_t virtualBufferSizeInMs
        44 |   uint32_t initialVirtualBufferSizeInMs
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceVideoEncodeQualityLevelInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const VkVideoProfileInfoKHR * pVideoProfile
        24 |   uint32_t qualityLevel
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeQualityLevelPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkVideoEncodeRateControlModeFlagBitsKHR preferredRateControlMode
        20 |   uint32_t preferredRateControlLayerCount
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeQualityLevelInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t qualityLevel
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeSessionParametersGetInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkVideoSessionParametersKHR videoSessionParameters
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoEncodeSessionParametersFeedbackInfoKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 hasOverrides
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceAddressRangeKHR
         0 |   VkDeviceAddress address
         8 |   VkDeviceSize size
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct VkStridedDeviceAddressRangeKHR
         0 |   VkDeviceAddress address
         8 |   VkDeviceSize size
        16 |   VkDeviceSize stride
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceMemoryCopyKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkDeviceAddressRangeKHR srcRange
        16 |     VkDeviceAddress address
        24 |     VkDeviceSize size
        32 |   VkAddressCommandFlagsKHR srcFlags
        40 |   struct VkDeviceAddressRangeKHR dstRange
        40 |     VkDeviceAddress address
        48 |     VkDeviceSize size
        56 |   VkAddressCommandFlagsKHR dstFlags
           | [sizeof=64, align=8]

*** Dumping AST Record Layout
         0 | struct VkCopyDeviceMemoryInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t regionCount
        24 |   const VkDeviceMemoryCopyKHR * pRegions
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkDeviceMemoryImageCopyKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkDeviceAddressRangeKHR addressRange
        16 |     VkDeviceAddress address
        24 |     VkDeviceSize size
        32 |   VkAddressCommandFlagsKHR addressFlags
        36 |   uint32_t addressRowLength
        40 |   uint32_t addressImageHeight
        44 |   struct VkImageSubresourceLayers imageSubresource
        44 |     VkImageAspectFlags aspectMask
        48 |     uint32_t mipLevel
        52 |     uint32_t baseArrayLayer
        56 |     uint32_t layerCount
        60 |   VkImageLayout imageLayout
        64 |   struct VkOffset3D imageOffset
        64 |     int32_t x
        68 |     int32_t y
        72 |     int32_t z
        76 |   struct VkExtent3D imageExtent
        76 |     uint32_t width
        80 |     uint32_t height
        84 |     uint32_t depth
           | [sizeof=88, align=8]

*** Dumping AST Record Layout
         0 | struct VkCopyDeviceMemoryImageInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkImage image
        24 |   uint32_t regionCount
        32 |   const VkDeviceMemoryImageCopyKHR * pRegions
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryRangeBarrierKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineStageFlags2 srcStageMask
        24 |   VkAccessFlags2 srcAccessMask
        32 |   VkPipelineStageFlags2 dstStageMask
        40 |   VkAccessFlags2 dstAccessMask
        48 |   uint32_t srcQueueFamilyIndex
        52 |   uint32_t dstQueueFamilyIndex
        56 |   struct VkDeviceAddressRangeKHR addressRange
        56 |     VkDeviceAddress address
        64 |     VkDeviceSize size
        72 |   VkAddressCommandFlagsKHR addressFlags
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryRangeBarriersInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t memoryRangeBarrierCount
        24 |   const VkMemoryRangeBarrierKHR * pMemoryRangeBarriers
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceDeviceAddressCommandsFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 deviceAddressCommands
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindIndexBuffer3InfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkDeviceAddressRangeKHR addressRange
        16 |     VkDeviceAddress address
        24 |     VkDeviceSize size
        32 |   VkAddressCommandFlagsKHR addressFlags
        36 |   VkIndexType indexType
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindVertexBuffer3InfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBool32 setStride
        24 |   struct VkStridedDeviceAddressRangeKHR addressRange
        24 |     VkDeviceAddress address
        32 |     VkDeviceSize size
        40 |     VkDeviceSize stride
        48 |   VkAddressCommandFlagsKHR addressFlags
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkDrawIndirect2InfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkStridedDeviceAddressRangeKHR addressRange
        16 |     VkDeviceAddress address
        24 |     VkDeviceSize size
        32 |     VkDeviceSize stride
        40 |   VkAddressCommandFlagsKHR addressFlags
        44 |   uint32_t drawCount
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkDrawIndirectCount2InfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkStridedDeviceAddressRangeKHR addressRange
        16 |     VkDeviceAddress address
        24 |     VkDeviceSize size
        32 |     VkDeviceSize stride
        40 |   VkAddressCommandFlagsKHR addressFlags
        48 |   struct VkDeviceAddressRangeKHR countAddressRange
        48 |     VkDeviceAddress address
        56 |     VkDeviceSize size
        64 |   VkAddressCommandFlagsKHR countAddressFlags
        68 |   uint32_t maxDrawCount
           | [sizeof=72, align=8]

*** Dumping AST Record Layout
         0 | struct VkDispatchIndirect2InfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkDeviceAddressRangeKHR addressRange
        16 |     VkDeviceAddress address
        24 |     VkDeviceSize size
        32 |   VkAddressCommandFlagsKHR addressFlags
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkConditionalRenderingBeginInfo2EXT
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkDeviceAddressRangeKHR addressRange
        16 |     VkDeviceAddress address
        24 |     VkDeviceSize size
        32 |   VkAddressCommandFlagsKHR addressFlags
        36 |   VkConditionalRenderingFlagsEXT flags
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkBindTransformFeedbackBuffer2InfoEXT
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   struct VkDeviceAddressRangeKHR addressRange
        16 |     VkDeviceAddress address
        24 |     VkDeviceSize size
        32 |   VkAddressCommandFlagsKHR addressFlags
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkMemoryMarkerInfoAMD
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPipelineStageFlags2KHR stage
        24 |   struct VkDeviceAddressRangeKHR dstRange
        24 |     VkDeviceAddress address
        32 |     VkDeviceSize size
        40 |   VkAddressCommandFlagsKHR dstFlags
        44 |   uint32_t marker
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkAccelerationStructureCreateInfo2KHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkAccelerationStructureCreateFlagsKHR createFlags
        24 |   struct VkDeviceAddressRangeKHR addressRange
        24 |     VkDeviceAddress address
        32 |     VkDeviceSize size
        40 |   VkAddressCommandFlagsKHR addressFlags
        44 |   VkAccelerationStructureTypeKHR type
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceFragmentShaderBarycentricFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 fragmentShaderBarycentric
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceFragmentShaderBarycentricPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 triStripVertexOrderIndependentOfProvokingVertex
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderSubgroupUniformControlFlowFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderSubgroupUniformControlFlow
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceWorkgroupMemoryExplicitLayoutFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 workgroupMemoryExplicitLayout
        20 |   VkBool32 workgroupMemoryExplicitLayoutScalarBlockLayout
        24 |   VkBool32 workgroupMemoryExplicitLayout8BitAccess
        28 |   VkBool32 workgroupMemoryExplicitLayout16BitAccess
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceRayTracingMaintenance1FeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 rayTracingMaintenance1
        20 |   VkBool32 rayTracingPipelineTraceRaysIndirect2
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkTraceRaysIndirectCommand2KHR
         0 |   VkDeviceAddress raygenShaderRecordAddress
         8 |   VkDeviceSize raygenShaderRecordSize
        16 |   VkDeviceAddress missShaderBindingTableAddress
        24 |   VkDeviceSize missShaderBindingTableSize
        32 |   VkDeviceSize missShaderBindingTableStride
        40 |   VkDeviceAddress hitShaderBindingTableAddress
        48 |   VkDeviceSize hitShaderBindingTableSize
        56 |   VkDeviceSize hitShaderBindingTableStride
        64 |   VkDeviceAddress callableShaderBindingTableAddress
        72 |   VkDeviceSize callableShaderBindingTableSize
        80 |   VkDeviceSize callableShaderBindingTableStride
        88 |   uint32_t width
        92 |   uint32_t height
        96 |   uint32_t depth
           | [sizeof=104, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderUntypedPointersFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderUntypedPointers
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceShaderMaximalReconvergenceFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 shaderMaximalReconvergence
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSurfaceCapabilitiesPresentId2KHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 presentId2Supported
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPresentId2KHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t swapchainCount
        24 |   const uint64_t * pPresentIds
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePresentId2FeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 presentId2
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSurfaceCapabilitiesPresentWait2KHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 presentWait2Supported
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePresentWait2FeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 presentWait2
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPresentWait2InfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint64_t presentId
        24 |   uint64_t timeout
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceRayTracingPositionFetchFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 rayTracingPositionFetch
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePipelineBinaryFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 pipelineBinaries
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDevicePipelineBinaryPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 pipelineBinaryInternalCache
        20 |   VkBool32 pipelineBinaryInternalCacheControl
        24 |   VkBool32 pipelineBinaryPrefersInternalCache
        28 |   VkBool32 pipelineBinaryPrecompiledInternalCache
        32 |   VkBool32 pipelineBinaryCompressedData
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkDevicePipelineBinaryInternalCacheControlKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkBool32 disableInternalCache
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineBinaryKeyKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t keySize
        20 |   uint8_t[32] key
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineBinaryDataKHR
         0 |   size_t dataSize
         8 |   void * pData
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineBinaryKeysAndDataKHR
         0 |   uint32_t binaryCount
         8 |   const VkPipelineBinaryKeyKHR * pPipelineBinaryKeys
        16 |   const VkPipelineBinaryDataKHR * pPipelineBinaryData
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineCreateInfoKHR
         0 |   VkStructureType sType
         8 |   void * pNext
           | [sizeof=16, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineBinaryCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const VkPipelineBinaryKeysAndDataKHR * pKeysAndDataInfo
        24 |   VkPipeline pipeline
        32 |   const VkPipelineCreateInfoKHR * pPipelineCreateInfo
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineBinaryInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t binaryCount
        24 |   const VkPipelineBinaryKHR * pPipelineBinaries
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkReleaseCapturedPipelineDataInfoKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkPipeline pipeline
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineBinaryDataInfoKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkPipelineBinaryKHR pipelineBinary
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPipelineBinaryHandlesInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t pipelineBinaryCount
        24 |   VkPipelineBinaryKHR * pPipelineBinaries
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkSurfacePresentModeKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkPresentModeKHR presentMode
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSurfacePresentScalingCapabilitiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkPresentScalingFlagsKHR supportedPresentScaling
        20 |   VkPresentGravityFlagsKHR supportedPresentGravityX
        24 |   VkPresentGravityFlagsKHR supportedPresentGravityY
        28 |   struct VkExtent2D minScaledImageExtent
        28 |     uint32_t width
        32 |     uint32_t height
        36 |   struct VkExtent2D maxScaledImageExtent
        36 |     uint32_t width
        40 |     uint32_t height
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct VkSurfacePresentModeCompatibilityKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t presentModeCount
        24 |   VkPresentModeKHR * pPresentModes
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceSwapchainMaintenance1FeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 swapchainMaintenance1
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkSwapchainPresentFenceInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t swapchainCount
        24 |   const VkFence * pFences
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkSwapchainPresentModesCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t presentModeCount
        24 |   const VkPresentModeKHR * pPresentModes
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkSwapchainPresentModeInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   uint32_t swapchainCount
        24 |   const VkPresentModeKHR * pPresentModes
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkSwapchainPresentScalingCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkPresentScalingFlagsKHR scalingBehavior
        20 |   VkPresentGravityFlagsKHR presentGravityX
        24 |   VkPresentGravityFlagsKHR presentGravityY
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct VkReleaseSwapchainImagesInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   VkSwapchainKHR swapchain
        24 |   uint32_t imageIndexCount
        32 |   const uint32_t * pImageIndices
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceInternallySynchronizedQueuesFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 internallySynchronizedQueues
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkCooperativeMatrixPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   uint32_t MSize
        20 |   uint32_t NSize
        24 |   uint32_t KSize
        28 |   VkComponentTypeKHR AType
        32 |   VkComponentTypeKHR BType
        36 |   VkComponentTypeKHR CType
        40 |   VkComponentTypeKHR ResultType
        44 |   VkBool32 saturatingAccumulation
        48 |   VkScopeKHR scope
           | [sizeof=56, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceCooperativeMatrixFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 cooperativeMatrix
        20 |   VkBool32 cooperativeMatrixRobustBufferAccess
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceCooperativeMatrixPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkShaderStageFlags cooperativeMatrixSupportedStages
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceComputeShaderDerivativesFeaturesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 computeDerivativeGroupQuads
        20 |   VkBool32 computeDerivativeGroupLinear
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkPhysicalDeviceComputeShaderDerivativesPropertiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   VkBool32 meshAndTaskShaderDerivatives
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1ColorConfigFlags
     0:0-0 |   uint32_t mono_chrome
     0:1-1 |   uint32_t color_range
     0:2-2 |   uint32_t separate_uv_delta_q
     0:3-3 |   uint32_t color_description_present_flag
    0:4-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1ColorConfig
         0 |   struct StdVideoAV1ColorConfigFlags flags
     0:0-0 |     uint32_t mono_chrome
     0:1-1 |     uint32_t color_range
     0:2-2 |     uint32_t separate_uv_delta_q
     0:3-3 |     uint32_t color_description_present_flag
    0:4-31 |     uint32_t reserved
         4 |   uint8_t BitDepth
         5 |   uint8_t subsampling_x
         6 |   uint8_t subsampling_y
         7 |   uint8_t reserved1
         8 |   StdVideoAV1ColorPrimaries color_primaries
        12 |   StdVideoAV1TransferCharacteristics transfer_characteristics
        16 |   StdVideoAV1MatrixCoefficients matrix_coefficients
        20 |   StdVideoAV1ChromaSamplePosition chroma_sample_position
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1TimingInfoFlags
     0:0-0 |   uint32_t equal_picture_interval
    0:1-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1TimingInfo
         0 |   struct StdVideoAV1TimingInfoFlags flags
     0:0-0 |     uint32_t equal_picture_interval
    0:1-31 |     uint32_t reserved
         4 |   uint32_t num_units_in_display_tick
         8 |   uint32_t time_scale
        12 |   uint32_t num_ticks_per_picture_minus_1
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1LoopFilterFlags
     0:0-0 |   uint32_t loop_filter_delta_enabled
     0:1-1 |   uint32_t loop_filter_delta_update
    0:2-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1LoopFilter
         0 |   struct StdVideoAV1LoopFilterFlags flags
     0:0-0 |     uint32_t loop_filter_delta_enabled
     0:1-1 |     uint32_t loop_filter_delta_update
    0:2-31 |     uint32_t reserved
         4 |   uint8_t[4] loop_filter_level
         8 |   uint8_t loop_filter_sharpness
         9 |   uint8_t update_ref_delta
        10 |   int8_t[8] loop_filter_ref_deltas
        18 |   uint8_t update_mode_delta
        19 |   int8_t[2] loop_filter_mode_deltas
           | [sizeof=24, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1QuantizationFlags
     0:0-0 |   uint32_t using_qmatrix
     0:1-1 |   uint32_t diff_uv_delta
    0:2-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1Quantization
         0 |   struct StdVideoAV1QuantizationFlags flags
     0:0-0 |     uint32_t using_qmatrix
     0:1-1 |     uint32_t diff_uv_delta
    0:2-31 |     uint32_t reserved
         4 |   uint8_t base_q_idx
         5 |   int8_t DeltaQYDc
         6 |   int8_t DeltaQUDc
         7 |   int8_t DeltaQUAc
         8 |   int8_t DeltaQVDc
         9 |   int8_t DeltaQVAc
        10 |   uint8_t qm_y
        11 |   uint8_t qm_u
        12 |   uint8_t qm_v
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1Segmentation
         0 |   uint8_t[8] FeatureEnabled
         8 |   int16_t[8][8] FeatureData
           | [sizeof=136, align=2]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1TileInfoFlags
     0:0-0 |   uint32_t uniform_tile_spacing_flag
    0:1-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1TileInfo
         0 |   struct StdVideoAV1TileInfoFlags flags
     0:0-0 |     uint32_t uniform_tile_spacing_flag
    0:1-31 |     uint32_t reserved
         4 |   uint8_t TileCols
         5 |   uint8_t TileRows
         6 |   uint16_t context_update_tile_id
         8 |   uint8_t tile_size_bytes_minus_1
         9 |   uint8_t[7] reserved1
        16 |   const uint16_t * pMiColStarts
        24 |   const uint16_t * pMiRowStarts
        32 |   const uint16_t * pWidthInSbsMinus1
        40 |   const uint16_t * pHeightInSbsMinus1
           | [sizeof=48, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1CDEF
         0 |   uint8_t cdef_damping_minus_3
         1 |   uint8_t cdef_bits
         2 |   uint8_t[8] cdef_y_pri_strength
        10 |   uint8_t[8] cdef_y_sec_strength
        18 |   uint8_t[8] cdef_uv_pri_strength
        26 |   uint8_t[8] cdef_uv_sec_strength
           | [sizeof=34, align=1]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1LoopRestoration
         0 |   StdVideoAV1FrameRestorationType[3] FrameRestorationType
        12 |   uint16_t[3] LoopRestorationSize
           | [sizeof=20, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1GlobalMotion
         0 |   uint8_t[8] GmType
         8 |   int32_t[8][6] gm_params
           | [sizeof=200, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1FilmGrainFlags
     0:0-0 |   uint32_t chroma_scaling_from_luma
     0:1-1 |   uint32_t overlap_flag
     0:2-2 |   uint32_t clip_to_restricted_range
     0:3-3 |   uint32_t update_grain
    0:4-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1FilmGrain
         0 |   struct StdVideoAV1FilmGrainFlags flags
     0:0-0 |     uint32_t chroma_scaling_from_luma
     0:1-1 |     uint32_t overlap_flag
     0:2-2 |     uint32_t clip_to_restricted_range
     0:3-3 |     uint32_t update_grain
    0:4-31 |     uint32_t reserved
         4 |   uint8_t grain_scaling_minus_8
         5 |   uint8_t ar_coeff_lag
         6 |   uint8_t ar_coeff_shift_minus_6
         7 |   uint8_t grain_scale_shift
         8 |   uint16_t grain_seed
        10 |   uint8_t film_grain_params_ref_idx
        11 |   uint8_t num_y_points
        12 |   uint8_t[14] point_y_value
        26 |   uint8_t[14] point_y_scaling
        40 |   uint8_t num_cb_points
        41 |   uint8_t[10] point_cb_value
        51 |   uint8_t[10] point_cb_scaling
        61 |   uint8_t num_cr_points
        62 |   uint8_t[10] point_cr_value
        72 |   uint8_t[10] point_cr_scaling
        82 |   int8_t[24] ar_coeffs_y_plus_128
       106 |   int8_t[25] ar_coeffs_cb_plus_128
       131 |   int8_t[25] ar_coeffs_cr_plus_128
       156 |   uint8_t cb_mult
       157 |   uint8_t cb_luma_mult
       158 |   uint16_t cb_offset
       160 |   uint8_t cr_mult
       161 |   uint8_t cr_luma_mult
       162 |   uint16_t cr_offset
           | [sizeof=164, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1SequenceHeaderFlags
     0:0-0 |   uint32_t still_picture
     0:1-1 |   uint32_t reduced_still_picture_header
     0:2-2 |   uint32_t use_128x128_superblock
     0:3-3 |   uint32_t enable_filter_intra
     0:4-4 |   uint32_t enable_intra_edge_filter
     0:5-5 |   uint32_t enable_interintra_compound
     0:6-6 |   uint32_t enable_masked_compound
     0:7-7 |   uint32_t enable_warped_motion
     1:0-0 |   uint32_t enable_dual_filter
     1:1-1 |   uint32_t enable_order_hint
     1:2-2 |   uint32_t enable_jnt_comp
     1:3-3 |   uint32_t enable_ref_frame_mvs
     1:4-4 |   uint32_t frame_id_numbers_present_flag
     1:5-5 |   uint32_t enable_superres
     1:6-6 |   uint32_t enable_cdef
     1:7-7 |   uint32_t enable_restoration
     2:0-0 |   uint32_t film_grain_params_present
     2:1-1 |   uint32_t timing_info_present_flag
     2:2-2 |   uint32_t initial_display_delay_present_flag
    2:3-15 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoAV1SequenceHeader
         0 |   struct StdVideoAV1SequenceHeaderFlags flags
     0:0-0 |     uint32_t still_picture
     0:1-1 |     uint32_t reduced_still_picture_header
     0:2-2 |     uint32_t use_128x128_superblock
     0:3-3 |     uint32_t enable_filter_intra
     0:4-4 |     uint32_t enable_intra_edge_filter
     0:5-5 |     uint32_t enable_interintra_compound
     0:6-6 |     uint32_t enable_masked_compound
     0:7-7 |     uint32_t enable_warped_motion
     1:0-0 |     uint32_t enable_dual_filter
     1:1-1 |     uint32_t enable_order_hint
     1:2-2 |     uint32_t enable_jnt_comp
     1:3-3 |     uint32_t enable_ref_frame_mvs
     1:4-4 |     uint32_t frame_id_numbers_present_flag
     1:5-5 |     uint32_t enable_superres
     1:6-6 |     uint32_t enable_cdef
     1:7-7 |     uint32_t enable_restoration
     2:0-0 |     uint32_t film_grain_params_present
     2:1-1 |     uint32_t timing_info_present_flag
     2:2-2 |     uint32_t initial_display_delay_present_flag
    2:3-15 |     uint32_t reserved
         4 |   StdVideoAV1Profile seq_profile
         8 |   uint8_t frame_width_bits_minus_1
         9 |   uint8_t frame_height_bits_minus_1
        10 |   uint16_t max_frame_width_minus_1
        12 |   uint16_t max_frame_height_minus_1
        14 |   uint8_t delta_frame_id_length_minus_2
        15 |   uint8_t additional_frame_id_length_minus_1
        16 |   uint8_t order_hint_bits_minus_1
        17 |   uint8_t seq_force_integer_mv
        18 |   uint8_t seq_force_screen_content_tools
        19 |   uint8_t[5] reserved1
        24 |   const StdVideoAV1ColorConfig * pColorConfig
        32 |   const StdVideoAV1TimingInfo * pTimingInfo
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoDecodeAV1PictureInfoFlags
     0:0-0 |   uint32_t error_resilient_mode
     0:1-1 |   uint32_t disable_cdf_update
     0:2-2 |   uint32_t use_superres
     0:3-3 |   uint32_t render_and_frame_size_different
     0:4-4 |   uint32_t allow_screen_content_tools
     0:5-5 |   uint32_t is_filter_switchable
     0:6-6 |   uint32_t force_integer_mv
     0:7-7 |   uint32_t frame_size_override_flag
     1:0-0 |   uint32_t buffer_removal_time_present_flag
     1:1-1 |   uint32_t allow_intrabc
     1:2-2 |   uint32_t frame_refs_short_signaling
     1:3-3 |   uint32_t allow_high_precision_mv
     1:4-4 |   uint32_t is_motion_mode_switchable
     1:5-5 |   uint32_t use_ref_frame_mvs
     1:6-6 |   uint32_t disable_frame_end_update_cdf
     1:7-7 |   uint32_t allow_warped_motion
     2:0-0 |   uint32_t reduced_tx_set
     2:1-1 |   uint32_t reference_select
     2:2-2 |   uint32_t skip_mode_present
     2:3-3 |   uint32_t delta_q_present
     2:4-4 |   uint32_t delta_lf_present
     2:5-5 |   uint32_t delta_lf_multi
     2:6-6 |   uint32_t segmentation_enabled
     2:7-7 |   uint32_t segmentation_update_map
     3:0-0 |   uint32_t segmentation_temporal_update
     3:1-1 |   uint32_t segmentation_update_data
     3:2-2 |   uint32_t UsesLr
     3:3-3 |   uint32_t usesChromaLr
     3:4-4 |   uint32_t apply_grain
     3:5-7 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoDecodeAV1PictureInfo
         0 |   struct StdVideoDecodeAV1PictureInfoFlags flags
     0:0-0 |     uint32_t error_resilient_mode
     0:1-1 |     uint32_t disable_cdf_update
     0:2-2 |     uint32_t use_superres
     0:3-3 |     uint32_t render_and_frame_size_different
     0:4-4 |     uint32_t allow_screen_content_tools
     0:5-5 |     uint32_t is_filter_switchable
     0:6-6 |     uint32_t force_integer_mv
     0:7-7 |     uint32_t frame_size_override_flag
     1:0-0 |     uint32_t buffer_removal_time_present_flag
     1:1-1 |     uint32_t allow_intrabc
     1:2-2 |     uint32_t frame_refs_short_signaling
     1:3-3 |     uint32_t allow_high_precision_mv
     1:4-4 |     uint32_t is_motion_mode_switchable
     1:5-5 |     uint32_t use_ref_frame_mvs
     1:6-6 |     uint32_t disable_frame_end_update_cdf
     1:7-7 |     uint32_t allow_warped_motion
     2:0-0 |     uint32_t reduced_tx_set
     2:1-1 |     uint32_t reference_select
     2:2-2 |     uint32_t skip_mode_present
     2:3-3 |     uint32_t delta_q_present
     2:4-4 |     uint32_t delta_lf_present
     2:5-5 |     uint32_t delta_lf_multi
     2:6-6 |     uint32_t segmentation_enabled
     2:7-7 |     uint32_t segmentation_update_map
     3:0-0 |     uint32_t segmentation_temporal_update
     3:1-1 |     uint32_t segmentation_update_data
     3:2-2 |     uint32_t UsesLr
     3:3-3 |     uint32_t usesChromaLr
     3:4-4 |     uint32_t apply_grain
     3:5-7 |     uint32_t reserved
         4 |   StdVideoAV1FrameType frame_type
         8 |   uint32_t current_frame_id
        12 |   uint8_t OrderHint
        13 |   uint8_t primary_ref_frame
        14 |   uint8_t refresh_frame_flags
        15 |   uint8_t reserved1
        16 |   StdVideoAV1InterpolationFilter interpolation_filter
        20 |   StdVideoAV1TxMode TxMode
        24 |   uint8_t delta_q_res
        25 |   uint8_t delta_lf_res
        26 |   uint8_t[2] SkipModeFrame
        28 |   uint8_t coded_denom
        29 |   uint8_t[3] reserved2
        32 |   uint8_t[8] OrderHints
        40 |   uint32_t[8] expectedFrameId
        72 |   const StdVideoAV1TileInfo * pTileInfo
        80 |   const StdVideoAV1Quantization * pQuantization
        88 |   const StdVideoAV1Segmentation * pSegmentation
        96 |   const StdVideoAV1LoopFilter * pLoopFilter
       104 |   const StdVideoAV1CDEF * pCDEF
       112 |   const StdVideoAV1LoopRestoration * pLoopRestoration
       120 |   const StdVideoAV1GlobalMotion * pGlobalMotion
       128 |   const StdVideoAV1FilmGrain * pFilmGrain
           | [sizeof=136, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoDecodeAV1ReferenceInfoFlags
     0:0-0 |   uint32_t disable_frame_end_update_cdf
     0:1-1 |   uint32_t segmentation_enabled
    0:2-31 |   uint32_t reserved
           | [sizeof=4, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoDecodeAV1ReferenceInfo
         0 |   struct StdVideoDecodeAV1ReferenceInfoFlags flags
     0:0-0 |     uint32_t disable_frame_end_update_cdf
     0:1-1 |     uint32_t segmentation_enabled
    0:2-31 |     uint32_t reserved
         4 |   uint8_t frame_type
         5 |   uint8_t RefFrameSignBias
         6 |   uint8_t OrderHint
         7 |   uint8_t[8] SavedOrderHints
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeAV1ProfileInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   StdVideoAV1Profile stdProfile
        20 |   VkBool32 filmGrainSupport
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeAV1CapabilitiesKHR
         0 |   VkStructureType sType
         8 |   void * pNext
        16 |   StdVideoAV1Level maxLevel
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeAV1SessionParametersCreateInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const StdVideoAV1SequenceHeader * pStdSequenceHeader
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeAV1PictureInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const StdVideoDecodeAV1PictureInfo * pStdPictureInfo
        24 |   int32_t[7] referenceNameSlotIndices
        52 |   uint32_t frameHeaderOffset
        56 |   uint32_t tileCount
        64 |   const uint32_t * pTileOffsets
        72 |   const uint32_t * pTileSizes
           | [sizeof=80, align=8]

*** Dumping AST Record Layout
         0 | struct VkVideoDecodeAV1DpbSlotInfoKHR
         0 |   VkStructureType sType
         8 |   const void * pNext
        16 |   const StdVideoDecodeAV1ReferenceInfo * pStdReferenceInfo
           | [sizeof=24, align=8]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeAV1DecoderModelInfo
         0 |   uint8_t buffer_delay_length_minus_1
         1 |   uint8_t buffer_removal_time_length_minus_1
         2 |   uint8_t frame_presentation_time_length_minus_1
         3 |   uint8_t reserved1
         4 |   uint32_t num_units_in_decoding_tick
           | [sizeof=8, align=4]

*** Dumping AST Record Layout
         0 | struct StdVideoEncodeAV1ExtensionHeader
